Repository: DidierSpaier/slint-translations
Catalog: toolbox/wip/*.auto.po
Languages: pt_pt

source: The passphrase should include at least one lower case letter.
pt_pt: A frase-passe deve incluir pelo menos uma letra minúscula.

source: The passphrase should include at least one capital letter.
pt_pt: A frase-passe deve incluir pelo menos uma letra maiúscula.

source: The passphrase should include at least one digit.
pt_pt: A frase-passe deve incluir pelo menos um dígito.

source: The passphrase should include at least one punctuation character.
pt_pt: A frase-passe deve incluir pelo menos um carácter de pontuação.

source: Please type again the passphrase, to check:
pt_pt: Escreva novamente a frase-passe, para verificar:

source: Passphrases do not match. please try again.
pt_pt: As frases-passe não coincidem. Tente novamente.

source: Encrypting the root Slint partition...
pt_pt: A encriptar a partição root do Slint...

source: Installing the first software packages...
pt_pt: A instalar os primeiros pacotes de software...

source: Generating a decryption keyfile...
pt_pt: A gerar um ficheiro-chave de desencriptação...

source: The user "root" has all rights on the system, including to wipe it. This status should be accessed only with a good password.
pt_pt: O utilizador "root" tem todos os direitos sobre o sistema, incluindo o de o eliminar. Este estado deve ser acedido apenas com uma boa palavra-passe.

source: Please type the password for $THISUSER:
pt_pt: Introduza a palavra-passe para $THISUSER:

source: The password should have at least 6 characters.
pt_pt: A palavra-passe deve ter pelo menos 6 caracteres.

source: Please type again the password for $THISUSER, to check:
pt_pt: Introduza novamente a palavra-passe de $THISUSER, para verificar:

source: Passwords do not match. please try again.
pt_pt: As palavras-passe não coincidem. Tente novamente.

source: We will now set up an account for a regular user. Other user accounts can be set up after installation. We need to know under which name this user will log in to access Slint.
pt_pt: Vamos agora criar uma conta para um utilizador padrão. Outras contas de utilizador podem ser configuradas após a instalação. Precisamos de saber com que nome este utilizador iniciará sessão para aceder ao Slint.

source: Login name of the first registered user:
pt_pt: Nome de acesso do primeiro utilizador registado:

source: The username should not begin with a '_'
pt_pt: O nome de utilizador não deve começar com um '_'

source: The user name should only contains non accented lower case letters, digits from 0 to 9, '_' or '-'
pt_pt: O nome de utilizador deve conter apenas letras minúsculas, dígitos de 0 a 9, '_' ou '-'

source: Blind users can run Slint with a Braille device or a screen reader.
pt_pt: Os utilizadores invisuais podem executar o Slint com um dispositivo Braile ou um leitor de ecrã.

source: Will you use a Braille device? Please answer yes or no:
pt_pt: Vai usar um dispositivo Braile? Responda yes ou no:

source: Do you want to start Slint in a console or in graphical mode?
pt_pt: Quer iniciar o Slint numa consola ou em modo gráfico?

source: Type c for console or g for graphical, or h for help then press Enter:
pt_pt: Escreva c para consola ou g para gráfico, ou h para ajuda, e prima Enter:

source: In the next dialog, you will choose the language for your Slint System.
pt_pt: Na caixa de diálogo seguinte, seleciona o idioma do seu sistema Slint.

source: Press Enter to continue:
pt_pt: Prima Enter para continuar:

source: Please wait...
pt_pt: Aguarde...

source: Should we try to get a wifi connection? Please type yes or no:
pt_pt: Devemos tentar obter uma ligação Wi-Fi? Escreva yes ou no:

source: Scanning the wifi networks...
pt_pt: A analisar as redes Wi-Fi...

source: No wifi network detected.
pt_pt: Nenhuma rede Wi-Fi detetada.

source: Wrong SSID.
pt_pt: SSID incorreto.

source: Press Enter to try again or type q to give up:
pt_pt: Prima Enter para tentar novamente ou escreva q para sair:

source: A WPA passphrase should have between 8 and 63 characters
pt_pt: Uma frase-passe WPA deve ter entre 8 e 63 caracteres

source: Wrong passphrase. Press Enter to try again or type q to quit:
pt_pt: Frase-passe incorreta. Prima Enter para tentar novamente ou escreva q para sair:

source: Wifi connection failed. Wrong passphrase?
pt_pt: Falha de ligação à Wi-Fi. Frase-passe incorreta?

source: Press Enter to try again or type q to quit:
pt_pt: Prima Enter para tentar novamente ou escreva q para sair:

source: Are credentials requested to use $SSID? Type yes or no:
pt_pt: As credenciais são solicitadas para utilizar $SSID? Escreva yes ou no:

source: Wifi connection failed.
pt_pt: Falha de ligação Wi-Fi.

source: You will now type the credentials in a web browser.
pt_pt: Irá agora introduzir as credenciais num navegador web.

source: When done press Q to quit the browser.
pt_pt: Quando terminar, prima Q para sair do navegador.

source: Press Enter to start the browser or type h for help on its usage:
pt_pt: Prima Enter para iniciar o navegador de Internet ou escreva h para obter ajuda sobre a sua utilização:

source: Please type the password for $SSID, or q to give up using wifi:
pt_pt: Introduza a palavra-passe para $SSID, ou q para desistir de utilizar Wi-Fi:

source: A password is requested.
pt_pt: É necessário uma palavra-passe.

source: Wrong password. Try again.
pt_pt: Palavra-passe incorreta. Tente novamente.

source: Setting of the time zone.
pt_pt: Configuração do fuso horário.

source: Is $PROPOSEDTZ the current time zone? type yes or no:
pt_pt: $PROPOSEDTZ é o fuso horário atual? Escreva yes ou no:

source: You can set the time zone now, or accept the default value (UTC) and modify this setting after installation.
pt_pt: Pode definir agora o fuso horário, ou aceitar o valor predefinido (UTC) e modificar esta configuração após a instalação.

source: To set the time zone now type yes, else type no:
pt_pt: Para definir o fuso horário escreva agora yes, caso contrário escreva no:

source: We will now install all packages. This takes about 10 to 40 minutes.
pt_pt: Iremos agora instalar todos os pacotes. Isto leva cerca de 10 a 40 minutos.

source: Do you want a short description of each package during its installation?
pt_pt: Deseja uma breve descrição de cada pacote durante a sua instalação?

source: Installing the packages. Please be patient.
pt_pt: A instalar os pacotes. Seja paciente.

source: Preparing packages installation...
pt_pt: A preparar a instalação de pacotes...

source: Please type the machine name or "hostname" and press Enter or just press Enter to accept the default name "slint".
pt_pt: Introduza o nome da máquina ou "hostname" e prima Enter ou apenas prima Enter para aceitar o nome predefinido "slint".

source: Machine name[slint]:
pt_pt: Nome da máquina[slint]:

source: Your choice:
pt_pt: A sua escolha:

source: $session has been chosen.
pt_pt: $session foi escolhido.

source: Please select a default desktop among those listed below. mate is the most accessible with a screen reader.
pt_pt: Selecione um ambiente de trabalho predefinido entre os listados abaixo. O mate é o mais acessível com um leitor de ecrã.

source: i3 is also accessible. If you need speech, preferably type i38 before starting it.
pt_pt: O i3 também está acessível. Se precisar de voz, escreva preferencialmente i38 antes de o iniciar.

source: building an initramfs...
pt_pt: a criar um initramfs...

source: Installing the GRUB bootloader...
pt_pt: A instalar o carregador de arranque GRUB...

source: Building the GRUB boot menu...
pt_pt: A criar o menu de arranque GRUB...

source: Installation and initial configuration of Slint are complete. If you want a preview of the boot menu displayed after rebooting, type now: chroot /SLINT list_boot_entries To exit press q (not Alt+F4 in this context) then y. To quit the installer and start your new Slint remove the installation media then type 'reboot' or press Ctrl+Alt+Del.
pt_pt: A instalação e configuração inicial do Slint estão concluídas. Se quiser uma pré-visualização do menu de arranque depois de reiniciar, escreva agora: chroot /SLINT list_boot_entries Para sair prima q (não Alt+F4 neste contexto) e depois y. Para sair do instalador e iniciar o seu novo Slint, remova o suporte de instalação e depois escreva 'reboot' ou prima Ctrl+Alt+Del.
