Repository: DidierSpaier/slint-translations
Catalog: toolbox/wip/*.auto.po
Languages: pt_pt

source: There don't seem to be any partitions on this machine of type Linux and size at least ${GCOUNT}G. You need one to install Linux. For more information, choose 'doc' from the menu.
pt_pt: Não parece haver nenhuma partição nesta máquina do tipo Linux e de tamanho com pelo menos ${GCOUNT}G. Precisa de uma para instalar o Linux. Para mais informação, escolha 'doc.' a partir do ementa.

source: This machine booted in EFI mode but no big enough EFI System Partition found. For more information. choose 'doc' from the menu.
pt_pt: Esta máquina iniciou em modo EFI, mas não foi encontrada uma partição do sistema EFI suficientemente grande. Para mais informação, escolha 'doc' a partir do menu.

source: If the root partition is in a drive with a GPT, GRUB needs a BIOS boot partition on the same drive, of size at least 3M. We didn't find such a configuration.
pt_pt: Se a partição root estiver numa unidade com GPT, o GRUB precisa de uma partição BIOS boot na mesma unidade, com o tamanho de pelo menos 3M. Não foi encontrada tal configuração.

source: We didn't find a drive of size at least ${GCOUNT}G and no mounted partition, so the automatic partitioning is not possible.
pt_pt: Não foi encontrada uma unidade de tamanho mínimo de ${GCOUNT}G e nenhuma partição montada, por isso o particionamento automático não é possível.

source: The machine booted in EFI mode but we did not find a potential root partition with an EFI system partition on the same drive so the manual partitioning mode is not possible.
pt_pt: A máquina arrancou em modo EFI mas não foi encontrada uma potencial partição root com uma partição do sistema EFI na mesma unidade, por isso o modo de particionamento manual não é possível.

source: Press Enter to go back to the menu
pt_pt: Prima Enter para voltar ao menu

source: Welcome back to the menu of the Slint installer. You may now type (without the quotes): 'doc' to know the features and usage of the installer. 'start' to start the installation. The installer can prepare the drive where Slint will be installed, creating the the needed partitions. If you prefer you can do it yourself using command line utilities available in the installer, then type 'start' when done. You can also leave the installer and use a tool like gparted to do that then start the installer again. We recommend that you type 'doc' first in this case, or if you want to encrypt the root Slint partition. When you finish reading this menu will be displayed again.
pt_pt: Bem-vindo de volta ao menu do instalador Slint. Pode agora escrever (sem os apóstrofos): 'doc' para conhecer as funcionalidades e utilização do instalador. 'start' para iniciar a instalação. O instalador pode preparar a unidade onde o Slint será instalado, criando as partições necessárias. Se preferir, pode fazê-lo você mesmo utilizando utilitários de linha de comandos disponíveis no instalador, depois escreva 'start'. quando concluído. Também pode sair do instalador e utilizar uma ferramenta como o gparted para o fazer e depois iniciar o instalador novamente. Recomendamos que escreva 'doc' primeiro neste caso, ou se quiser encriptar a partição root do Slint. Quando terminar de ler, este menu será novamente apresentado.

source: Therefore, Slint installation is not possible.
pt_pt: Por conseguinte, a instalação do Slint não é possível.

source: In manual partitioning mode you partition and format the drive where you want to install Slint to your liking, using utilities it includes. This gives you more choices of partitions layout and file systems but needs to be acquainted to Linux and the command line (but you may also have used a tool like gparted live before starting the installer, or from another system).
pt_pt: No modo de particionamento manual, particiona e formata a unidade onde pretende instalar o Slint ao seu gosto, utilizando utilitários que inclui. Isto dá-lhe mais opções de esquema de partições e sistemas de ficheiros, mas precisa de se mais conhecedor do Linux e da linha de comandos (mas também pode ter utilizado uma ferramenta como o gparted live antes de iniciar o instalador, ou de outro sistema).

source: In auto mode the installer do it for you, but chooses the partition layout and the file system.
pt_pt: No modo auto o instalador faz isso por si, mas escolhe o esquema de partições e o sistema de ficheiros.

source: In both modes you will be given a chance to indicate existing partitions (not needed by Slint) that you want to access from Slint.
pt_pt: Em ambos os modos, ser-lhe-á dada a oportunidade de indicar a existência de partições (não necessárias pelo Slint) que pretende aceder a partir do Slint.

source: Press Enter to continue
pt_pt: Prima Enter para continuar

source: These directories should not be mounted on separate partitions: $RESERVED or use arbitrary directory names, for instance to mount other Linux systems.
pt_pt: Estes diretórios não devem ser montados em partições separadas: $RESERVED ou usar nomes de diretórios arbitrários, por exemplo, para montar outros sistemas Linux.

source: You may dedicate all the space available on the drive (${ARG2}G) to the root Slint partition, or make this partition smaller (at least ${ARG1}G) to reserve some space for a future use, like setting up a partition shared across OS or installing later another OS alongside Slint. To dedicate all the available space to the root Slint partition, set its size to ${ARG2}G.
pt_pt: Pode dedicar todo o espaço disponível na unidade (${ARG2}G) à partição root do Slint, ou tornar esta partição mais pequena (pelo menos ${ARG1}G) para reservar algum espaço para uma utilização futura, como a criação de uma partição partilhada através do SO ou instalando mais tarde outro SO ao lado de Slint. Para dedicar todo o espaço disponível à partição root do Slint, defina o seu tamanho para ${ARG2}G.

source: brtfs is the most advanced and flexible linux file system, offering snapshots, subvolumes support, online check and repair, RAID. Using these features needs some learning. ex4 is the most common Linux file system and is very reliable. xfs can be preferred to ext if you have very large storage requirements with large files
pt_pt: brtfs é o sistema de ficheiros linux mais avançado e flexível, oferecendo cópias do sistema, suporte de subvolumes, verificação e reparação on-line, RAID. O uso destas funcionalidades precisa de alguma aprendizagem. ex4 é o sistema de ficheiros Linux mais comum e é muito fiável. xfs pode ser preferido ao ext se tiver requisitos de armazenamento muito grandes com ficheiros grandes

source: Encrypt a drive prevents theft of the data it contains in case of loss or theft of the drive itself or of the machine where it is installed. If you decide to encrypt it, you will need to type a so called "passphrase" to unlock it every time you boot Slint. Be aware that if you forget the passphrase all data in the drive will be irrecoverably lost! So write it down carefully on a safe place. We will ask you to type the passphrase later using a "us" keyboard map.
pt_pt: Encriptar uma unidade impede o roubo dos dados que contém em caso de perda ou roubo da própria unidade ou da máquina onde ela está instalada. Se decidir encriptá-la, terá de introduzir a chamada "frase-passe". para a desbloquear de cada vez que se inicia o Slint. Esteja ciente de que se esquecer da frase-passe, todos os dados na unidade serão irreversivelmente perdidos! Por isso, escreva-a cuidadosamente num local seguro. Pedimos-lhe que escreva a frase-passe mais tarde, utilizando um mapa de teclado "us".

source: As you are currently using a "$KEYMAP" keyboard map, we will spell each character of the passphrase you type, which may differ from the one engraved on the keyboard key.
pt_pt: Como está atualmente a usar um mapa de teclado "$KEYMAP", vamos soletrar cada carácter da frase-passe que se escreve, que pode ser diferente da que está gravada na tecla do teclado.

source: The passphrase should have at least 8 characters. Only ASCII printable characters are allowed. This includes non accented lower case and capital letters, digits from 0 to 9, space and following punctuation characters:
pt_pt: A frase-passe deve ter pelo menos 8 caracteres. Apenas caracteres imprimíveis em ASCII são permitidos. Isto inclui letras minúsculas não acentuadas e letras maiúsculas, dígitos de 0 a 9, espaço e os seguintes caracteres de pontuação:

source: If you choose C (Console) Slint will start in text mode, in a console where you type commands at the prompt. It will first ask your login name then your password. After that you can type commands or start a graphical environment just typing: 'startx' without the quotes. If instead you choose G (Graphical) you will type your login name then your password in a window, then the graphical environment will be displayed.
pt_pt: Se escolher C (Console) o Slint começará em modo texto, numa consola onde se escrevem os comandos no prompt. Primeiro perguntará o seu nome de acesso e depois a sua palavra-passe. Depois disso, pode escrever comandos ou iniciar um ambiente gráfico apenas escrevendo: 'startx' sem os apóstrofos. Se em vez disso escolher G (Gráfico) irá escrever o seu nome de acesso e depois a sua palavra-passe numa janela, depois será apresentado o ambiente gráfico.

source: In the links web browser you navigate with the keyboard: To go to the next or previous fields press the up or down arrow keys To quit press q then confirm pressing Enter To display the key bindings press F1 to display the menu press Esc then navigate with the arrow keys
pt_pt: No navegador web links, a navegação é efetuada com o teclado: Para ir para os campos seguintes ou anteriores, prima as teclas de seta para cima ou para baixo Para sair, prima q e confirme premindo Enter Para visualizar as combinações de teclas, prima F1 para visualizar o menu prima Esc e depois navegue com as teclas de setas

source: Press Enter to continue.
pt_pt: Prima Enter para continuar.

source: Please choose mount point for $NAME. Use only lower case letters and do not choose a directory name reserved in Linux or in other OS from which this partition will be accessed.
pt_pt: Escolha o ponto de montagem para $NAME. Use apenas letras minúsculas e não escolha um nome de diretório reservado em Linux ou em outro SO a partir do qual esta partição será acedida.

source: Please choose a name for the new partition; like "data". Use only lower case letters and do not choose a reserved directory name in Linux or in other OS from which this partition will be accessed.
pt_pt: Escolha um nome para a nova partição; como "dados". Utilizar apenas letras minúsculas e não escolha um nome de diretório reservado no Linux ou noutro SO da qual esta partição será acedida.

source: Type the name of the new partition, or h for help:
pt_pt: Introduza o nome da nova partição, ou h para ajuda:

source: Type the mount point for $NAME, or h for help:
pt_pt: Introduza o ponto de montagem para $NAME, ou h para obter ajuda:

source: $MOUNTPOINT is a reserved directory name.
pt_pt: $MOUNTPOINT é um nome de diretório reservado.

source: This mount point is already in use.
pt_pt: Este ponto de montagem já está em uso.

source: in "auto" mode a partition for /home should be located in another drive.
pt_pt: no modo "auto" uma partição para a /home deve estar localizada noutra unidade.

source: You will be allowed to select one later, already used or just created.
pt_pt: Poderá selecionar uma mais tarde, já utilizada ou acabada de criar.

source: If it already contains data you will choose to keep or erase them.
pt_pt: Se já contiver dados, pode optar por mantê-los ou apagá-los.

source: Do you want to format this partition? If yes we will erase everything in it so all data it contains will be lost!
pt_pt: Pretende formatar esta partição? Se sim, apagaremos todo o seu conteúdo pelo que todos os dados que contém serão perdidos!

source: Do you want to delete all data on $NAME et re-format it?
pt_pt: Pretende eliminar todos os dados de $NAME e reformatá-la?

source: Type yes or no:
pt_pt: Escreva yes ou no:

source: Allowed file system types for linux partitions are:
pt_pt: Os tipos de sistema de ficheiros permitidos para partições de linux são:

source: Type the file system type for $NAME or h for help:
pt_pt: Introduza o tipo de sistema de ficheiros para $NAME ou h para obter ajuda:

source: No installation media found. Please restart leaving it inserted or plugged in.
pt_pt: Nenhum meio de instalação foi encontrado. Reinicie deixando-o inserido ou ligado.

source: But if the installation ISO is in some disk partition, mount this partition like this: mount <partition /dev/something/> /floppy then type: mount <path to the ISO> /ISO then type start again.
pt_pt: Mas se a ISO de instalação estiver em alguma partição, monte essa partição assim: mount <partition /dev/something/> /floppy e depois escreva: mount <path to the ISO> /ISO e depois escreva start novamente.

source: We could not mount the installer for this reason: $MOUNTSRCERROR
pt_pt: Não foi possível montar o instalador por este motivo: $MOUNTSRCERROR

source: The Slint installer proposes installation options and let you choose what you prefer, through question/answer dialogues, then it installs and configure Slint. After installation you may customize the system through simple commands listed in the included documentation.
pt_pt: O instalador Slint propõe opções de instalação e deixa-lhe escolher o que prefere, através de diálogos de perguntas/respostas, depois instala e configura o Slint. Após a instalação, pode personalizar o sistema através de comandos simples listados na documentação incluída.

source: You can chose between a manual or auto partitioning.
pt_pt: Pode escolher entre um particionamento manual ou auto.

source: If you prefer manual (custom) partitioning but did not do the partitioning yet, press q to quit now. You will type 'start' again when ready.
pt_pt: Se preferir o particionamento manual (personalizado), mas ainda não o fez, prima q para sair agora. Digitará 'start' novamente quando estiver pronto.

source: Press m for manual, a for auto, h for help or q to quit:
pt_pt: Prima m para manual, a para auto, h para obter ajuda ou q para sair:

source: Type 'start' again when you will be ready.
pt_pt: Escreva 'start' novamente quando estiver pronto.

source: $ANSWER is not a valid answer.
pt_pt: $ANSWER não é uma resposta válida.

source: Slint can be installed on this drive:
pt_pt: O Slint pode ser instalado nesta unidade:

source: To install Slint on this drive we need to wipe all data in it
pt_pt: Para instalar o Slint nesta unidade, precisamos de limpar todos os dados nela contidos

source: Slint can be installed on one of the drives listed below.
pt_pt: O Slint pode ser instalado numa das unidades listadas abaixo.

source: Please type the chosen drive's number, or q to quit:
pt_pt: Introduza o número da unidade selecionada, ou q para sair:

source: Slint would be installed on this drive:
pt_pt: O slint será instalado nesta unidade:

source: To dedicate $NAME, size ${SIZEG}G to Slint we need to delete all data stored on this drive, including existing OS case occurring. Here are its current partitions:
pt_pt: Para dedicar $NAME, tamanho ${SIZEG}G ao Slint é preciso eliminar todos os dados armazenados nesta unidade, incluindo o SO existente caso isso ocorra. Aqui estão as suas partições atuais:

source: Do you want to delete all data on $NAME then install Slint on it?
pt_pt: Deseja eliminar todos os dados em $NAME e depois instalar o Slint?

source: Do you want to install Slint on it?
pt_pt: Quer instalar o Slint?

source: You can dedicate all the available space: ${GAVAILABLE}G to Slint's root partition, or keep part of it for another usage. The size of the Slint root partition should be between ${GCOUNT}G and ${GAVAILABLE}G.
pt_pt: Pode dedicar todo o espaço disponível: ${GAVAILABLE}G à partição root do Slint, ou manter parte dela para outra utilização. O tamanho da partição root do Slint deve ser entre ${GCOUNT}G e ${GAVAILABLE}G.

source: Size of the Slint root partition (h for help):
pt_pt: Tamanho da partição root do Slint (h para ajuda):

source: $GROOTSIZE is not a number.
pt_pt: $GROOTSIZE não é um número.

source: $GROOTSIZE is not a number between $GCOUNT and $GAVAILABLE.
pt_pt: $GROOTSIZE não é um número entre $GCOUNT e $GAVAILABLE.

source: There remains ${GREMAINING}G of free space in $DRIVEPATH. You may allocate all or part of it to an additional partition. If you want an additional partition type its size below (at most ${GREMAINING}G), else just press Enter.
pt_pt: Resta ${GREMAINING}G de espaço livre em $DRIVEPATH. Pode atribuir tudo ou parte dele para uma partição adicional. Se quiser uma partição adicional escreva o seu tamanho abaixo (no máximo ${GREMAINING}G), caso contrário basta premir Enter.

source: Size of the added partition (h for help):
pt_pt: Tamanho da partição adicionada (h para ajuda):

source: The size should be at most ${GREMAINING}G.
pt_pt: O tamanho deve ser no máximo de ${GREMAINING}G.

source: You have chosen the "manual" partitioning mode.
pt_pt: Escolheu o modo de particionamento "manual".

source: We need to identify the root Slint partition, to be mounted as "/". We will later format this partition, which will erase its content.
pt_pt: Precisamos de identificar a partição root do Slint, para ser montada como "/". Mais tarde formataremos esta partição, que apagará o seu conteúdo.

source: We have found only one Linux partition big enough to install Slint: ${ROOTNAME}, size ${GSIZE}G.
pt_pt: Foi encontrado apenas uma partição Linux grande o suficiente para instalar o Slint: ${ROOTNAME}, tamanho ${GSIZE}G.

source: Do you want to install Slint on $ROOTNAME?
pt_pt: Quer instalar o Slint em $ROOTNAME?

source: Please type yes to confirm or no to quit:
pt_pt: Escreva yes para confirmar ou no para sair:

source: You can select the root partition among these:
pt_pt: Pode selecionar a partição root entre estas:

source: Please type the root partitions's number, or q to quit:
pt_pt: Introduza o número das partições root, ou q para sair:

source: $ANSWER is not a listed partition number.
pt_pt: $ANSWER não é um número de partição listado.

source: You can associate a mount point to each partition listed below. You will first select a partition typing its number, then its mount point. Type d when done, l to display the list again, or q to quit.
pt_pt: Pode associar um ponto de montagem a cada partição listada abaixo. Primeiro selecionará uma partição escrevendo o seu número, depois o seu ponto de montagem. Escreva d quando terminar, l para mostrar a lista novamente, ou q para sair.

source: Partition number? (or l to display the list, d when done, q to quit):
pt_pt: Número de partição? (ou l para mostrar a lista, d quando concluído, q para sair):

source: We will now list the partitions found on this machine with one of the file systems exfat, ntfs, vfat, used by Windows. You will now type the numbers of those you want to be automatically mounted at boot time, either read-only or read-write.
pt_pt: Vamos agora listar as partições encontradas nesta máquina com um dos sistemas de ficheiros exfat, ntfs, vfat, utilizado pelo Windows. Agora irá escrever os números daquelas que pretende a ser montada automaticamente no momento do arranque, seja de apenas-leitura ou de leitura-gravação.

source: Partition number? (l to display the list, d when done, h for help):
pt_pt: Número de partição? (l para mostrar a lista, d quando concluído, h para obter ajuda):

source: $ANSWER is not a listed partition number
pt_pt: $ANSWER não é um número de partição listado

source: The root Slint partition can be encrypted to prevent data steal in case of loss or theft of the machine or the drive where Slint is installed. Then you will type a so-called "passphrase" to unlock the Slint partition, giving access to the boot menu. We will record this passphrase
pt_pt: A partição root do Slint pode ser encriptada para evitar roubo de dados em caso de perda ou roubo da máquina ou da unidade onde o Slint está instalado. Depois irá escrever a chamada "frase-passe" para desbloquear o Slint dando acesso ao menu de arranque. Registaremos esta frase-passe

source: using a "us" keyboard map
pt_pt: usando um mapa de teclado "us"

source: Do you want to encrypt $NAME? type yes, no or h for help.
pt_pt: Quer encriptar $NAME? escreva yes, no ou h para ajuda.

source: Please type yes or no:
pt_pt: Escreva yes ou no:

source: We are ready to do what you requested: Install Slint on this drive: $NAME $VEND $MOD size ${SIZEG}G
pt_pt: Tudo pronto para fazer o que pediu: Instalar o Slint nesta unidade: $NAME $VEND $MOD tamanho ${SIZEG}G

source: All data previously stored on it will be deleted.
pt_pt: Todos os dados anteriormente armazenados serão apagados.

source: We are ready to do what you requested: Install Slint on this partition: $NAME, size ${SIZEG}G, file system $FSTYPE All data previously stored on it will be deleted but the contents of other partitions on $PKNAME will be preserved.
pt_pt: Estamos prontos para fazer o que pediu: Instalar o Slint nesta partição: $NAME, tamanho ${SIZEG}G, sistema de ficheiros $FSTYPE Todos os dados previamente armazenados serão eliminados, mas o conteúdo de outras partições em $PKNAME será preservado.

source: The root partition will be encrypted.
pt_pt: A partição root será encriptada.

source: The Slint system partition will have a size of ${ROOTSIZE}G.
pt_pt: A partição do sistema Slint terá um tamanho de ${ROOTSIZE}G.

source: A "$ADDEDPARTNAME" partition of size ${ADDEDPARTSIZE}G will be set up.
pt_pt: Será configurada uma partição "$ADDEDPARTNAME" de tamanho ${ADDEDPARTSIZE}G.

source: A space of size ${GAVAILABLE}G will stay free after the last partition.
pt_pt: Um espaço de tamanho ${GAVAILABLE}G ficará livre após a última partição.

source: Partitions listed below will be accessible:
pt_pt: As partições listadas abaixo estarão acessíveis:

source: If you confirm these settings they will be applied, else you will go back to the greeting screen of the installer.
pt_pt: Se confirmar estas definições, as mesmas serão aplicadas, caso contrário irá voltar ao ecrã de saudação do instalador.

source: To confirm these settings type yes, else type no:
pt_pt: Para confirmar estas definições escreva yes, caso contrário escreva no:

source: You can redo a configuration.
pt_pt: Pode refazer uma configuração.

source: We prepare $DRIVEPATH to install Slint...
pt_pt: Preparamos $DRIVEPATH para instalar o Slint...

source: We will now record the passphrase to use to unlock the drive $DRIVEPATH
pt_pt: Agora vamos gravar a frase-passe a ser usada para desbloquear a unidade $DRIVEPATH

source: It should include at least one capital letter, one lower case letter, one digit and one punctuation sign and have at least 8 characters. Write it in a safe place first!
pt_pt: Deve incluir pelo menos uma letra maiúscula, uma letra minúscula, um dígito e um sinal de pontuação e ter pelo menos 8 caracteres. Escreva num lugar seguro primeiro!

source: You are currently using a "$KEYMAP" keyboard map, but when you will type the passphrase to unlock the drive a "us" keyboard map will be set up. For this reason we will now display the typed characters using an "us" keyboard map.
pt_pt: Está atualmente a utilizar um mapa de teclado "$KEYMAP", mas quando for escrever a frase-passe para desbloquear a unidade, será configurado um mapa de teclado "us". Por esta razão iremos agora mostrar os caracteres escritos utilizando um mapa de teclado "us".

source: Passphrase (h for help):
pt_pt: Frase-passe (h para ajuda):

source: The passphrase may only contain ASCII characters
pt_pt: A frase-passe apenas pode conter caracteres ASCII

source: The passphrase should have at least 8 characters.
pt_pt: A frase-passe deve ter pelo menos 8 caracteres.
