Repository: DidierSpaier/slint-translations
Catalog: pot_on_Crowdin/auto/*.auto.po
Languages: ru_ru

source: There don't seem to be any partitions on this machine of type Linux and size at least ${GCOUNT}G. You need one to install Linux. For more information, choose 'doc' from the menu.
ru_ru: На этой машине нет разделов с типом Linux и размером не менее ${GCOUNT}G. Для установки Linux нужен один. Для дополнительной информации выберите 'doc' в меню.

source: This machine booted in EFI mode but no big enough EFI System Partition found. For more information. choose 'doc' from the menu.
ru_ru: Этот компьютер был загружен в режиме EFI, однако обнаружить достаточно большой системный раздел EFI не удалось. Для получения дополнительной информации выберите 'doc' в меню.

source: If the root partition is in a drive with a GPT, GRUB needs a BIOS boot partition on the same drive, of size at least 3M. We didn't find such a configuration.
ru_ru: Если корневой раздел находится на диске с GPT, GRUB требуется загрузочный раздел BIOS на том же диске, размером не менее 3M. Не удалось обнаружить подобную конфигурацию.

source: We didn't find a drive of size at least ${GCOUNT}G and no mounted partition, so the automatic partitioning is not possible.
ru_ru: Не удалось найти диск размером не менее ${GCOUNT}G, не имеющий смонтированных разделов, поэтому автоматическая разметка невозможна.

source: The machine booted in EFI mode but we did not find a potential root partition with an EFI system partition on the same drive so the manual partitioning mode is not possible.
ru_ru: Этот компьютер был загружен в режиме EFI, однако обнаружить потенциальный корневой раздел с системным разделом EFI на одном диске не удалось. Ручная разметка невозможна.

source: Press Enter to go back to the menu
ru_ru: Нажмите Enter для возврата в меню

source: Welcome back to the menu of the Slint installer. You may now type (without the quotes): 'doc' to know the features and usage of the installer. 'start' to start the installation. The installer can prepare the drive where Slint will be installed, creating the the needed partitions. If you prefer you can do it yourself using command line utilities available in the installer, then type 'start' when done. You can also leave the installer and use a tool like gparted to do that then start the installer again. We recommend that you type 'doc' first in this case, or if you want to encrypt the root Slint partition. When you finish reading this menu will be displayed again.
ru_ru: Добро пожаловать обратно в меню программы установки Slint. Вы можете ввести (без кавычек): 'doc' для информации об особенностях и использовании установщика. 'start' для запуска установки. Программа установки может подготовить накопитель для установки Slint, создав необходимые разделы. При желании вы можете сделать это самостоятельно с помощью утилит командной строки, доступных в программе установки, после чего ввести 'start'. Вы также можете покинуть программу установки и использовать инструмент наподобие gparted, после чего запустить программу установки еще раз. В этом случае, а также если вы хотите зашифровать корневой раздел Slint, рекомендуем сперва ввести 'doc'. По завершении чтения это меню будет показано снова.

source: Therefore, Slint installation is not possible.
ru_ru: В связи с этим установка Slint невозможна.

source: In manual partitioning mode you partition and format the drive where you want to install Slint to your liking, using utilities it includes. This gives you more choices of partitions layout and file systems but needs to be acquainted to Linux and the command line (but you may also have used a tool like gparted live before starting the installer, or from another system).
ru_ru: В режиме ручной разметки вы размечаете и форматируете диск, на который хотите установить Slint, в соответствии с вашими пожеланиями, используя для этого встроенные утилиты. Этот режим предлагает больший выбор вариантов разметки и файловых систем, но требует знакомства с Linux и командной строкой (вы также можете использовать инструмент наподобие gparted перед запуском программы установки или из другой системы).

source: In auto mode the installer do it for you, but chooses the partition layout and the file system.
ru_ru: В автоматическом режиме программа установки делает это за вас, но сама выбирает вариант разметки и файловую систему.

source: In both modes you will be given a chance to indicate existing partitions (not needed by Slint) that you want to access from Slint.
ru_ru: В обоих режимах вам будет предоставлена возможность указать существующие разделы (не требуемые Slint), к которым вы хотите иметь доступ из Slint.

source: Press Enter to continue
ru_ru: Нажмите Enter для продолжения

source: These directories should not be mounted on separate partitions: $RESERVED or use arbitrary directory names, for instance to mount other Linux systems.
ru_ru: В следующие каталоги не должны монтироваться разные разделы: $RESERVED используйте произвольные имена каталогов, например, для монтирования других систем Linux.

source: You may dedicate all the space available on the drive (${ARG2}G) to the root Slint partition, or make this partition smaller (at least ${ARG1}G) to reserve some space for a future use, like setting up a partition shared across OS or installing later another OS alongside Slint. To dedicate all the available space to the root Slint partition, set its size to ${ARG2}G.
ru_ru: Вы можете выделить все доступное на диске пространство (${ARG2}G) под корневой раздел Slint или сделать этот раздел меньшим (не менее ${ARG1}G), чтобы оставить свободное пространство на будущее, например, для раздела, совместно используемого между ОС, или для установки другой ОС вместе с Slint. Чтобы выделить все доступное пространство под корневой раздел Slint, задайте его размер ${ARG2}G.

source: brtfs is the most advanced and flexible linux file system, offering snapshots, subvolumes support, online check and repair, RAID. Using these features needs some learning. ex4 is the most common Linux file system and is very reliable. xfs can be preferred to ext if you have very large storage requirements with large files
ru_ru: brtfs - это наиболее продвинутая и гибкая файловая система Linux, предлагающая снимки, поддержку подтомов, проверку и исправление ошибок без размонтирования, RAID. Использование этих возможностей требует некоторого изучения. ext4 - это наиболее распространенная файловая система Linux, она очень надежна. xfs может быть предпочтительна, если вам требуется очень большое хранилище для объемных файлов

source: Encrypt a drive prevents theft of the data it contains in case of loss or theft of the drive itself or of the machine where it is installed. If you decide to encrypt it, you will need to type a so called "passphrase" to unlock it every time you boot Slint. Be aware that if you forget the passphrase all data in the drive will be irrecoverably lost! So write it down carefully on a safe place. We will ask you to type the passphrase later using a "us" keyboard map.
ru_ru: Шифрование диска предотвращает кражу данных, которые он содержит, в случае потери или кражи самого диска или компьютера, в котором он установлен. Если вы решите использовать шифрование, вам нужно будет вводить пароль для разблокировки каждый раз, когда вы запускаете Slint. Обратите внимание, что если вы забудете пароль, все данные на диске будут безвозвратно утеряны! Запишите пароль и сохраните его в надежном месте. Мы попросим вас ввести пароль позже, используя раскладку клавиатуры "us".

source: As you are currently using a "$KEYMAP" keyboard map, we will spell each character of the passphrase you type, which may differ from the one engraved on the keyboard key.
ru_ru: Поскольку в данный момент вы используете раскладку клавиатуры "$KEYMAP", мы будем озвучивать каждый введенный символ пароля, он может отличаться от нанесенного на клавишу клавиатуры.

source: The passphrase should have at least 8 characters. Only ASCII printable characters are allowed. This includes non accented lower case and capital letters, digits from 0 to 9, space and following punctuation characters:
ru_ru: Пароль должен содержать не менее 8 символов. Допустимы только печатаемые символы ASCII. В них входят строчные и прописные латинские буквы (без диакритических знаков), цифры от 0 до 9, пробел и следующие знаки препинания:

source: If you choose C (Console) Slint will start in text mode, in a console where you type commands at the prompt. It will first ask your login name then your password. After that you can type commands or start a graphical environment just typing: 'startx' without the quotes. If instead you choose G (Graphical) you will type your login name then your password in a window, then the graphical environment will be displayed.
ru_ru: Если вы выберете C (консольный режим), Slint запустится в текстовом режиме, в консоли, где вы вводите команды в командной строке. Система сначала запросит ваше имя пользователя, затем пароль. После этого вы можете начать вводить команды или запустить графическую среду, просто введя 'startx' без кавычек. Если вместо этого вы выберете G (графический режим), вам нужно будет ввести свое имя пользователя и пароль в окне, после чего будет отображена графическая среда.

source: In the links web browser you navigate with the keyboard: To go to the next or previous fields press the up or down arrow keys To quit press q then confirm pressing Enter To display the key bindings press F1 to display the menu press Esc then navigate with the arrow keys
ru_ru: В веб-браузере links вы выполняете действия с помощью клавиатуры: Для перехода к следующему или предыдущему полю нажмите клавиши со стрелками вверх или вниз Чтобы выйти, нажмите клавишу q, затем подтвердите нажатием Enter Для отображения сочетаний клавиш нажмите F1 Для отображения меню нажмите Esc и перемещайтесь по меню с помощью клавиш со стрелками

source: Press Enter to continue.
ru_ru: Нажмите Enter для продолжения.

source: Please choose mount point for $NAME. Use only lower case letters and do not choose a directory name reserved in Linux or in other OS from which this partition will be accessed.
ru_ru: Выберите точку монтирования для $NAME. Используйте только строчные буквы и не указывайте имя каталога, зарезервированное в Linux или других ОС, которые будут обращаться к данному разделу.

source: Please choose a name for the new partition; like "data". Use only lower case letters and do not choose a reserved directory name in Linux or in other OS from which this partition will be accessed.
ru_ru: Выберите имя для нового раздела, например "data". Используйте только строчные буквы и не указывайте имя каталога, зарезервированное в Linux или других ОС, которые будут обращаться к данному разделу.

source: Type the name of the new partition, or h for help:
ru_ru: Введите имя нового раздела или h для справки:

source: Type the mount point for $NAME, or h for help:
ru_ru: Введите точку монтирования для $NAME или h для справки:

source: $MOUNTPOINT is a reserved directory name.
ru_ru: $MOUNTPOINT - это зарезервированное имя каталога.

source: This mount point is already in use.
ru_ru: Эта точка монтирования уже используется.

source: Do you want to delete all data on $NAME et re-format it?
ru_ru: Вы хотите удалить все данные на $NAME и установить Slint на него?

source: Type yes or no:
ru_ru: Введите yes (да) или no (нет):

source: Allowed file system types for linux partitions are:
ru_ru: Допустимые варианты файловой системы для разделов Linux:

source: Type the file system type for $NAME or h for help:
ru_ru: Введите название файловой системы для $NAME или h для справки:

source: No installation media found. Please restart leaving it inserted or plugged in.
ru_ru: Установочный носитель не найден. Вставьте или подключите его и перезагрузитесь.

source: We could not mount the installer for this reason: $MOUNTSRCERROR
ru_ru: Не удалось смонтировать установочный носитель по следующей причине: $MOUNTSRCERROR

source: The Slint installer proposes installation options and let you choose what you prefer, through question/answer dialogues, then it installs and configure Slint. After installation you may customize the system through simple commands listed in the included documentation.
ru_ru: Программа установки Slint предлагает параметры установки и позволяет настроить их в соответсвтии с вашими предпочтениями посредством диалогов в формате вопрос/ответ, затем она установит и настроит Slint. После установки вы можете настроить систему с помощью простых команд, перечисленных в документации.

source: You can chose between a manual or auto partitioning.
ru_ru: Вы можете выбрать между ручной и автоматической разметкой диска.

source: If you prefer manual (custom) partitioning but did not do the partitioning yet, press q to quit now. You will type 'start' again when ready.
ru_ru: Если вы предпочитаете ручную (пользовательскую) разметку, но еще не выполнили ее, введите q для выхода. Снова введите 'start', когда будете готовы.

source: Press m for manual, a for auto, h for help or q to quit:
ru_ru: Введите m для ручной, a для автоматической, h для справки или q для выхода:

source: Type 'start' again when you will be ready.
ru_ru: Снова введите 'start', когда будете готовы.

source: $ANSWER is not a valid answer.
ru_ru: $ANSWER не является допустимым ответом.

source: Slint can be installed on this drive:
ru_ru: Slint может быть установлен на следующий диск:

source: To install Slint on this drive we need to wipe all data in it
ru_ru: Для установки Slint на этот диск необходимо стереть с него все данные

source: Slint can be installed on one of the drives listed below.
ru_ru: Slint может быть установлен на один из дисков, перечисленных ниже.

source: Please type the chosen drive's number, or q to quit:
ru_ru: Введите номер выбранного диска или q для выхода:

source: Slint would be installed on this drive:
ru_ru: Slint будет установлен на следующий диск:

source: To dedicate $NAME, size ${SIZEG}G to Slint we need to delete all data stored on this drive, including existing OS case occurring. Here are its current partitions:
ru_ru: Для того чтобы выделить $NAME объемом ${SIZEG}G под Slint, необходимо удалить все данные, хранящиеся на этом диске, включая существующие ОС при их наличии. Ниже представлены его текущие разделы:

source: Do you want to delete all data on $NAME then install Slint on it?
ru_ru: Вы хотите удалить все данные на $NAME и установить Slint на него?

source: Do you want to install Slint on it?
ru_ru: Вы хотите установить Slint на него?

source: You can dedicate all the available space: ${GAVAILABLE}G to Slint's root partition, or keep part of it for another usage. The size of the Slint root partition should be between ${GCOUNT}G and ${GAVAILABLE}G.
ru_ru: Вы можете выделить все доступное пространство - ${GAVAILABLE}G - под корневой раздел Slint или оставить его часть для других нужд. Размер корневого раздела Slint должен быть между ${GCOUNT}G и ${GAVAILABLE}G.

source: Size of the Slint root partition (h for help):
ru_ru: Размер корневого раздела Slint (h для справки):

source: $GROOTSIZE is not a number.
ru_ru: $GROOTSIZE не является числом.

source: $GROOTSIZE is not a number between $GCOUNT and $GAVAILABLE.
ru_ru: $GROOTSIZE не является числом между $GCOUNT и $GAVAILABLE.

source: There remains ${GREMAINING}G of free space in $DRIVEPATH. You may allocate all or part of it to an additional partition. If you want an additional partition type its size below (at most ${GREMAINING}G), else just press Enter.
ru_ru: Осталось ${GREMAINING}G свободного места на $DRIVEPATH. Вы можете выделить это пространство или его часть под дополнительный раздел. Если вы хотите создать дополнительный раздел, введите его размер ниже (максимум ${GREMAINING}G), иначе просто нажмите Enter.

source: Size of the added partition (h for help):
ru_ru: Размер дополнительного раздела (h для справки):

source: The size should be at most ${GREMAINING}G.
ru_ru: Размер не должен превышать ${GREMAINING}G.

source: You have chosen the "manual" partitioning mode.
ru_ru: Вы выбрали "ручной" режим разметки.

source: We need to identify the root Slint partition, to be mounted as "/". We will later format this partition, which will erase its content.
ru_ru: Необходимо определить корневой раздел Slint, который будет смонтирован как "/". Позже мы отформатируем этот раздел, что приведет к удалению его содержимого.

source: We have found only one Linux partition big enough to install Slint: ${ROOTNAME}, size ${GSIZE}G.
ru_ru: Мы нашли только один раздел Linux, достаточно большой для установки Slint: ${ROOTNAME}, размером ${GSIZE}G.

source: Do you want to install Slint on $ROOTNAME?
ru_ru: Вы хотите установить Slint на $ROOTNAME?

source: Please type yes to confirm or no to quit:
ru_ru: Введите yes для подтверждения или no для выхода:

source: You can select the root partition among these:
ru_ru: Вы можете выбрать корневой раздел из следующих разделов:

source: Please type the root partitions's number, or q to quit:
ru_ru: Введите номер корневого раздела или q для выхода:

source: $ANSWER is not a listed partition number.
ru_ru: $ANSWER не является номером раздела из приведенного списка.

source: You can associate a mount point to each partition listed below. You will first select a partition typing its number, then its mount point. Type d when done, l to display the list again, or q to quit.
ru_ru: Вы можете определить точку монтирования для каждого из разделов, перечисленных ниже. Сначала выберите раздел, введя его номер, затем укажите точку монтирования. Введите d, когда закончите, l для повторного отображения списка или q для выхода.

source: Partition number? (or l to display the list, d when done, q to quit):
ru_ru: Номер раздела? (или l для отображения списка, d по окончании, q для выхода):

source: We will now list the partitions found on this machine with one of the file systems exfat, ntfs, vfat, used by Windows. You will now type the numbers of those you want to be automatically mounted at boot time, either read-only or read-write.
ru_ru: Ниже будут перечислены разделы, найденные на этом компьютере и содержащие одну из файловых систем (exfat, ntfs, vfat), используемых Windows. Введите номера тех, которые вы хотели бы автоматически монтировать во время загрузки в режиме "только для чтения" или "для чтения и записи".

source: Partition number? (l to display the list, d when done, h for help):
ru_ru: Номер раздела? (l для отображения списка, d по окончании, h для справки):

source: $ANSWER is not a listed partition number
ru_ru: $ANSWER не является номером раздела из приведенного списка

source: The root Slint partition can be encrypted to prevent data steal in case of loss or theft of the machine or the drive where Slint is installed. Then you will type a so-called "passphrase" to unlock the Slint partition, giving access to the boot menu. We will record this passphrase
ru_ru: Корневой раздел Slint может быть зашифрован для предотвращения кражи данных в случае потери или кражи устройства или накопителя, на котором установлен Slint. Вам понадобится ввести пароль, необходимый для разблокировки раздела Slint и получения доступа к меню загрузки. Этот пароль будет сохранен

source: using a "us" keyboard map
ru_ru: , используя раскладку клавиатуры "us"

source: Do you want to encrypt $NAME? type yes, no or h for help.
ru_ru: Вы хотите зашифровать $NAME? Введите yes (да), no (нет) или h для справки.

source: We are ready to do what you requested: Install Slint on this drive: $NAME $VEND $MOD size ${SIZEG}G
ru_ru: Мы готовы выполнить запрошенные вами действия: Установить Slint на следующий диск: $NAME $VEND $MOD размером ${SIZEG}G

source: All data previously stored on it will be deleted.
ru_ru: Все хранящиеся на нем данные будут удалены.

source: We are ready to do what you requested: Install Slint on this partition: $NAME, size ${SIZEG}G, file system $FSTYPE All data previously stored on it will be deleted but the contents of other partitions on $PKNAME will be preserved.
ru_ru: Мы готовы выполнить запрошенные вами действия: Установить Slint на следующий раздел: $NAME, размер ${SIZEG}G, файловая система $FSTYPE Все хранящиеся на нем данные будут удалены, но содержимое других разделов на $PKNAME будет сохранено.

source: The root partition will be encrypted.
ru_ru: Корневой раздел будет зашифрован.

source: The Slint system partition will have a size of ${ROOTSIZE}G.
ru_ru: Размер корневого раздела Slint составит ${ROOTSIZE}G.

source: A "$ADDEDPARTNAME" partition of size ${ADDEDPARTSIZE}G will be set up.
ru_ru: Будет создан раздел "$ADDEDPARTNAME" размером ${ADDEDPARTSIZE}G.

source: A space of size ${GAVAILABLE}G will stay free after the last partition.
ru_ru: Пространство размером ${GAVAILABLE}G останется свободным после последнего раздела.

source: Partitions listed below will be accessible:
ru_ru: Перечисленные ниже разделы будут доступны:

source: If you confirm these settings they will be applied, else you will go back to the greeting screen of the installer.
ru_ru: Если вы подтвердите эти настройки, они будут применены, иначе вы вернетесь на экран приветствия программы установки.

source: To confirm these settings type yes, else type no:
ru_ru: Для подтверждения этих настроек введите yes (да), иначе введите no (нет):

source: You can redo a configuration.
ru_ru: Вы можете повторить настройку заново.

source: We prepare $DRIVEPATH to install Slint...
ru_ru: Подготовка $DRIVEPATH для установки Slint...

source: We will now record the passphrase to use to unlock the drive $DRIVEPATH
ru_ru: Сейчас будет создан пароль, необходимый для разблокировки диска $DRIVEPATH

source: It should include at least one capital letter, one lower case letter, one digit and one punctuation sign and have at least 8 characters. Write it in a safe place first!
ru_ru: Он должен включать в себя как минимум одну прописную букву, одну строчную букву, одну цифру и один знак препинания и содержать не менее 8 символов. Сохраните его в надежном месте!

source: You are currently using a "$KEYMAP" keyboard map, but when you will type the passphrase to unlock the drive a "us" keyboard map will be set up. For this reason we will now display the typed characters using an "us" keyboard map.
ru_ru: В данный момент вы используете раскладку клавиатуры "$KEYMAP", но при вводе пароля для разблокировки диска будет установлена раскладка "us". В связи с этим вводимые сейчас символы будут отображены с использованием раскладки "us".

source: Passphrase (h for help):
ru_ru: Пароль (h для справки):

source: The passphrase may only contain ASCII characters
ru_ru: Пароль может содержать только символы ASCII

source: The passphrase should have at least 8 characters.
ru_ru: Пароль должен содержать не менее 8 символов.

source: The passphrase should include at least one lower case letter.
ru_ru: Пароль должен содержать хотя бы одну строчную букву.

source: The passphrase should include at least one capital letter.
ru_ru: Пароль должен содержать хотя бы одну прописную букву.

source: The passphrase should include at least one digit.
ru_ru: Пароль должен содержать хотя бы одну цифру.

source: The passphrase should include at least one punctuation character.
ru_ru: Пароль должен содержать хотя бы один знак препинания.

source: Please type again the passphrase, to check:
ru_ru: Пожалуйста, повторно введите пароль для проверки:

source: Passphrases do not match. please try again.
ru_ru: Пароли не совпадают. Попробуйте еще раз.

source: Encrypting the root Slint partition...
ru_ru: Шифрование корневого раздела Slint...

source: Installing the first software packages...
ru_ru: Установка первых пакетов программного обеспечения...

source: Generating a decryption keyfile...
ru_ru: Создание файла ключа расшифровки...
