Repository: DidierSpaier/slint-translations
Catalog: pot_on_Crowdin/auto/*.auto.po
Languages: ru_ru

source: The user "root" has all rights on the system, including to wipe it. This status should be accessed only with a good password.
ru_ru: У пользователя "root" есть все права в системе, в том числе на ее удаление. Пользователь с таким статусом должен иметь хороший пароль.

source: Please type the password for $THISUSER:
ru_ru: Введите пароль для $THISUSER:

source: The password should have at least 6 characters.
ru_ru: Пароль должен содержать не менее 6 символов.

source: Please type again the password for $THISUSER, to check:
ru_ru: Пожалуйста, повторно введите пароль для $THISUSER для проверки:

source: Passwords do not match. please try again.
ru_ru: Пароли не совпадают. Попробуйте еще раз.

source: We will now set up an account for a regular user. Other user accounts can be set up after installation. We need to know under which name this user will log in to access Slint.
ru_ru: Сейчас будет создана учетная запись для обычного пользователя. Учетные записи других пользователей можно настроить после установки. Нам нужно знать, под каким именем этот пользователь будет входить в систему, чтобы получить доступ к Slint.

source: Login name of the first registered user:
ru_ru: Имя учетной записи первого зарегистрированного пользователя:

source: The username should not begin with a '_'
ru_ru: Имя пользователя не должно начинаться с символа '_'

source: The user name should only contains non accented lower case letters, digits from 0 to 9, '_' or '-'
ru_ru: Имя пользователя должно содержать только строчные латинские буквы (без диакритических знаков), цифры от 0 до 9, символы '_' или '-'

source: Blind users can run Slint with a Braille device or a screen reader.
ru_ru: Слепые пользователи могут использовать Slint с помощью дисплея Брайля или программы чтения с экрана.

source: Will you use a Braille device? Please answer yes or no:
ru_ru: Вы будете использовать дисплей Брайля? Ответьте yes (да) или no (нет):

source: Do you want to start Slint in a console or in graphical mode?
ru_ru: Вы хотите запускать Slint в консольном или графическом режиме?

source: Type c for console or g for graphical, or h for help then press Enter:
ru_ru: Введите c для консольного режима, g для графического или h для справки, после чего нажмите Enter:

source: In the next dialog, you will choose the language for your Slint System.
ru_ru: В следующем диалоговом окне вы выберите язык для вашей системы Slint.

source: Press Enter to continue:
ru_ru: Нажмите Enter для продолжения:

source: Please wait...
ru_ru: Пожалуйста, подождите...

source: Should we try to get a wifi connection? Please type yes or no:
ru_ru: Попытаться установить соединение Wi-Fi? Введите yes (да) или no (нет):

source: Scanning the wifi networks...
ru_ru: Сканирование сетей Wi-Fi...

source: No wifi network detected.
ru_ru: Сетей Wi-Fi не обнаружено.

source: Wrong SSID.
ru_ru: Неверный SSID.

source: Press Enter to try again or type q to give up:
ru_ru: Нажмите Enter, чтобы повторить попытку, или введите q для отмены:

source: A WPA passphrase should have between 8 and 63 characters
ru_ru: Пароль WPA должен включать в себя от 8 до 63 символов

source: Wrong passphrase. Press Enter to try again or type q to quit:
ru_ru: Неверный пароль. Нажмите Enter, чтобы повторить попытку, или введите q для выхода:

source: Wifi connection failed. Wrong passphrase?
ru_ru: Не удалось установить соединение Wi-Fi. Неправильный пароль?

source: Press Enter to try again or type q to quit:
ru_ru: Нажмите Enter, чтобы повторить попытку, или введите q для выхода:

source: Are credentials requested to use $SSID? Type yes or no:
ru_ru: Требуются ли учетные данные для использования $SSID? Введите yes (да) или no (нет):

source: Wifi connection failed.
ru_ru: Не удалось установить соединение Wi-Fi.

source: You will now type the credentials in a web browser.
ru_ru: Понадобится ввести учетные данные в веб-браузере.

source: When done press Q to quit the browser.
ru_ru: По завершении нажмите Q для выхода из браузера.

source: Press Enter to start the browser or type h for help on its usage:
ru_ru: Нажмите Enter для запуска браузера или введите h для справки по его использованию:

source: Please type the password for $SSID, or q to give up using wifi:
ru_ru: Введите пароль для $SSID или q, чтобы отказаться от использования Wi-Fi:

source: A password is requested.
ru_ru: Требуется пароль.

source: Wrong password. Try again.
ru_ru: Неверный пароль, попробуйте еще раз.

source: Setting of the time zone.
ru_ru: Настройка часового пояса.

source: Is $PROPOSEDTZ the current time zone? type yes or no:
ru_ru: Является ли $PROPOSEDTZ текущим часовым поясом? Введите yes (да) или no (нет):

source: You can set the time zone now, or accept the default value (UTC) and modify this setting after installation.
ru_ru: Вы можете настроить часовой пояс сейчас или принять значение по умолчанию (UTC) и изменить этот параметр после установки.

source: To set the time zone now type yes, else type no:
ru_ru: Чтобы задать часовой пояс сейчас, введите yes (да), иначе введите no (нет):

source: We will now install all packages. This takes about 10 to 40 minutes.
ru_ru: Сейчас будут установлены все пакеты. Это займёт от 10 до 40 минут.

source: Do you want a short description of each package during its installation?
ru_ru: Вы хотите получать краткое описание каждого пакета во время его установки?

source: Please type yes or no:
ru_ru: Введите yes (да) или no (нет):

source: Installing the packages. Please be patient.
ru_ru: Производится установка пакетов. Пожалуйста, подождите.

source: Preparing packages installation...
ru_ru: Подготовка к установке пакетов...

source: Please type the machine name or "hostname" and press Enter or just press Enter to accept the default name "slint".
ru_ru: Введите имя компьютера или "hostname" и нажмите Enter или просто нажмите Enter, чтобы принять имя по умолчанию "slint".

source: Machine name[slint]:
ru_ru: Имя компьютера[slint]:

source: Please select a default desktop among those listed below. mate is the most accessible with a screen reader.
ru_ru: Выберите окружение рабочего стола по умолчанию среди перечисленных ниже. mate является самым доступным при использовании программы чтения с экрана.

source: Your choice:
ru_ru: Ваш выбор:

source: building an initramfs...
ru_ru: Построение initramfs...

source: Installing the GRUB bootloader...
ru_ru: Установка системного загрузчика GRUB...

source: Building the GRUB boot menu...
ru_ru: Построение меню загрузки GRUB...

source: Installation and initial configuration of Slint are complete. If you want a preview of the boot menu displayed after rebooting, type now: chroot /SLINT list_boot_entries To exit press q (not Alt+F4 in this context) then y. To quit the installer and start your new Slint remove the installation media then type 'reboot' or press Ctrl+Alt+Del.
ru_ru: Установка и начальная настройка Slint завершены. Если вы хотите ознакомиться с загрузочным меню, отображаемым после перезагрузки, введите: chroot /SLINT list_boot_entries После этого для выхода нажмите q (не Alt+F4 в этом контексте), затем y. Для выхода из программы установки и запуска Slint извлеките установочный носитель, затем введите 'reboot' или нажмите Ctrl+Alt+Del.
