Repository: DidierSpaier/slint-translations
Catalog: wiki/a001/*.a001.po
Languages: de_de

source: Slint with BTRFS
de_de: Slint mit BTRFS

source: In this article we outline the unique characteristics of the BTRFS file system and how a Slint system is configured at installation to take advantage of them.
de_de: In diesem Artikel beschreiben wir die einzigartigen Eigenschaften des BTRFS-Dateisystems und wie ein Slint-System bei der Installation konfiguriert wird, um diese zu nutzen.

source: In order not to overload this document with definitions, we refer the reader to the https://slint.fr/en/HandBook.html#_glossary[glossary] included in the Slint Manual and more specifically for btrfs "jargon" to the https://btrfs.readthedocs.io/en/latest/Glossary.html[glossary] included in its documentation.
de_de: Um dieses Dokument nicht mit Definitionen zu überladen, verweisen wir den Leser auf das https://slint.fr/de/HandBook.html#_glossary[Glossar] im Slint-Handbuch und speziell für den btrfs "jargon" auf das https://btrfs.readthedocs.io/en/latest/Glossary.html[Glossar] in dessen Dokumentation.

source: A BTRFS file system consists of a logical volume that can span multiple block devices (partitions or disks). Initially Slint is installed on a single partition.
de_de: Ein BTRFS-Dateisystem besteht aus einem logischen Datenspeicher, der sich auf mehrere Blockgeräte (Partitionen oder Festplatten) verteilen kann. Anfangs wird Slint auf einer einzigen Partition installiert.

source: A subvolume is a subtree of files inside the volume, the root of which can be mounted as if it were an independent filesystem. However, the space allocated to a volume is also allocated to each of its sub-volumes: it is therefore not necessary to distribute it between the sub-volumes, as if they were in distinct partitions.
de_de: Ein Untervolumen ist ein Unterverzeichnis von Dateien innerhalb des Volumens, dessen Root wie ein unabhängiges Dateisystem gemountet werden kann. Allerdings wird der Speicherplatz, der einem Volumen zugewiesen wird, auch jedem seiner Untervolumen zugewiesen: Es ist daher nicht notwendig, ihn auf die Untervolumina zu verteilen, wie wenn sie in verschiedenen Partitionen wären.

source: Subvolumes can be created at the same time as the volume (by the mkfs.btrfs command), but also added or deleted later using the btrfs tools.
de_de: Untervolumen können gleichzeitig mit dem Volumen erstellt werden (durch den Befehl mkfs.btrfs), aber auch später mit den btrfs Tools hinzugefügt oder gelöscht werden.

source: As an example the commands below create the Slint "system" volume and its subvolumes, in case BTRFS is used. In the following $ROOTNAME is the name of the partition in which Slint will be installed and $SLINT the mount point of the system volume during installation.
de_de: Als Beispiel erzeugen die folgenden Befehle das Slint "system" Volumen und seine Untervolumen, falls BTRFS verwendet wird. Im folgenden ist $ROOTNAME der Name der Partition, in der Slint installiert wird, und $SLINT der Mount-Punkt des System-Volumens während der Installation.

source: The $ROOTNAME partition (denoted by its UUID which we will call <uuid>) will then be mounted three times (once per subvolume) each time Slint is started, as indicated in the /etc/fstab file:
de_de: Die $ROOTNAME Partition (die durch ihre UUUID gekennzeichnet ist, die wir <uuid>nennen) wird dann dreimal (einmal pro Untervolumen) bei jedem Start von Slint eingehängt wie in der Datei /etc/fstab eingetragen:

source: Which gives for example (taken from the output of lsblk /dev/sda5):
de_de: Was zum Beispiel (aus der Ausgabe von lsblk /dev/sda5) ergibt:

source: We see that the space available for the volume (28G) is also available for each of the sub-volumes. On the other hand, the "compress_zstd:3" mount option means that all the files that will be stored will be compressed by the zstd utility with compression level 3. Thus the size of the system is approximately half that with the ext4 file system.
de_de: Wir sehen, dass der Platz für das Volumen (28G) auch für jedes der Untervolumen verfügbar ist. Andererseits bedeutet die Option "compress_zstd:3", dass alle Dateien, die gespeichert werden, durch das Dienstprogramm zstd mit Komprimierungsstufe 3 komprimiert werden. Daher ist die Größe des Systems ungefähr halb so groß wie beim ext4-Dateisystem.

source: If we mount the device at the root of the volume (without mention of a subvolume), like this:
de_de: Wenn wir das Gerät im root des Volumens mounten (ohne Angabe eines Untervolumens), wie:

source: we see the subvolumes appear as subdirectories of /mnt:
de_de: sehen wir die Untervolumen als Unterverzeichnisse von /mnt:

source: ls /mnt @ @home @swap ls /mnt/@home/didier Desktop Documents GNUstep Images Templates Music Audience Downloads Videos
de_de: ls /mnt @ @home @swap ls /mnt/@home/didier Bilder Dokumente Downloads Musik Schreibtisch Videos Vorlagen Öffentlich

source: Another remarkable feature of BTRFS is "copy-on-write". When editing a file, modified parts are written to another location, the metadata (which record the location of all parts of the file) being updated. As long as the previous data are still referenced, they will stay untouched.
de_de: Ein weiteres bemerkenswertes Merkmal von BTRFS ist das "copy-on-write". Beim Bearbeiten einer Datei werden geänderte Teile an einen anderen Ort geschrieben, die Metadaten (die den Speicherort aller Teile der Datei aufzeichnen) werden aktualisiert. Solange auf die vorherigen Daten verwiesen wird, bleiben sie unangetastet.

source: This makes it very easy to create snapshots of BTRFS subvolume: taking a new snapshot is "free", as it uses very few disk space: only the metadata of the snapshot are written, which stores the physical location of all parts of files in the subvolume, and this is done almost instantly. The space used by the snapshot will only grow when the original subvolume and the snapshot differ, as then the snapshot will retrieves data removed from the original. On the other hand data added to the original will not be included in he snapshot: in other words a modification of the original subvolume does not modify the snapshot.
de_de: Dies macht es sehr einfach, Schnappschüsse von BTRFS Untervolumen zu erstellen: Ein neuer Schnappschuss ist "frei", da es sehr wenig Speicherplatz verbraucht: Es werden nur die Metadaten des Schnappschusses geschrieben, die den physikalischen Speicherort aller Teile von Dateien im Untervolumen speichern, und dies geschieht fast sofort. Der vom Schnappschuss verwendete Raum wird nur wachsen, wenn sich das ursprüngliche Untervolumen und der Schnappschuss unterscheiden, dann ruft der Schnappschuss Daten aus dem Original ab. Auf der anderen Seite werden die dem Original hinzugefügten Daten nicht in der Momentaufnahme enthalten: Mit anderen Worten, eine Änderung des ursprünglichen Untervolumens ändert den Schnappschuss nicht.

source: Slint includes the utility `absm`, which takes snapshots of the subvolume @, allowing to return to a previous state of the system if an update goes wrong, by booting the system on this snapshot, selected in the GRUB boot menu. To know its usage, just type `absm` as root or using sudo.
de_de: Slint enthält das Dienstprogramm `absm`, welches Schnappschüsse vom Untervolumen @ macht und es erlaubt zu einem vorherigen Zustand des Systems zurückzukehren, wenn eine Aktualisierung schief geht, durch Booten des Systems auf diesem Schnappschuss, ausgewählt im GRUB Boot-Menü. Um zu erfahren wie es verwendert wird, tippen Sie einfach `absm` als root ein oder verwenden Sie sudo.

source: BTRFS also verifies the integrity of each file when it is opened using a checksum, making it unnecessary to check the file system at system startup. In addition, the "btrfs scrub" command verifies the integrity of all files, including those that are rarely read. By default, the utility `btrfsmaintenance` included in Slint runs "btrtfs scrub" once a week.
de_de: BTRFS überprüft auch die Integrität jeder Datei, wenn sie geöffnet wird, mit einer Prüfsumme, was die Überprüfung des Dateisystems beim Systemstart unnötig macht. Darüber hinaus überprüft der Befehl "btrfs scrub" die Integrität aller Dateien, einschließlich derer, die selten gelesen werden. Standardmäßig führt das Dienstprogramm `btrfsmaintenance` in Slint einmal pro Woche "btrtfs scrub" aus.

source: `btrfsmaintenance` also triggers "btrfs balance" once a week by default. This command allows you to distribute the data between the devices if the file system extends over several, but also to reorganize the space used, in particular to free the unallocated space of the file system, which improves in particular the performance of BTRFS in the case of a hard disk. To know more about `btrfsmaintenance` read /usr/doc/btrfsmaintenance*/README.html
de_de: `btrfsmaintenance` führt standardmäßig auch einmal pro Woche "btrfs balance" aus. Dieser Befehl erlaubt es Ihnen, die Daten zwischen den Geräten zu verteilen, wenn sich das Dateisystem über mehrere erstreckt, aber auch den genutzten Speicherplatz neu zu organisieren, insbesondere um den nicht zugewiesenen Speicherplatz des Dateisystems freizugeben. Dies verbessert insbesondere die Leistung von BTRFS auf einer Festplatte. Um mehr über `btrfsmaintenance` zu erfahren, lesen Sie /usr/doc/btrfsmaintenance*/README.html

source: Other useful and BTRFS-compatible tools are included in Slint, all have a --help option and a man page:
de_de: Auch andere nützliche und BTRFS-kompatible Werkzeuge sind in Slint enthalten, alle haben eine --help Option und eine man-Seite:

source: `jdupes` detects duplicate files and allows you to take action accordingly, regardless of the file system used
de_de: `jdupes` erkennt doppelte Dateien und erlaubt Ihnen, entsprechend zu handeln, unabhängig vom verwendeten Dateisystem

source: `btdu` allows to know with precision the place occupied by the BTRFS sub-volumes and directories
de_de: `btdu` erlaubt es, präzise genau zu erfahren, wieviel Platz auf den BTRFS-Subvolumen und -Verzeichnissen belegt ist

source: `restic` is a very versatile backup software that can be used for any file system.
de_de: `restic` ist eine sehr vielseitige Backup-Software, die für jedes Dateisystem verwendet werden kann.

source: Recommendations.
de_de: Empfehlungen.

source: BTRFS needs room to breathe and reorganize. Always keep 10-20% free space.
de_de: BTRFS braucht Platz zum Atmen und Reorganisieren. Halten Sie immer 10-20% Speicherplatz frei.

source: Some tool options included in the btrfs-tools package can be dangerous or counterproductive. Use only those whose effect you know perfectly well and if in doubt seek advice first, on the Slint mailing list or by IRC on irc.libera.chat, channel #btrfs.
de_de: Einige Werkzeug-Optionen, die im Paket btrfs-tools enthalten sind, können gefährlich oder kontraproduktiv sein. Verwenden Sie nur diejenigen, deren Wirkung Sie sehr gut kennen und wenn Sie Zweifel haben, zuerst Rat einholen auf der Slint-Mailingliste oder im IRC auf irc. libera.chat, Kanal #btrfs.

source: In particular, avoid using "btrfs filesystem defrag" and especially not "btrfs check --repair".
de_de: Insbesondere vermeiden Sie die Verwendung von "btrfs filesystem defrag" und vor allem "btrfs check --repair".

source: Before using a command, carefully read the corresponding man page (starting with "man btrtfs" which lists the others).
de_de: Bevor Sie einen Befehl verwenden, lesen Sie sorgfältig die entsprechende Manpage (beginnend mit "man btrtfs", die die anderen auflistet).

source: As with any file system: make regular backups! This is usually the only way to recover your data in the event of hardware failure.
de_de: Wie bei jedem Dateisystem: Erstellen Sie regelmäßige Sicherungen! Dies ist in der Regel die einzige Möglichkeit, Ihre Daten im Falle eines Hardware-Fehlers wiederherzustellen.

source: For further:
de_de: Für Weiteres:

source: The Forza wiki: https://wiki.tnonline.net/w/Category:Btrfs
de_de: Das Forza wiki: https://wiki.tnonline.net/w/Category:Btrfs

source: The official documentation: https://btrfs.readthedocs.io/en/latest/
de_de: Die offizielle Dokumentation: https://btrfs.readthedocs.io/en/latest/

source: Questions, problems: on irc.libera.chat channel #btrfs
de_de: Fragen, Probleme: im irc.libera.chat Channel #btrfs
