Repository: DidierSpaier/slint-translations
Catalog: pot_on_Crowdin/news/*.news.po
Languages: pt_pt, sv_se

source: News
pt_pt: Notícias
sv_se: Nyheter

source: 20 June 2024: Updates preparing the release of a new ISO
pt_pt: 20 de Junho de 2024: Atualizações preparando o lançamento de uma nova ISO
sv_se: 20 juni 2024: Uppdateringar som förbereder lanseringen av en ny ISO

source: The batch of updates available today paves the way for a new ISO that will, beyond these updates and a few fixes of the installer, provide only one desktop: MATE.
pt_pt: O lote de atualizações disponível hoje abre caminho a uma nova ISO que, para além destas atualizações e de algumas correções do instalador, fornecerá apenas um ambiente de trabalho: MATE.
sv_se: De uppdateringar som finns tillgängliga i dag banar väg för en ny ISO som, utöver dessa uppdateringar och några fixar i installationsprogrammet, endast tillhandahåller ett skrivbord: MATE.

source: Other desktops will be available, either provided in other ISOs, or installable as packages sets provided by contributors, at least the XFCE and LXQt desktops.
pt_pt: Outros ambientes de trabalho estarão disponíveis, quer fornecidos noutras ISOs, quer instaláveis como conjuntos de pacotes fornecidos pelos contribuidores, pelo menos os ambientes de trabalho XFCE e LXQt.
sv_se: Andra skrivbord kommer att vara tillgängliga, antingen tillhandahållna i andra ISO:s, eller installerbara som paket som tillhandahålls av bidragsgivare, minst XFCE och LXQt skrivbord.

source: The current batch of updates provides mainly:
pt_pt: O atual lote de atualizações fornece principalmente:
sv_se: Den aktuella batchen av uppdateringar innehåller huvudsakligen följande:

source: New versions of the MATE and LXQt desktops
pt_pt: Novas versões dos ambientes de trabalho MATE e LXQt
sv_se: Nya versioner av skrivbordsmiljöerna MATE och LXQt

source: An enhancement of the visual appearance of the MATE desktop, huge thanks to miss Tell for her many hints and suggestions!
pt_pt: Um melhoramento do aspeto visual do ambiente de trabalho MATE, um enorme agradecimento à "Miss Tell" pelas suas dicas e sugestões!
sv_se: En förbättring av det visuella utseendet på MATE-skrivbordet, ett stort tack till miss Tell för hennes många tips och förslag!

source: An upgrade of several a11y applications to their latest stable versions
pt_pt: Uma atualização de várias aplicações a11y para as suas últimas versões estáveis
sv_se: En uppgradering av flera a11y-program till sina senaste stabila versioner

source: New and upraded packages in the main repository, /testing or /extra.
pt_pt: Pacotes novos e atualizados no repositório principal, /testing ou /extra.
sv_se: Nya och uppradade paket i huvudarkivet, /testing eller /extra.

source: The changes are detailed in the https://slackware.uk/slint/x86_64/slint-15.0/ChangeLog.txt[Changelog]
pt_pt: As alterações são detalhadas em https://slackware.uk/slint/x86_64/slint-15.0/ChangeLog.txt[Registo de alterações]
sv_se: Ändringarna beskrivs i detalj på https://slackware.uk/slint/x86_64/slint-15.0/ChangeLog.txt[Changelog]

source: Before listing the major ones, here is how to make existing desktops look as if they had been installed after the upgrade.
pt_pt: Antes de enumerar as principais, eis como fazer com que os ambientes de trabalho existentes pareçam ter sido instalados após a atualização.
sv_se: Innan du listar de viktigaste, så här får du befintliga skrivbord att se ut som om de hade installerats efter uppgraderingen.

source: If you want to re-configure MATE to get its new appearance for a given user, just type as this user: `dconf reset -f /`
pt_pt: Se quiser reconfigurar o MATE para obter a sua nova aparência para um determinado utilizador, basta escrever como este utilizador: `dconf reset -f /`
sv_se: Om du vill konfigurera om MATE för att få sitt nya utseende för en viss användare, skriv bara som den här användaren: `dconf reset -f /`

source: Be aware that this will override the customization that you'd have previously done at the user level!
pt_pt: Tenha em atenção que isto irá substituir a personalização que teria feito anteriormente ao nível do utilizador!
sv_se: Var medveten om att det här åsidosätter den anpassning som du tidigare har gjort på användarnivå!

source: If you want to reconfigure LXQt to get its new appearance for a given user, you need to first get out of LXQt. Either type as root `login-chooser text` then reboot, or log in another desktop like MATE. Then type as regular user:
pt_pt: Se quiser reconfigurar o LXQt para obter a sua nova aparência para um determinado utilizador, precisa primeiro de sair do LXQt. Ou escreva como root `login-chooser text` e depois reinicie, ou inicie sessão noutro ambiente de trabalho como o MATE. Depois escreva como utilizador normal:
sv_se: Om du vill konfigurera om LXQt för att få sitt nya utseende för en viss användare, måste du först komma ut ur LXQt. Antingen skriver du in som root `login-chooser text` sedan starta om, eller logga in med ett annat skrivbord som MATE. Skriv sedan som vanlig användare:

source: Again, be aware that this will override the customization that you'd have previously done at the user level!
pt_pt: Mais uma vez, tenha em atenção que isto irá substituir a personalização que teria feito anteriormente ao nível do utilizador!
sv_se: Återigen, var medveten om att det här åsidosätter den anpassning som du tidigare har gjort på användarnivå!

source: The MATE desktop and the graphical login manager
pt_pt: O ambiente de trabalho MATE e o gestor de acesso gráfico
sv_se: MATE-skrivbordet och den grafiska inloggningshanteraren

source: The Mate Control Center is customized for Slint.
pt_pt: O Centro de Controlo Mate foi personalizado para o Slint.
sv_se: Mate Kontrollcenter har anpassats för Slint.

source: The Mate tweak application is customized for Slint. It includes several layouts of the panels, including Slint-legacy (the previous layout) and Slint (the new one).
pt_pt: A aplicação de ajustes "Mate tweak" foi personalizada para o Slint. Inclui várias disposições dos painéis, incluindo o Slint-legacy (a disposição anterior) e o Slint (o novo).
sv_se: Applikationen Mate tweak är anpassad för Slint. Den innehåller flera layouter av paneler, inklusive Slint-legacy (den tidigare layouten) och Slint (den nya).

source: The Slint layout provides a single panel including a Brisk menu giving a direct access to several utilities. 3 other menus are available: Advanced, Classic (the default for Slint-legacy) and Compact. In the Slint layout pressing alt-f1 now raises the Compact menu with a single column. In the Slint-legacy layout pressing alt-F1 still raises the Classical menu.
pt_pt: A disposição Slint fornece um único painel que inclui um menu Brisk que dá acesso direto a vários utilitários. Estão disponíveis 3 outros menus: Avançado, Clássico (o padrão para o Slint-legacy) e Compacto. Na disposição Slint, pressionar alt-f1 agora abre o menu Compacto com uma única coluna. Na disposição Slint-legacy, premir alt-F1 continua a abrir o menu Clássico.
sv_se: I slint-layouten finns en enda panel med en Brisk-meny som ger en direkt åtkomst till flera allmännyttiga tjänster. 3 andra menyer är tillgängliga: Avancerat, Classic (standard för Slint-arv) och Compact. I slint-layouten vid tryck på Alt-F1 tar nu upp menyn Kompact med en enda kolumn. I slint-legacy layouten vid tryck på alt-F1 tar du fortfarande upp den klassiska menyn.

source: The Brisk menu includes at the bottom links to the Slint documentation and mate-tweak and a Favorite area, with by default the Caja file manager, the Mate terminal, Firefox, Thuderbird and the Mate Control Center
pt_pt: O menu do Brisk inclui, na parte inferior, ligações para a documentação do Slint e para o mate-tweak e uma área de Favoritos, com o gestor de ficheiros Caja, o terminal Mate, o Firefox, o Thuderbird e o Centro de Controlo Mate
sv_se: I Brisk menyn finns längst ner länkarna till Slint dokumentation och mate-tweak och ett Favoritområde, med som standard Caja filhanterare, Mate terminalen, Firefox, Thuderbird och Mate Kontrollcenter

source: The default window manager for Mate is now Compiz whith an Emerald theme that can be changed using the custom script switch-emerald-theme. But Marco is still available. The change can be made in mate-tweak. In addition to the CCSM (compiz-config-settings-manager), simple-ccsm is provided in /extra.
pt_pt: O gestor de janelas predefinido para o Mate é agora o Compiz, com um tema Emerald que pode ser alterado utilizando o script personalizado switch-emerald-theme. Mas o gestor de janelas Marco ainda está disponível. A mudança pode ser feita no mate-tweak. Para além do CCSM (compiz-config-settings-manager), o simple-ccsm é fornecido em /extra.
sv_se: Standardfönsterhanteraren för Mate är nu Compiz whith ett Emerald-tema som kan ändras med hjälp av det anpassade skriptet switch-emerald-theme. Men Marco är fortfarande tillgänglig. Förändringen kan göras i mate-tweak. Förutom CCM (compiz-config-inställningar-manager) tillhandahålls enkel-ccsm i /extra.

source: The lightdm-gtk-greeter is replaced by the lightdm-slick-greeter.
pt_pt: O lightdm-gtk-greeter foi substituído pelo lightdm-slick-greeter.
sv_se: Light-gtk-greeter ska ersättas av lightdm-slick-greeter.

source: The file /usr/share/glib-2.0/schemas/10.slint-appearance.gschema.override gathers customization of the Mate desktop and some other ones at the distribution level.
pt_pt: O ficheiro /usr/share/glib-2.0/schemas/10.slint-appearance.gschema.override reúne a personalização do ambiente de trabalho Mate e algumas outras ao nível da distribuição.
sv_se: Filen /usr/share / glib-2.0/schemas/10.slint-appearance.gschema.override samlar anpassning av Mate-skrivbordet och några andra på distributionsnivå.

source: The LXQt desktop
pt_pt: O ambiente de trabalho LXQt
sv_se: LXQt-skrivbordet

source: This desktop is provided running build scripts provided by Frank Honolka aka snuk, and stored in the lxqt sub-directory, thanks Frank!
pt_pt: Este ambiente de trabalho é fornecido executando scripts de compilação fornecidos por Frank Honolka também conhecido como snuk, e armazenados no sub-diretório lxqt, obrigado Frank!
sv_se: Det här skrivbordet tillhandahålls löpande byggskript som tillhandahålls av Frank Honolka alias smuk, och lagras i underkatalogen lxqt, tack Frank!

source: This includes the desktop itself and associated applications.
pt_pt: Isto inclui o próprio ambiente de trabalho e as aplicações associadas.
sv_se: Det inkluderar själva skrivbordet och tillhörande program.

source: As for Mate the default window manager is compiz and the decorator emerald but openbox is also available. The window manager can be changed from the menu or typing `lxqt-config-session`
pt_pt: Quanto ao Mate, o gestor de janelas predefinido é o compiz e o decorador emerald, mas o openbox também está disponível. O gestor de janelas pode ser alterado a partir do menu ou escrevendo `lxqt-config-session`
sv_se: När det gäller Mate är standardfönsterhanteraren compiz och dekoreringsfunktionen smaragd, men openbox är också tillgänglig. Fönsterhanteraren kan ändras från menyn eller skriv "lxqt-config-session"

source: Other upgrades and new software provided, sorted by category
pt_pt: Outras atualizações e novos softwares fornecidos, ordenados por categoria
sv_se: Andra uppgraderingar och ny programvara som tillhandahålls, sorterade efter kategori

source: Acessibility: at-spi2-core, orca, emacspeak, fenrir, liblouis, liblouisutdml and lios are upgraded.
pt_pt: Acessibilidade: at-spi2-core, orca, emacspeak, fenrir, liblouis, liblouisutdml e lios foram atualizados.
sv_se: Tillgänglighet: at-spi2-core, orca, emacspeak, fenrir, liblouis, liblouisutdml och lios är uppdaterade.

source: Audio/video: vlc, mpv and yt-dlp are upgraded.
pt_pt: Áudio/vídeo: vlc, mpv e yt-dlp foram atualizados.
sv_se: Ljud/video: vlc, mpv och yt-dlp är uppdaterade.

source: The semantic application launchers cerebro, synapse and ulauncher are provided in /testing. A short presentation of them can be found for instance in https://www.debugpoint.com/top-ubuntu-launcher-2022/ and https://softwarelibre166246735.wordpress.com/2020/06/18/10-best-application-launchers-for-linux-desktops/. These launchers allow to start applications but also to find files in your system, do calculations or search the web, for instance, often through plugs-ins.
pt_pt: Os lançadores de aplicações semânticas cerebro, synapse e ulauncher são fornecidos em /testing. Uma breve apresentação dos mesmos pode ser encontrada, por exemplo, em https://www.debugpoint.com/top-ubuntu-launcher-2022/ e https://softwarelibre166246735.wordpress.com/2020/06/18/10-best-application-launchers-for-linux-desktops/. Estes lançadores permitem iniciar aplicações, mas também encontrar ficheiros no seu sistema, fazer cálculos ou pesquisar na Web, por exemplo, muitas vezes através de plugs-ins.
sv_se: Den semantiska programstartaren cerebro, synapse och ulauncher tillhandahålls i /testing. En kortfattad redogörelse för dem finns till exempel på https://www.debugpoint.com/top-ubuntu-launcher-2022/ och https://softwarelibre166246735.wordpress.com/2020/06/18/10-best-application-launchers-for-linux-desktops/. Med hjälp av startfunktionerna kan du starta program men även söka efter filer i systemet, göra beräkningar eller söka i webben, t.ex. ofta via pluggins.

source: Visual appearance: many themes are added or upgraded: Qogir-icon-theme, emerald-themes (the "overglossed" theme of the emerald decorator is associated with the Compiz window manager), kvantum-theme-qogir, breeze-blue-cursor-theme and breeze-icons for LXQt, papirus-icon-theme, yaru-gtk-theme. Newaita-reborn, posy-cursors and Tela-icon-theme are also available in /testing. Conversely, mate-colors-icon-teme, mate-backgrounds and murrine-themes are removed. Several desktop backgrounds or wallpapers are added.
pt_pt: Aspeto visual: muitos temas foram adicionados ou atualizados: Qogir-icon-theme, emerald-themes (o tema "overglossed" do decorador emerald está associado ao gestor de janelas Compiz), kvantum-theme-qogir, breeze-blue-cursor-theme e breeze-icons para LXQt, papirus-icon-theme, yaru-gtk-theme. Newaita-reborn, posy-cursors e Tela-icon-theme também estão disponíveis em /testing. Por outro lado, mate-colors-icon-teme, mate-backgrounds e murrine-themes foram removidos. Vários fundos de ecrã ou papéis de parede foram adicionados.
sv_se: Visuellt utseende: många teman har laggts till eller uppgraderats: Qogir-icon-tema, emerald-tema (emerald-temat för emerald-dekoreringsfunktionen är associerat med Compiz fönsterhanteraren), kvantum-temat-qogir, breeze-blue-cursor-temat och breeze-ikoner för LXQt, papirus-icon-temat, yaru-gtk-temat. Nevänta-reborn, posy-cursors och Tela-icon-tema är också tillgängliga i /testing. Omvänt tas mate-colors-icon-teme, mate-bakgrunder och murrine-teman bort. Flera skrivbordsbakgrunder eller skrivbordsunderlägg läggs till.

source: System: btrtbk (backup tool for BTRFS subvolumes) and sof-firmware are added, absm (BTRFS snashot manager), amd-microcode, intel-microcode, kernel, kernel-firmware, and qemu (in /extra) are upgraded. The guake drop-down terminal is added
pt_pt: Sistema: btrtbk (ferramenta de cópias de segurança para subvolumes BTRFS) e sof-firmware foram adicionados, absm (gestor de cópias BTRFS), amd-microcode, intel-microcode, kernel, kernel-firmware e qemu (em /extra) foram atualizados. O terminal guake drop-down foi adicionado
sv_se: System: btrtbk (säkerhetskopieringsverktyg för BTRFS-undervolymer) och sof-firmware läggs till, absm (BTRFS-snashothanterare), amd-mikrokod, intel- mikrokod, kernel, kernel-firmware och qemu (i /extra) uppgraderas. guake terminal rullgardinsmeny läggs till

source: Development: vscode (Visual Studio Code) is added in /extra, nano and emacs are upgraded.
pt_pt: Desenvolvimento: vscode (Visual Studio Code) foi adicionado em /extra, nano e emacs foram atualizados.
sv_se: Utveckling: vs-kod (Visual Studio Code) läggs till i /extra, nano och Emacs uppgraderas.

source: Office: LibreOffice and associated help files and dictionaries are upgraded, thanks to Eric Hameleers aka alienBOB and libreoffice-sdkdoc is available in /extra. Remind is also updated.
pt_pt: Produtividade: O LibreOffice e os ficheiros de ajuda e dicionários associados foram actualizados, graças ao Eric Hameleers também conhecido como alienBOB e o libreoffice-sdkdoc está disponível em /extra. O Remind também foi atualizado.
sv_se: Kontor: LibreOffice och associerade hjälpfiler och ordlistor har uppgraderats, tack vare Eric Hameleers alias alienBOB och libreoffice-sdkdoc finns tillgängligt i /extra. Remind har också uppdaterats.

source: Known issues
pt_pt: Problemas conhecidos
sv_se: Kända problem

source: After upgrade LXQt can have a black background because the previous default wallpaper has been removed. You can choose another one typing `lxqt-config-appearance`, that can also be started form the menu or a left click on the desktop. Alternatively, as indicated above type after a text login: `cp /usr/share/pcmanfm-qt/lxqt/settings.conf ~/.config/lxqt/`. This will display the new default wallpaper.
pt_pt: Após a atualização, o LXQt pode ficar com um fundo preto porque o papel de parede predefinido anterior foi removido. Pode escolher outro escrevendo `lxqt-config-appearance`, que também pode ser iniciado a partir do menu ou de um clique com o botão esquerdo do rato no ambiente de trabalho. Em alternativa, como indicado acima, escreva após um início de sessão via texto: `cp /usr/share/pcmanfm-qt/lxqt/settings.conf ~/.config/lxqt/`. Isto irá mostrar o novo papel de parede predefinido.
sv_se: Efter uppgraderingen kan LXQt ha en svart bakgrund eftersom föregående standardskrivbordsbakgrund har tagits bort. Du kan välja ett annat skriv: "lxqt-config-appearance", som också kan startas på menyn eller vänsterklicka på skrivbordet. Alternativt, som anges ovan, efter en textinloggning skriv: " cp /usr/share/pcmanfm-qt/lxqt/settings.conf ~/.config/lxqt/". Det här visar det nya standardskrivbordsbakgrund.

source: In MATE if started in text mode the date can't be set using the widget in the boottom panel. Use clocksetup or gtkclocksetup instead.
pt_pt: No MATE, se iniciado em modo texto, a data não pode ser definida usando o widget no painel inicial. Em vez disso, use o clocksetup ou o gtkclocksetup.
sv_se: I MATE om det startas i textläge kan datumet inte anges med hjälp av widgeten i den understa panelen. Använd clocksetup eller gtkclocksetup i stället.

source: If you disable the display of the desktop icons in mate-tweak, a right click on the desktop becomes ineffective.
pt_pt: Se desativar a apresentação dos ícones do ambiente de trabalho no mate-tweak, o clique com o botão direito do rato no ambiente de trabalho torna-se ineficaz.
sv_se: Om du avaktiverar visningen av skrivbordsikoner i mate-tweak, blir ett högerklick på skrivbordet verkningslös.

source: 16 May 2023: A new ISO is available (yes, again!)
pt_pt: 16 de maio de 2023: Uma nova ISO está disponível (sim, novamente!)
sv_se: 16 maj 2023: En ny ISO är tillgänglig (ja, igen!)

source: This new ISO is provided mainly to fix the bug described in https://slackware.uk/slint/x86_64/slint-15.0/iso/previous_iso/BUG-15.0-3[BUG-15.0-3].
pt_pt: Esta nova ISO é fornecida principalmente para corrigir o erro descrito em https://slackware.uk/slint/x86_64/slint-15.0/iso/previous_iso/BUG-15.0-3[BUG-15.0-3].
sv_se: Denna nya ISO tillhandahålls huvudsakligen för att åtgärda felen som beskrivs i https://slackware.uk/slint/x86_64/slint-15.0/iso/previous_iso/BUG-15.0-3[BUG-15.0-3].

source: Other fixes and enhancements:
pt_pt: Outras correções e melhorias:
sv_se: Andra fixar och förbättringar:

source: The user who refuses the proposed (through geoIP) time zone is given the choice to select another one or keep the default one (UTC), as if none were proposed.
pt_pt: O utilizador que recusar o fuso horário proposto (através do geoIP) tem a possibilidade de escolher outro ou manter o fuso horário predefinido (UTC), como se não tivesse sido proposto nenhum.
sv_se: Den användare som nekar den föreslagna tidszonen (via geoIP) får välja en annan eller behålla standardvärdet (UTC), som om inget förslag har föreslagits.

source: The EFI boot loader grub.x64.efi is installed in /boot/efi/EFI/slint-$SLINTVERSION, currently /boot/efi/EFI/slint-15.0, to help select the boot entry if several versions are installed.
pt_pt: O carregador de arranque EFI grub.x64.efi está instalado em /boot/efi/EFI/slint-$SLINTVERSION, atualmente /boot/efi/EFI/slint-15.0, para ajudar a selecionar a entrada de arranque se estiverem instaladas várias versões.
sv_se: EFI starthanteraren grub.x64.efi är installerad i /boot/efi/EFI/slint-$SLINTVERSION, för närvarande /boot/efi/EFI/slint-15.0, för att hjälpa till att välja startposten om flera versioner är installerade.

source: In case of manual partitioning:
pt_pt: No caso de particionamento manual:
sv_se: I händelse av manuell partitionering:

source: If the machine booted the installer in Legacy mode GRUB is also installed in EFI mode if an EFI System Partition (ESP) is found on the drive of the root partition.
pt_pt: Se a máquina arrancar com o instalador no modo Legacy o GRUB também é instalado no modo EFI se uma Partição de Sistema EFI (ESP) for encontrada na unidade da partição root.
sv_se: Om maskinen startade installationsprogrammet i Legacy-läget är GRUB också installerat i EFI-läge om en EFI-systempartition (ESP) hittas på enhetens rotpartition.

source: If the machine booted the installer in EFI mode GRUB is also installed in Legacy mode unless the root partition be in a drive with a GUID partition table (GPT) but with no BIOS boot partition.
pt_pt: Se a máquina arrancar com o instalador no modo EFI o GRUB também é instalado no modo Legacy a não ser que a partição root esteja numa unidade com uma tabela de partições GUID (GPT) mas sem uma partição de arranque BIOS.
sv_se: Om maskinen startade installationsprogrammet i EFI-läger är GRUB också installerat i Legacy-läge såvida inte rotpartitionen är i en enhet med en GUID-partitionstabell (GPT) men utan BIOS bootpartition.

source: Thus, in most cases the installed system will be able to boot in both EFI and Legacy modes in manual as in auto partitioning modes.
pt_pt: Assim, na maioria dos casos, o sistema instalado será capaz de arrancar em ambos os modos EFI e Legacy nos modos de particionamento manual e automático.
sv_se: Således, i de flesta fall kan det installerade systemet att kunna starta upp i både EFI och Legacy lägen i manuell som i automatisk partitioneringslägen.

source: 10 May 2023: A new Slint ISO is available
pt_pt: 10 de Maio de 2023: Uma nova ISO do Slint está disponível
sv_se: 10 maj 2023: En ny slint ISO är tillgänglig

source: The lightweight i3 desktop is added as well as the I38 utility which make it fully accessible with a screen reader, just running the i38 command after installation, thanks to Storm Dragon.
pt_pt: O gestor de janelas i3 foi adicionado, bem como o utilitário I38, que o torna totalmente acessível com um leitor de ecrã, bastando executar o comando i38 após a instalação, graças ao Storm Dragon.
sv_se: Det lätta i3-skrivbordet läggs till samt I38-verktyget som gör det helt tillgängligt med en skärmläsare, bara kör i38-kommandot efter installationen, tack till Storm Dragon.
