Repository: DidierSpaier/slint-translations
Catalog: pot_on_Crowdin/news/*.news.po
Languages: pt_pt, sv_se

source: The repository https://slackware.uk/salix/x86_64/xfce4.18-15.0/[xfce4.18-15.0] is enabled by default, allowing to install a fully configured and featured xfce-4.18 desktop just typing `+slapt-get --install-set xfce+`, thanks to George Vlahavas.
pt_pt: O repositório https://slackware.uk/salix/x86_64/xfce4.18-15.0/[xfce4.18-15.0] está ativado por padrão, permitindo a instalação de um ambiente de trabalho xfce-4.18 totalmente configurado e repleto de funcionalidades, apenas introduzindo o comando `+slapt-get --install-set xfce+`, graças ao George Vlahavas.
sv_se: Förrådet https://slackware.uk/salix/x86_64/xfce4.18-15.0/[xfce4.18-15.0] är aktiverat som standard, vilket tillåter att installera en fullt konfigurerad och utrustad xfce-4.18 skrivbord genom att skriver `+slapt-get --install-set xfce+`, tack till George Vlahavas.

source: In `manual` partitioning mode it is no more required to include a BIOS Boot partition in a GUID partition table (GPT) if the machine booted in EFI mode, nor an EFI System partition if the machine booted in Legacy mode.
pt_pt: No modo de particionamento `manual` já não é necessário incluir uma partição de arranque BIOS numa tabela de partições GUID (GPT) se a máquina arrancar em modo EFI, nem uma partição de sistema EFI se a máquina arrancar em modo Legacy.
sv_se: I `manual`-partitioneringsläge krävs det inte mer att inkludera en BIOS-start-partition i en GUID-partitionstabell (GPT) om maskinen startade i EFI-läge, inte heller en EFI System-partition om maskinen startas i Legacy-läge.

source: In `auto` partitioning mode it is now allowed to put the /home directory in dedicated partition, only if it is in another drive than the one hosting the main partition mounted as /.
pt_pt: No modo de particionamento `auto` agora é permitido colocar o diretório /home numa partição dedicada, somente se a mesma estiver noutra unidade que não a que aloja a partição principal montada como /.
sv_se: I `auto` partitioneringsläge är det nu tillåtet att sätta /home katalogen i dedikerad partition, bara om det är i en annan enhet än där huvudpartitionen monteras som /.

source: The user is allowed to select an existing partition for /home, possibly to continue using an existing one.
pt_pt: O utilizador tem permissão para selecionar uma partição existente para a /home, possivelmente para continuar a utilizar uma partição existente.
sv_se: Användaren får välja en befintlig partition för /home, eventuellt för att fortsätta att använda en befintlig.

source: If /home is in an already formatted partition (in case the user wants to continue using an existing one), the installer will offer to keep its content or re-format it, as with any other linux partition except the main one mounted as /.
pt_pt: Se a /home está numa partição já formatada (no caso do utilizador querer continuar a utilizar uma existente), o instalador irá oferecer-se para manter o seu conteúdo ou reformatá-la, como com qualquer outra partição linux excepto a principal montada como /.
sv_se: Om /home finns i en redan formaterad partition (om användaren vill fortsätta att använda en befintlig), kommer installationsprogrammet att erbjuda att behålla innehållet eller återformatera det, som med andra linux-partitioner, utom den som är monterad som /.

source: All main desktops (MATE, LXQt, Xfce) as the lightDM greeting screen have the same background "clouds in a blue sky".
pt_pt: Todos os ambientes de trabalho principais (MATE, LXQt, Xfce), tal como o ecrã de saudação lightDM, têm o mesmo fundo "nuvens num céu azul".
sv_se: Alla huvudskrivbord (MATE, LXQt, Xfce) har i lightDM välkomstskärm samma bakgrund "moln i en blå himmel".

source: A lot of packages have been added, upgraded or fixed since the release of the previous ISO, some of the added ones included in the ISO,among which: compsize, confuse, fim, gpart, nushell, Qogir-icon-theme, qogir-theme, salix-xfwm4-theme, rust, testdisk, others available in the /extra repository: calibre, emacs-nativecomp, libgccjit, notmuch, soft.
pt_pt: Muitos pacotes foram adicionados, atualizados ou corrigidos desde o lançamento da ISO anterior, alguns dos adicionados incluídos na ISO, entre os quais: compsize, confuse, fim, gpart, nushell, Qogir-icon-theme, qogir-theme, salix-xfwm4-theme, rust, testdisk, outros disponíveis no repositório /extra: calibre, emacs-nativecomp, libgccjit, notmuch, soft.
sv_se: Många paket har lagts till, uppgraderats eller rättats sedan den tidigare ISO-filen släpptes, några av de tillagda som ingår i ISO, varav compsize, confuse, fim, gpart, nushell, Qogir-icon-theme, qogir-theme, salix-xfwm4-tema, rost, testdisk, andra finns i /extra förrådet: kaliber, emacs-nativecomp, libgccjit, notmuch, soft.

source: The boot menu of the installed system include a menu entry to access the firmware's setup in EFI mode.
pt_pt: O menu de arranque do sistema instalado inclui uma entrada de menu para aceder à configuração do firmware no modo EFI.
sv_se: Startmenyn i det installerade systemet innehåller ett menyalternativ för att komma åt inbyggda programvarans konfiguration i EFI-läge.

source: If GRUB is installed it is now possible to boot the installation ISO stored in an internal disk's partition: no need to write this ISO on a DVD or USB stick in this case. To do so, edit the file /etc/grub.d/40_custom so it contains:
pt_pt: Se o GRUB estiver instalado, é agora possível arrancar a ISO de instalação armazenada numa partição do disco interno: neste caso, não é necessário gravar esta ISO num DVD ou numa pen USB. Para o fazer, edite o ficheiro /etc/grub.d/40_custom de modo a que contenha:
sv_se: Om GRUB är installerat är det nu möjligt att starta installationen ISO-lagrad på en intern disk partition: du behöver inte skriva denna ISO på en DVD-eller USB-stav i det här fallet. Om du vill göra det ändrar du filen /etc/grub.d/40_custom så att den innehåller:

source: #!/bin/sh exec tail -n +3 $0 # This file provides an easy way to add custom menu entries. Simply type the # menu entries you want to add after this comment. Be careful not to change # the 'exec tail' line above. menuentry 'Slint ISO 15.0-3' { insmod part_gpt insmod part_msdos search --no-floppy --fs-uuid --set=root <UUID> set isofile='slint64-15.0-3.iso' loopback loop /repo/x86_64/slint-15.0/iso/$isofile linux (loop)/linux quiet vga=normal load_ramdisk=1 prompt_ramdisk=0 ro printk.time=0 initrd (loop)/initrd }
pt_pt: #!/bin/sh exec tail -n +3 $0 # Este ficheiro fornece uma forma fácil de adicionar entradas de menu personalizadas. # Basta escrever as entradas de menu que deseja adicionar após este comentário. # Tenha cuidado para não alterar a linha 'exec tail' acima. menuentry 'Slint ISO 15.0-3' { insmod part_gpt insmod part_msdos search --no-floppy --fs-uuid --set=root <UUID> set isofile='slint64-15.0-3.iso' loopback loop /repo/x86_64/slint-15.0/iso/$isofile linux (loop)/linux quiet vga=normal load_ramdisk=1 prompt_ramdisk=0 ro printk.time=0 initrd (loop)/initrd }
sv_se: #!/bin/sh exec tail -n +3 $0 # Den här filen gör det enkelt att lägga till egna menyposter. Skriv helt enkelt de # menyposter som du vill lägga till efter denna kommentar. Var försiktig så att du inte ändrar # raden "exec tail" ovan. menuentry 'Slint ISO 15.0-3' { insmod part_gpt insmod part_msdos search --no-floppy --fs-uuid --set=root <UUID> set isofile='slint64-15.0-3.iso' loopback loop /repo/x86_64/slint-15.0/iso/$isofile linux (loop)/linux quiet vga=normal load_ramdisk=1 prompt_ramdisk=0 ro printk.time=0 initrd (loop)/initrd }

source: Just replace <UUID> by the UUID of the partition where the ISO is stored. For instance if the ISO is in /dev/sda3, this command will output this UUID: `lsblk -lno uuid /dev/sda3`. Also replace `/repo/x86_64/slint-15.0/iso/` by the path to the ISO file. After that, run grub-mkconfig or update-grub so that this boot entry be included in grub.cfg. The installer will tell you it can't find the ISO and how to mount it if it is in an internal disk's partition.
pt_pt: Basta substituir o <UUID> pelo UUID da partição onde a ISO está armazenada. Por exemplo, se a ISO está em /dev/sda3, este comando irá mostrar este UUID: `lsblk -lno uuid /dev/sda3`. Substituir também o `/repo/x86_64/slint-15.0/iso/` pelo caminho para o ficheiro ISO. Depois disso, execute grub-mkconfig ou update-grub para que essa entrada de arranque seja incluída no grub.cfg. O instalador dir-lhe-á que não consegue encontrar a ISO e como montá-la se estiver numa partição do disco interno.
sv_se: Ersätt bara <UUID> med UUID för den partition där ISO-filen är lagrad. Exempel: Om ISO-filen är i /dev/sda3, kommer det här kommandot att ge UUID: ` lsblk-lno uuid /dev/sda3 ". Ersätt också den kod / repo/x86_64/slint-15.0/iso/" sökvägen till ISO-filen. Efter det kör du grub-mkconfig eller update-grub så att den här startposten inkluderas i grub.cfg. Installationsprogrammet talar om för dig att den inte kan hitta ISO-filen och hur man monterar den om den finns i en intern disk partition.

source: Pictures of lightDM and the main desktops in Slint
pt_pt: Imagens do lightDM e dos principais ambientes de trabalho no Slint
sv_se: Bilder på lightDM och huvudskrivbordet i Slint

source: XFCE (installed on demand)
pt_pt: XFCE (instalado a pedido)
sv_se: XFCE (installerad på begäran)
