Repository: DidierSpaier/slint-translations
Catalog: translations20220904/setup/*.setup.po
Languages: nl_nl

source: \n Scanning your system for partition information...\n \n
nl_nl: \n Systeem doorzoeken op partitie informatie...\n \n

source: NO LINUX PARTITIONS DETECTED
nl_nl: GEEN LINUX-PARTITIES GEDETECTEERD

source: There don't seem to be any partitions on this machine of type Linux. You'll need to make at least one of these to install Linux. To do this, you'll need to leave 'setup', and make the partitions using 'cfdisk' (MBR partitions) or 'cgdisk' (GPT partitions). For more information, read the 'setup' help file from the next menu.
nl_nl: Er lijken geen Linux-partities op deze machine aanwezig te zijn. Je moet er minstens één maken om Linux te kunnen installeren. Hiervoor moet je 'setup' verlaten en de partities maken met 'cfdisk' (MBR-partities) of 'cgdisk' (GPT-partities). Lees voor meer informatie het 'setup' help-bestand uit het volgende menu.

source: NO EFI SYSTEM PARTITION DETECTED
nl_nl: GEEN EFI SYSTEEMPARTITIE GEDETECTEERD

source: This machine appears to be using EFI/UEFI, but no EFI System Partition was found. You'll need to make an EFI System Partition in order to boot from the hard drive. To do this, leave 'setup', and use 'cgdisk' to make a 100MB partition of type EF00. For more information, read the 'setup' help file from the next menu.
nl_nl: Deze machine lijkt EFI/UEFI te gebruiken maar er werd geen EFI systeempartitie gevonden. Je moet een EFI systeempartitie maken om van de harde schijf te kunnen opstarten. Verlaat hiervoor 'setup' en maak met 'cgdisk' een 100MB partitie van type EF00. Lees voor meer informatie het 'setup' help-bestand uit het volgende menu.

source: NO BIOS BOOT PARTITION DETECTED
nl_nl: GEEN BIOS BOOT PARTITIE DETECTEERD

source: This machine booted in Legacy or BIOS mode, but no BIOS boot partition was found. You will need to make one in order to boot from the hard drive. To do this, leave 'setup' and use 'gdisk' or 'cgdisk' to make a partition of type BIOS boot and size 2MB.
nl_nl: Deze machine is opgestart in Legacy of BIOS-modus maar er is geen BIOS-opstartpartitie gevonden. U moet er een maken om op te kunnen starten vanaf de harde schijf. Verlaat hiervoor 'setup' en gebruik 'gdisk' of 'cgdisk' om een partitie van het type BIOS boot met een grootte van 2MB te maken.

source: Can't umount /var/log/mount. Reboot machine and run setup again.
nl_nl: Kan /var/log/mount niet afkoppelen. Herstart de machine en start 'setup' opnieuw.

source: Mount table corrupt. Reboot machine and run setup again.
nl_nl: Aankoppeltabel is beschadigd. Herstart de machine en start 'setup' opnieuw.

source: Slint Linux Setup (version ${Version})
nl_nl: Slint Linux Setup (versie ${Version})

source: Welcome to Slint Linux Setup. Select an option below using the UP/DOWN keys and SPACE or ENTER. Alternate keys may also be used: '+', '-', and TAB.
nl_nl: Welkom bij Slint Linux Setup. Kies een optie hieronder met de OP/NEER toetsen, spatiebalk of ENTER. Alternatieve toetsen werken ook: '+', '-' en TAB.

source: Read the Slint Setup HELP file
nl_nl: Lees het Slint Setup HELP-bestand

source: Remap your keyboard (other than $DefaultKeyMap)
nl_nl: Verander je toetsenbordindeling (anders dan $DefaultKeyMap)

source: Set up your swap partition(s)
nl_nl: Stel wisselgeheugenpartitie(s) in

source: Set up your target partitions
nl_nl: Stel je doelpartities in

source: Select source media
nl_nl: Selecteer bronmedium

source: Install selected software
nl_nl: Installeer de geselecteerde software

source: Reconfigure your Linux system
nl_nl: Opnieuw configureren van je Linux-systeem

source: Exit Slint Linux Setup
nl_nl: Verlaat Slint Linux Setup

source: TARGET PARTITIONS ALREADY CONFIGURED
nl_nl: DOELPARTITIES ZIJN AL GECONFIGUREERD

source: You have already configured the target partitions, where the system will be installed. Press ENTER to return to the main menu.
nl_nl: Je hebt de doelpartities waarin het systeem geïnstalleerd zal worden al geconfigureerd,. Toets Enter om naar het hoofdmenu terug te keren.

source: SOURCE OF PACKAGES ALREADY CHOSEN
nl_nl: INSTALLATIEBRON AL GEKOZEN

source: You have already chosen the source of packages. Press ENTER to return to the main menu.
nl_nl: Je hebt de installatiebron al gekozen. Toets Enter om naar het hoofdmenu terug te keren.

source: SOURCE PACKAGES INAPPROPRIATE
nl_nl: INSTALLATIEBRON ONGESCHIKT

source: Either the source packages are inappropriate for the target system: Slint version $SLINTVERSION (${SFX}-bit) or the file $INSTALL_PATH/slint/DONOTREMOVEME.TXT is missing. Please try again to set the source of packages
nl_nl: Ofwel de installatiebron is niet geschikt voor het doelsysteem: Slint versie $SLINTVERSION (${SFX}-bit) of het bestand $INSTALL_PATH/slint/DONOTREMOVEME.TXT bestaat niet. Voer opnieuw de installatiebron in

source: CANNOT INSTALL SOFTWARE YET
nl_nl: KAN SOFTWARE NOG NIET INSTALLEREN

source: Before you can install software, complete the following tasks: 1. Select your source media. 2. Set up your target Linux partition(s). You may also optionally remap your keyboard and set up your swap partition(s). Press ENTER to return to the main menu.
nl_nl: Voer te volgende taken uit voor je de software kunt installeren: 1. Kies je installatiebron. 2. Stel je Linux doelpartitie(s) in. Je kunt ook je toetsenbordindeling wijzigen en je wisselbestandspartitie(s) instellen. Druk Enter om terug te keren naar het hoofdmenu.

source: READY TO INSTALL THE PACKAGES?
nl_nl: KLAAR OM DE PAKKETTEN TE INSTALLEREN?

source: Please confirm that you want to install the packages.
nl_nl: Bevestig dat je de pakketten wilt installeren.

source: INSTALL KDE PACKAGES?
nl_nl: KDE-PAKKETTEN INSTALLEREN?

source: Do you want to install the KDE packages?
nl_nl: Wil je de KDE pakketten installeren?

source: A one-line description will be displayed as each package is installed.
nl_nl: Je ziet een korte beschrijving bij elk geïnstalleerd pakket.

source: SYSTEM NOT YET INSTALLED
nl_nl: SYSTEEM IS NOG NIET GEÏNSTALLEERD

source: You need to install the packages before configuring the system. Please press ENTER to return to the main menu.
nl_nl: Je moet de pakketten installeren alvorens het systeem te configureren. Druk op Enter om naar het hoofdmenu terug te keren.

source: REPLACE /etc/fstab?
nl_nl: /etc/fstab VERVANGEN?

source: You already have an /etc/fstab on your install partition. If you were just adding software, you should probably keep your old /etc/fstab. If you've changed your partitioning scheme, you should use the new /etc/fstab. Do you want to replace your old /etc/fstab with the new one?
nl_nl: Je hebt al een /etc/fstab op je installatiepartitie. Als je alleen software hebt toegevoegd wil je waarschijnlijk je oude /etc/fstab behouden. Als je je partitie-indeling hebt veranderd gebruik dan de nieuwe /etc/fstab. Wil je je oude /etc/fstab vervangen door de nieuwe?

source: Installing translations...
nl_nl: Vertalingen installeren...

source: Slint Linux Setup is complete
nl_nl: Installatie van Slint Linux is nu voltooid.

source: Please remove the installation disc.
nl_nl: Verwijder nu het installatiemedium.

source: Would you like to reboot your system? If you choose No, you will be dropped to a shell.
nl_nl: Wil je je systeem nu opnieuw opstarten? Indien je Nee kiest kom je in een shell terecht.

source: You may now reboot your system once you are ready. You can issue the 'reboot' command; or if your system has a keyboard attached, you can use the key combination: control+alt+delete
nl_nl: Je kunt je systeem nu herstarten als je zover bent. Je kunt hiervoor de 'reboot' opdracht gebruiken; of als op het systeem een toetsenbord is aangesloten, kun je ook de toetscombinatie control+alt+delete gebruiken

source: ** Starting reboot **
nl_nl: ** Opnieuw opstarten **
