Repository: DidierSpaier/slint-translations
Catalog: translations20220905/setup/*.setup.po
Languages: hi_in, tr_tr, uk_ua

source: Slint Linux Setup
hi_in: स्लिंट लिनक्स सेटअप
tr_tr: Slint Linux Kurulumu
uk_ua: Встановлення Slint Linux

source: \n Scanning your system for partition information...\n \n
hi_in: \n विभाजन सूचना हेतु सिस्टम स्कैन करना जारी...\n \n
tr_tr: \n Sisteminizin bölüm bilgileri taranıyor...\n \n
uk_ua: \n Отримання інформації про розділи у вашій системі...\n \n

source: NO LINUX PARTITIONS DETECTED
hi_in: कोई लिनक्स विभाजन नहीं मिला
tr_tr: LINUX BÖLÜMLERİ TESPİT EDİLEMEDİ
uk_ua: РОЗДІЛІВ LINUX НЕ ВИЯВЛЕНО

source: There don't seem to be any partitions on this machine of type Linux. You'll need to make at least one of these to install Linux. To do this, you'll need to leave 'setup', and make the partitions using 'cfdisk' (MBR partitions) or 'cgdisk' (GPT partitions). For more information, read the 'setup' help file from the next menu.
hi_in: प्रतीत होता है कि इस मशीन पर लिनक्स प्रकार का कोई विभाजन नहीं है। लिनक्स इंस्टॉल करने हेतु आपको इस प्रकार का कम से कम एक विभाजन बनाना होगा। ऐसा करने के लिए 'सेटअप' बंद करें व 'cfdisk' (MBR विभाजन) या 'cgdisk' (GPT विभाजन) उपयोग कर विभाजन बनाएँ। अधिक सूचना हेतु भावी मेन्यू से 'सेटअप' सहायता फाइल पढ़ें।
uk_ua: Схоже - на цьому комп'ютері немає розділів типу Linux. Вам потрібно створити принаймні один із таких, щоб встановити Linux. для цього - необхідно вийти з "setup" і створити розділи, використовуючи "cfdisk" (для розділів MBR), або "cgdisk" (для розділів GPT). Щоб дізнатися більше, перегляньте файл довідки "setup" у наступному меню.

source: NO EFI SYSTEM PARTITION DETECTED
hi_in: कोई EFI सिस्टम विभाजन नहीं मिला
tr_tr: EFI SİSTEM BÖLÜMÜ TESPİT EDİLEMEDİ
uk_ua: СИСТЕМНОГО РОЗДІЛУ EFI НЕ ВИЯВЛЕНО

source: This machine appears to be using EFI/UEFI, but no EFI System Partition was found. You'll need to make an EFI System Partition in order to boot from the hard drive. To do this, leave 'setup', and use 'cgdisk' to make a 100MB partition of type EF00. For more information, read the 'setup' help file from the next menu.
hi_in: प्रतीत होता है कि मशीन द्वारा EFI/UEFI प्रयुक्त है, परन्तु कोई EFI सिस्टम विभाजन नहीं मिला। हार्ड ड्राइव से बूट करने हेतु आपको सिस्टम पर EFI विभाजन बनाना होगा। ऐसा करने के लिए 'सेटअप' बंद करें व 'cgdisk' उपयोग कर 100 एमबी का विभाजन बनाएँ जिसका प्रकार EF00 हो। अधिक सूचना हेतु भावी मेन्यू से 'सेटअप' सहायता फाइल पढ़ें।
uk_ua: Схоже - цей комп'ютер використовує EFI/UEFI, але Системний Розділ EFI не знайдено. Необхідно створити Системний Розділ EFI, щоб уможливити завантаження з жорсткого диска. Для цього - вийдіть із "setup", і створіть розділ типу EF00 розміром 100МБ, використовуючи "cgdisk". Щоб дізнатися більше, перегляньте файл довідки "setup" у наступному меню.

source: NO BIOS BOOT PARTITION DETECTED
hi_in: कोई BIOS बूट विभाजन नहीं मिला
uk_ua: ЗАВАНТАЖУВАЛЬНОГО РОЗДІЛУ BIOS НЕ ВИЯВЛЕНО

source: This machine booted in Legacy or BIOS mode, but no BIOS boot partition was found. You will need to make one in order to boot from the hard drive. To do this, leave 'setup' and use 'gdisk' or 'cgdisk' to make a partition of type BIOS boot and size 2MB.
hi_in: यह मशीन पारंपरिक या BIOS मोड में बूट की गई है परन्तु कोई BIOS बूट विभाजन उपस्थित नहीं है। हार्ड ड्राइव से बूट करने हेतु आपको एक ऐसे विभाजन का सृजन करना होगा। इस हेतु 'सेटअप' बंद कर 'gdisk' या 'cgdisk' द्वारा BIOS प्रकार व 2 एमबी आकार का विभाजन बनाएँ।
uk_ua: Цей комп'ютер завантажено в режимі Legacy або BIOS, але завантажувального розділу BIOS не знайдено. Необхідно його створити, щоб уможливити завантаження з жорсткого диска. Для цього - вийдіть із "setup", і створіть розділ типу BIOS boot розміром 2МБ, використовуючи "gdisk" або "cgdisk".

source: Can't umount /var/log/mount. Reboot machine and run setup again.
hi_in: /var/log/mount को माउंट से हटाना विफल। मशीन पुनः आरंभ कर सेटअप पुनः निष्पादित करें।
uk_ua: Не можливо демонтувати /var/log/mount. Перезавантажте комп'ютер, і запустіть setup ще раз.

source: Mount table corrupt. Reboot machine and run setup again.
hi_in: माउंट तालिका विकृत है। मशीन पुनः आरंभ कर सेटअप पुनः निष्पादित करें।
tr_tr: Bağlama tablosu bozulmuş. Makinayı yeniden başlatın ve kurulumu yeniden çalıştırın.
uk_ua: Таблицю монтування пошкоджено. Перезавантажте комп'ютер і запустіть setup ще раз.

source: Slint Linux Setup (version ${Version})
hi_in: स्लिंट लिनक्स सेटअप (संस्करण ${Version})
tr_tr: Slint Linux Kurulumu (version ${Version})
uk_ua: Встановлювач Slint Linux (версія ${Version})

source: Welcome to Slint Linux Setup. Select an option below using the UP/DOWN keys and SPACE or ENTER. Alternate keys may also be used: '+', '-', and TAB.
hi_in: स्लिंट लिनक्स सेटअप में स्वागत है। ऊपर/नीचे कुंजियों व स्पेस या एंटर कुंजी द्वारा निम्न में से एक विकल्प चुनें। वैकल्पिक रूप से '+', '-', व टैब कुंजी उपयोग करना भी स्वीकार्य है।
tr_tr: Slint Linux Kurulumuna Hoşgeldiniz. AŞAĞI/YUKARI tuşlarını ve BOŞLUK ya da ENTER tuşlarını kullanarak aşağıdan bir seçim yapınız. Alternatif tuşlar ayrıca kullanılabilir: '+', '-', ve TAB.
uk_ua: Вас вітає Встановлювач Slint Linux. Виберіть опцію з наведених нижче, використовуючи курсорні клавіші ВГОРУ та ВНИЗ, а також ПРОБІЛ або ЕНТЕР. Можливе використання альтернативних клавіш: "+", "-", а також ТАБ.

source: Read the Slint Setup HELP file
hi_in: स्लिंट सेटअप की सहायता फाइल पढ़ें
tr_tr: Slint Kurulum YARDIM dosyasını oku
uk_ua: Переглянути ДОВІДКУ з використання Встановлювача Slint

source: Remap your keyboard (other than $DefaultKeyMap)
hi_in: कुंजीपटल हेतु अन्य अभिन्यास चुनें ($DefaultKeyMap के स्थान पर)
uk_ua: Змінити розкладку клавіатури (використовується $DefaultKeyMap)

source: Set up your swap partition(s)
hi_in: अपने स्वैप विभाजन सेट करें
tr_tr: Takas alan(lar)ınızı ayarlayın
uk_ua: Налаштувати розділ(и) резервної пам'яті

source: Set up your target partitions
hi_in: अपने लक्षित विभाजन सेट करें
tr_tr: Hedef bölümlerinizi ayarlayın
uk_ua: Налаштувати цільові розділи

source: Select source media
hi_in: स्रोत मीडिया चुनें
tr_tr: Kaynak ortamı seçin
uk_ua: Вибрати носій-джерело

source: Install selected software
hi_in: चयनित सॉफ्टवेयर इंस्टॉल करें
tr_tr: Seçili yazılımı kur
uk_ua: Встановити вибране програмне забезпечення

source: Reconfigure your Linux system
hi_in: अपने लिनक्स सिस्टम को पुनः विन्यस्त करें
tr_tr: Linux sisteminizi yeniden yapılandırın
uk_ua: Налаштувати систему

source: Exit Slint Linux Setup
hi_in: स्लिंट लिनक्स सेटअप बंद करें
tr_tr: Slint Linux Kurulumundan Çık
uk_ua: Вийти зі Встановлювача Slint Linux

source: TARGET PARTITIONS ALREADY CONFIGURED
hi_in: लक्षित विभाजन पहले से विन्यस्त है
tr_tr: HEDEF BÖLÜMLERİ ZATEN YAPILANDIRILDI
uk_ua: ЦІЛЬОВІ РОЗДІЛИ ВЖЕ НАЛАШТОВАНО

source: You have already configured the target partitions, where the system will be installed. Press ENTER to return to the main menu.
hi_in: आप सिस्टम इंस्टॉल हेतु लक्षित विभाजन पहले से विन्यस्त कर चुके हैं। मुख्य मेन्यू पर वापस जाने हेतु एंटर दबाएँ।
tr_tr: Sistem kurulacağı hedef bölümleri önceden yapılandırdınız. Ana menüye dönmek için ENTER tuşuna basın.
uk_ua: Ви вже налаштували цільові розділи для встановлення системи. Натисніть ENTER, щоб повернутися до головного меню.

source: SOURCE OF PACKAGES ALREADY CHOSEN
hi_in: पैकेज हेतु स्रोत पहले से चयनित हैं
tr_tr: PAKETLERİN KAYNAĞI ZATEN SEÇİLMİŞ
uk_ua: ДЖЕРЕЛО ПАКУНКІВ ВЖЕ ВИБРАНО

source: You have already chosen the source of packages. Press ENTER to return to the main menu.
hi_in: आप पहले ही पैकेज के स्रोत का चयन कर चुके हैं। मुख्य मेन्यू पर वापस जाने हेतु एंटर दबाएँ।
tr_tr: Paketlerin kaynağını zaten seçmiştiniz. Ana menüye dönmek için ENTER tuşuna basın.
uk_ua: Ви вже вибрали джерело пакунків. Натисніть ENTER, щоб повернутися до головного меню.

source: SOURCE PACKAGES INAPPROPRIATE
hi_in: स्रोत पैकेज अनुचित हैं
tr_tr: KAYNAK PAKETLER UYGUNSUZ
uk_ua: НЕПРИЙНЯТНЕ ДЖЕРЕЛО ПАКУНКІВ

source: Either the source packages are inappropriate for the target system: Slint version $SLINTVERSION (${SFX}-bit) or the file $INSTALL_PATH/slint/DONOTREMOVEME.TXT is missing. Please try again to set the source of packages
hi_in: या तो इस लक्षित सिस्टम हेतु स्रोत पैकेज अनुचित हैं : स्लिंट संस्करण $SLINTVERSION (${SFX}-बिट) या फिर $INSTALL_PATH/slint/DONOTREMOVEME.TXT फाइल अनुपलब्ध है। कृपया पैकेज हेतु स्रोत को पुनः सेट करें
uk_ua: Джерело пакунків не відповідає поточній системі: Slint версія $SLINTVERSION (${SFX}-bit), або файл $INSTALL_PATH/slint/DONOTREMOVEME.TXT відсутній. Будь ласка, спробуйте вибрати носій-джерело пакунків ще раз

source: CANNOT INSTALL SOFTWARE YET
hi_in: अभी सॉफ्टवेयर इंस्टॉल करना संभव नहीं है
tr_tr: HENÜZ YAZILIM KURULAMAZ
uk_ua: НАРАЗІ НЕ МОЖЛИВО ВСТАНОВИТИ ПРОГРАМНЕ ЗАБЕЗПЕЧЕННЯ

source: Before you can install software, complete the following tasks: 1. Select your source media. 2. Set up your target Linux partition(s). You may also optionally remap your keyboard and set up your swap partition(s). Press ENTER to return to the main menu.
hi_in: सॉफ्टवेयर इंस्टॉल करने से पूर्व आपको निम्नलिखित कार्य पूर्ण करने होंगे : 1. स्रोत मीडिया का चयन। 2. लक्षित लिनक्स विभाजन सेट करना। कुंजीपटल अभिन्यास का पुनः चयन व स्वैप विभाजन सेट करने का विकल्प भी उपलब्ध है। मुख्य मेन्यू पर वापस जाने हेतु एंटर दबाएँ।
tr_tr: Yazılımı kurabilmeniz için önce şu işlemleri tamamlayın: 1. Kaynak ortamınızı seçin. 2. Hedef Linux bölümlerinizi ayarlayın. Ayrıca, isteğe bağlı olarak klavyenizi yeniden eşleştirebilir ve takas bölüm(ünüzü)lerinizi ayarlayabilirsiniz. Ana menüye dönmek için ENTER tuşuna basın.
uk_ua: Перш ніж встановлювати програмне забезпечення, необхідно виконати такі завдання: 1. Вибрати носій-джерело. 2. Налаштувати цільові розділи Linux. У разі потреби, ви можете змінити розкладку клавіатури, а також створити розділ(и) резервної пам'яті. Натисніть ENTER, щоб повернутися до головного меню.

source: READY TO INSTALL THE PACKAGES?
hi_in: क्या आप पैकेज इंस्टॉल करने हेतु तैयार हैं?
tr_tr: PAKETLERİ KURMAYA HAZIR MISINIZ?
uk_ua: ГОТОВІ ДО ВСТАНОВЛЕННЯ ПАКУНКІВ?

source: Please confirm that you want to install the packages.
hi_in: कृपया पुष्टि करें कि आप पैकेज इंस्टॉल करने के इच्छुक हैं।
tr_tr: Lütfen paketleri kurmak istediğinizi onaylayın.
uk_ua: Будь ласка, підтвердіть, що бажаєте встановити пакунки.

source: INSTALL KDE PACKAGES?
hi_in: केडीई पैकेज इंस्टॉल करें?
tr_tr: KDE PAKETLERİNİ KUR?
uk_ua: ВСТАНОВИТИ ПАКУНКИ KDE?

source: Do you want to install the KDE packages?
hi_in: क्या आप केडीई पैकेज इंस्टॉल करना चाहते हैं?
tr_tr: KDE paketlerini kurmak istiyor musunuz?
uk_ua: Бажаєте встановити пакунки KDE?

source: A one-line description will be displayed as each package is installed.
hi_in: पैकेज इंस्टॉल होने पर एक पंक्ति का विवरण प्रदर्शित होगा।
uk_ua: Показано однорядковий опис кожного встановлюваного пакунку.

source: SYSTEM NOT YET INSTALLED
hi_in: सिस्टम अभी इंस्टॉल नहीं हुआ है
tr_tr: SİSTEM HENÜZ KURULMADI
uk_ua: СИСТЕМУ ЩЕ НЕ ВСТАНОВЛЕНО

source: You need to install the packages before configuring the system. Please press ENTER to return to the main menu.
hi_in: सिस्टम विन्यस्त करने से पहले पैकेज इंस्टॉल करना आवश्यक है। मुख्य मेन्यू पर वापस जाने हेतु एंटर दबाएँ।
uk_ua: Перш ніж налаштовувати систему, необхідно встановити пакунки. Будь ласка, натисніть ENTER, щоб повернутися до головного меню.

source: REPLACE /etc/fstab?
hi_in: /etc/fstab बदलें?
tr_tr: /etc/fstab DEĞİŞTİRİLSİN Mİ?
uk_ua: ЗАМІНИТИ /etc/fstab?

source: You already have an /etc/fstab on your install partition. If you were just adding software, you should probably keep your old /etc/fstab. If you've changed your partitioning scheme, you should use the new /etc/fstab. Do you want to replace your old /etc/fstab with the new one?
hi_in: आपके इंस्टॉल विभाजन पर पहले से /etc/fstab है। यदि केवल सॉफ्टवेयर ही जोड़ना चाहते हैं तो अपने पुराने /etc/fstab का ही उपयोग जारी रखें। यदि आपने अपनी विभाजन तालिका में परिवर्तन किया है तो आपको नवीन /etc/fstab उपयोग करना चाहिए। क्या आप पुराने /etc/fstab को नवीन से बदलना चाहते हैं?
uk_ua: Ви вже маєте /etc/fstab на вашому розділі для встановлення. Якщо ви просто додали програмне забезпечення, тоді, ймовірно, варто залишити ваш старий /etc/fstab. Якщо ви змінили схему розділів, використовуйте новий /etc/fstab. Бажаєте замінити ваш старий /etc/fstab на новий?

source: Installing translations...
hi_in: सिस्टम हेतु अनुवाद फाइलें इंस्टॉल करना जारी...
tr_tr: Çeviriler kuruluyor...
uk_ua: Встановлення перекладів...

source: Slint Linux Setup is complete
hi_in: स्लिंट लिनक्स सेटअप प्रक्रिया पूर्ण
tr_tr: Slint Linux kurulumu tamamlandı
uk_ua: Встановлення Slint Linux завершено

source: Please remove the installation disc.
hi_in: कृपया इंस्टॉल डिस्क हटा लें।
tr_tr: Lütfen kurulum diskini çıkarınız.
uk_ua: Будь ласка, вийміть встановлювальний диск.

source: Would you like to reboot your system? If you choose No, you will be dropped to a shell.
hi_in: क्या आप अपने सिस्टम को पूर्ण आरंभ करना चाहते हैं? आपके द्वारा नहीं चुनने पर टर्मिनल शैल आरंभ होगा।
uk_ua: Бажаєте перезавантажити систему? Якщо ви оберете No, то потрапите до оболонки shell.

source: You may now reboot your system once you are ready. You can issue the 'reboot' command; or if your system has a keyboard attached, you can use the key combination: control+alt+delete
hi_in: अब आप अपनी इच्छानुसार सिस्टम को पुनः आरंभ कर सकते हैं। इस हेतु आप 'reboot' कमांड निष्पादित करें या सिस्टम के साथ कुंजीपटल संलग्न होने पर Ctrl+Alt+Del शॉर्टकट उपयोग करें।
uk_ua: Коли будете готові - можете перезавантажити систему. Ви можете ввести команду "reboot"; або якщо у вашій системі підключена клавіатура, скористатися сполученням клавіш: control+alt+delete

source: ** Starting reboot **
hi_in: ** पुनः आरंभ जारी **
uk_ua: ** Початок перезавантаження **
