Repository: DidierSpaier/slint-translations
Catalog: news/*.news.po
Languages: de_de, fr_fr, it_it, nl_nl

source: If the machine booted the installer in EFI mode GRUB is also installed in Legacy mode unless the root partition be in a drive with a GUID partition table (GPT) but with no BIOS boot partition.
de_de: Wenn der Rechner den Installer im EFI-Modus gebootet hat, ist GRUB auch im Legacy-Modus installiert, es sei denn, die Root-Partition befindet sich auf einem Laufwerk mit einer GUID-Partitionstabelle (GPT) ohne BIOS-Boot-Partition.
fr_fr: Si la machine a démarré l'installateur en mode EFI GRUB est également installé en mode Legacy à moins que la partition racine ne soit dans un disque avec une table de partition GUID (GPT) mais sans partition de démarrage du BIOS.
it_it: Se la macchina ha avviato l'installatore in modalità EFI, anche GRUB è installato in modalità Ereditaria, a meno che la partizione di root non si trovi su un'unità con una tabella di partizione GUID (GPT), ma senza alcuna partizione d'avvio BIOS.
nl_nl: Als de machine het installatieprogramma heeft opgestart in de EFI-modus, wordt GRUB ook geïnstalleerd in Legacy-modus, tenzij de rootpartitie een station heeft met een GUID-partitietabel (GPT) maar zonder BIOS-opstartpartitie.

source: Thus, in most cases the installed system will be able to boot in both EFI and Legacy modes in manual as in auto partitioning modes.
de_de: In den meisten Fällen wird das installierte System in der Lage sein, sowohl im EFI- als auch im Legacy-Modus manuell zu booten, wie im automatischen Partitionierungsmodus.
fr_fr: Ainsi, dans la plupart des cas, le système installé pourra s'amorcer à la fois dans les modes EFI et Legacy, comme dans le mode de partitionnement automatique.
it_it: Dunque, in gran parte dei casi, il sistema installato potrà avviarsi sia in modalità EFI che Ereditaria, nelle modalità di partizionamento automatiche.
nl_nl: Hierdoor zal het geïnstalleerde systeem meestal kunnen opstarten in zowel EFI- als Legacy-modus bij handmatig en automatisch partitioneren.

source: 10 May 2023: A new Slint ISO is available
de_de: 10. Mai 2023: Eine neue Slint ISO ist verfügbar
fr_fr: 10 mai 2023 : Une nouvelle ISO Slint est disponible
it_it: 10 Maggio 2023: Un nuovo ISO di Slint è disponibile
nl_nl: 10 mei 2023: Er is een nieuwe Slint ISO beschikbaar

source: The lightweight i3 desktop is added as well as the I38 utility which make it fully accessible with a screen reader, just running the i38 command after installation, thanks to Storm Dragon.
de_de: Der leichtgewichtige i3-Desktop sowie das I38-Dienstprogramm, das es mit einem Bildschirmleser vollständig barrierefrei macht, werden hinzugefügt nur den i38 Befehl nach der Installation ausführen, dank Storm Dragon.
fr_fr: Le bureau i3 léger est ajouté ainsi que l'utilitaire I38 qui le rend entièrement accessible avec un lecteur d'écran, juste en exécutant la commande i38 après l'installation, merci à Storm Dragon.
it_it: Il desktop i3 leggero è aggiunto, insieme all'utilità I38, che lo rende interamente accessibile con un lettore dello schermo, semplicemente eseguendo il comando i38 dopo l'installazione, grazia a Storm Dragon.
nl_nl: De lichtgewicht i3 desktop is toegevoegd naast de I38 utility die deze volledig toegankelijk maakt met een schermleesprogramma door slechts het uitvoeren van het i38 commando na installatie, met dank aan Storm Dragon.

source: The repository https://slackware.uk/salix/x86_64/xfce4.18-15.0/[xfce4.18-15.0] is enabled by default, allowing to install a fully configured and featured xfce-4.18 desktop just typing `+slapt-get --install-set xfce+`, thanks to George Vlahavas.
de_de: Das Repository https://slackware.uk/salix/x86_64/xfce4.18-15.0/[xfce4.18-15.0] ist standardmäßig aktiviert, wodurch ein vollständig konfiguriertes und funktionierendes xfce-4.18 installiert werden kann. Schreiben Sie einfach `+slapt-get --install-set xfce+`, dank George Vlahavas.
fr_fr: Le dépôt https://slackware.uk/salix/x86_64/xfce4.18-15.0/[xfce4.18-15.0] est activé par défaut, permettant d'installer un bureau xfce-4.18 entièrement configuré en tapant simplement `+slapt-get --install-set xfce+`, merci à George Vlahavas.
it_it: La repository https://slackware.uk/salix/x86_64/xfce4.18-15.0/[xfce4.18-15.0] è abilitata di default, consentendo l'installazione di un desktop xfce-4.18 configurato e completo, semplicemente digitando `+slapt-get --install-set xfce+`, grazie a George Vlahavas.
nl_nl: De repository https://slackware.uk/salix/x86_64/xfce4.18-15.0/[xfce4.18-15.0] is standaard ingesteld, waardoor een complete voorgeconfigureerde xfce-4.18 desktop kan worden geinstalleerd met de opdracht ` + slapt-get-get-install-set xfce + `, dit met dank aan George Vlahavas.

source: In `manual` partitioning mode it is no more required to include a BIOS Boot partition in a GUID partition table (GPT) if the machine booted in EFI mode, nor an EFI System partition if the machine booted in Legacy mode.
de_de: Im `manual`-Partitionierungsmodus ist es nicht mehr erforderlich, eine BIOS-Boot-Partition in eine GUID-Partitionstabelle (GPT) einzubinden, wenn die Maschine im EFI-Modus gebootet wird, noch eine EFI-Systempartition wenn die Maschine im Legacy-Modus gebootet wurde.
fr_fr: En mode de partitionnement manuel, il n'est plus nécessaire d'inclure une partition de démarrage du BIOS dans une table de partition GUID (GPT) si la machine a démarré en mode EFI ni une partition EFI si la machine a démarré en mode Legacy.
it_it: Nella modalità di partizionamento `manuale`, non è più necessario includere una partizione d'Avvio BIOS in una tabella di partizione GUID (GPT), se la macchina è avviata in modalità EFI, né di una partizione di Sistema EFI se la macchina è avviata in modalità Ereditaria.
nl_nl: Bij 'handmatig' partitioneren is het niet meer nodig om een BIOS-opstartpartitie op te nemen in een GUID-partitietabel (GPT) als de machine wordt opgestart in EFI-modus of een EFI-systeempartitie als de machine wordt opgestart in Legacy-modus.

source: In `auto` partitioning mode it is now allowed to put the /home directory in dedicated partition, only if it is in another drive than the one hosting the main partition mounted as /.
de_de: Im `auto` Partitionierungsmodus ist es nun nur dann erlaubt das /home Verzeichnis in dedizierte Partition zu platzieren, wenn sie auf einem anderen Laufwerk als dem mit der Haupt-Partition als / liegt.
fr_fr: En mode de partitionnement automatique, il est maintenant permis de mettre le répertoire /home dans une partition dédiée, seulement si elle est dans un autre périphérique que celui qui héberge la partition principale montée comme /.
it_it: In modalità di partizionamento `automatica`, non è consentito inserire la cartella /home nella partizione dedicata, soltanto se è in un'altra unità, rispetto a quella che ospita la partizione principale, montata come /.
nl_nl: Bij `automatisch` partitioneren is het nu toegestaan om de /home directory een eigen partitie te geven, maar alleen als dit een ander station is dan waarop de hoofdpartitie staat aangekoppeld op /.

source: The user is allowed to select an existing partition for /home, possibly to continue using an existing one.
de_de: Der Benutzer darf eine vorhandene Partition für /home auswählen, um sie weiterhin verwenden zu können.
fr_fr: L'utilisateur est autorisé à sélectionner une partition existante pour /home, éventuellement pour continuer à utiliser une partition existante.
it_it: L'utente può selezionare una partizione esistente per /home, possibilmente per continuare a utilizzare una esistente.
nl_nl: De gebruiker kan een bestaande partitie te selecteren voor /home zodat een al bestaande partitie kan worden hergebruikt.

source: If /home is in an already formatted partition (in case the user wants to continue using an existing one), the installer will offer to keep its content or re-format it, as with any other linux partition except the main one mounted as /.
de_de: Wenn /home in einer bereits formatierten Partition ist (falls der Benutzer eine existierende verwenden möchte), wird der Installer anbieten, deren Inhalt beizubehalten oder sie neu zu formatieren, wie bei jeder anderen Linux-Partition außer der Hauptpartition, eingehängt als /.
fr_fr: Si /home est dans une partition déjà formatée (si l'utilisateur veut continuer à utiliser une partition existante), le programme d'installation proposera de conserver son contenu ou la re-formater, comme avec n'importe quelle autre partition Linux sauf la partition principale montée comme /.
it_it: Se /home è in una partizione già formattata (nel caso in cui l'utente desideri continuare a utilizzarne una esistente), l'installatore offrirà di mantenerne i contenuti o di riformattarla, come con qualsiasi altra partizione di Linux, tranne la principale, montata come /.
nl_nl: Als /home op een al geformatteerde partitie staat (in het geval dat de gebruiker wil doorgaan met het gebruik van een bestaande partitie), biedt het installatieprogramma de keuze de inhoud ervan te behouden of opnieuw te formatteren, zoals bij elke andere linux partitie, behalve de hoofdpartitie aangekoppeld op /.

source: All main desktops (MATE, LXQt, Xfce) as the lightDM greeting screen have the same background "clouds in a blue sky".
de_de: Alle Hauptdesktops (MATE, LXQt, Xfce) sowie der LightDM Begrüßungsbildschirm haben den gleichen Hintergrund "Wolken in einem blauen Himmel".
fr_fr: Tous les bureaux principaux (MATE, LXQt, Xfce) comme écran d'accueil de phare ont le même fond d'écran "nuages dans un ciel bleu".
it_it: Tutti i desktop principali (MATE, LXQt, Xfce), come lo schermo di saluto lightDM, hanno lo stesso sfondo "nuvole su cielo blu".
nl_nl: Alle hoofd desktops (MATE, LXQt en XFCE) hebben hetzelfde lightDM 'clouds in a blue sky' welkomstscherm.

source: A lot of packages have been added, upgraded or fixed since the release of the previous ISO, some of the added ones included in the ISO,among which: compsize, confuse, fim, gpart, nushell, Qogir-icon-theme, qogir-theme, salix-xfwm4-theme, rust, testdisk, others available in the /extra repository: calibre, emacs-nativecomp, libgccjit, notmuch, soft.
de_de: Viele Pakete wurden seit der Veröffentlichung der vorherigen ISO hinzugefügt, aktualisiert oder behoben. Einige sind in der ISO-Datei enthalten, unter anderem: compsize, confuse, fim, gpart, nushell, Qogir-icon-theme, qogir-theme, salix-xfwm4-theme, rust, testdisk, weitere sind im /extra Repository verfügbar: calibre, emacs-nativecomp, libgccjit, notmuch, soft.
fr_fr: Beaucoup de paquets ont été ajoutés, mis à jour ou corrigés depuis la publication de l'ISO précédente, certains des ajouts sont inclus dans l'ISO,parmi lesquels : compsize, confuse, fim, gpart, nushell, Qogir-icon-theme, qogir-theme, salix-xfwm4-theme, rust, testdisk, d'autres siont disponibles dans le répertoire /extra : calibre, emacs-nativecomp, libgccjit, notmuch, soft.
it_it: Sono stati aggiunti, aggiornati o corretti molti pacchetti dall'uscita della ISO precedente, alcuni di quelli aggiunti sono stati inclusi nell'ISO, tra cui: compsize, confuse, fim, gpart, nushell, Qogir-icon-theme, qogir-theme, salix-xfwm4-theme, rust, testdisk; altri sono disponibili nella repository /extra: calibre, emacs-nativecomp, libgccjit, notmuch, soft.
nl_nl: Er zijn veel pakketten toegevoegd, geüpgraded en bugs opgelost sinds de publicatie van de vorige ISO, waaronder die al in de ISO zijn opgenomen: compsie, verwarring, fim, gpart nushell, Qogir-icon-theme, qogir-theme, salix-xfwwm4-theme, rost, testdisk en andere beschikbaar in de /extra repository: calibre, emacs-nativecomp, libgccjit, niets, soft.

source: The boot menu of the installed system include a menu entry to access the firmware's setup in EFI mode.
de_de: Das Boot-Menü des installierten Systems enthält einen Menüeintrag zum Zugriff auf die Firmware-Konfiguration im EFI-Modus.
fr_fr: Le menu de démarrage du système installé comprend une entrée de menu pour accéder à la configuration du firmware en mode EFI.
it_it: Il menu d'avvio del sistema installato include una voce principale per accedere alla configurazione del firmware in modalità EFI.
nl_nl: Het opstartmenu van het geïnstalleerde systeem bevat nu een menuoptie voor EFI-modus instellingen.

source: If GRUB is installed it is now possible to boot the installation ISO stored in an internal disk's partition: no need to write this ISO on a DVD or USB stick in this case. To do so, edit the file /etc/grub.d/40_custom so it contains:
de_de: Wenn GRUB installiert ist, ist es nun möglich, die auf einer internen Partition gespeicherte Installations-ISO-Datei zu booten: In diesem Fall ist es nicht nötig, diese ISO auf eine DVD oder einen USB-Stick zu schreiben. Bearbeiten Sie dazu die Datei /etc/grub.d/40_custom so dass sie Folgendes enthält:
fr_fr: Si GRUB est installé, il est maintenant possible de démarrer l'ISO d'installation stockée dans une partition interne du disque : pas besoin d'écrire cette ISO sur un DVD ou une clé USB dans ce cas. Pour ce faire, éditez le fichier /etc/grub.d/40_custom pour qu'il contienne :
it_it: Se GRUP è installato, è ora possibile avviare l'ISO di installazione memorizzata nella partizione di un disco interno: non è necessario scrivere questo ISO su un DVD o una chiavetta USB, in questo caso. Per farlo, modifica il file /etc/grub.d/40_custom, così che contenga:
nl_nl: Als GRUB is geïnstalleerd, is het nu mogelijk om de installatie ISO op een interne schijfpartitie opgeslagen op te starten: de ISO hoeft in dit geval niet meer naar een DVD of USB stick te worden geschreven. Hiervoor dient het bestand /etc/grub.d/40_custom op de volgende manier te worden aangepast:

source: #!/bin/sh exec tail -n +3 $0 # This file provides an easy way to add custom menu entries. Simply type the # menu entries you want to add after this comment. Be careful not to change # the 'exec tail' line above. menuentry 'Slint ISO 15.0-3' { insmod part_gpt insmod part_msdos search --no-floppy --fs-uuid --set=root <UUID> set isofile='slint64-15.0-3.iso' loopback loop /repo/x86_64/slint-15.0/iso/$isofile linux (loop)/linux quiet vga=normal load_ramdisk=1 prompt_ramdisk=0 ro printk.time=0 initrd (loop)/initrd }
de_de: #!/bin/sh exec tail -n +3 $0 # Diese Datei bietet eine einfache Möglichkeit, eigene Menüeinträge hinzuzufügen. Geben Sie einfach die Menüeinträge # ein, die Sie nach diesem Kommentar hinzufügen möchten. # die 'exec tail' Zeile oben nicht ändern. menuentry 'Slint ISO 15.0-3' { insmod part_gpt insmod part_msdos search --no-floppy --fs-uuid --set=root <UUID> set isofile='slint64-15.0-3.iso' loopback loop /repo/x86_64/slint-15.0/iso/$isofile linux (loop)/linux quiet vga=normal load_ramdisk=1 prompt_ramdisk=0 ro printk. ime=0 initrd (loop)/initrd }
it_it: #!/bin/sh exec tail -n +3 $0 # Questo file fornisce un metodo facile per aggiungere voci del menu personalizzate. Basta digitare le # voci del menu che desideri aggiungere dopo questo commento. Fai attenzione a non modificare # la riga 'exec tail' precedente. menuentry 'Slint ISO 15.0-3' { insmod part_gpt insmod part_msdos search --no-floppy --fs-uuid --set=root <UUID> set isofile='slint64-15.0-3.iso' loopback loop /repo/x86_64/slint-15.0/iso/$isofile linux (loop)/linux quiet vga=normal load_ramdisk=1 prompt_ramdisk=0 ro printk.time=0 initrd (loop)/initrd }

source: Just replace <UUID> by the UUID of the partition where the ISO is stored. For instance if the ISO is in /dev/sda3, this command will output this UUID: `lsblk -lno uuid /dev/sda3`. Also replace `/repo/x86_64/slint-15.0/iso/` by the path to the ISO file. After that, run grub-mkconfig or update-grub so that this boot entry be included in grub.cfg. The installer will tell you it can't find the ISO and how to mount it if it is in an internal disk's partition.
de_de: Ersetzen Sie einfach <UUID> durch die UUID der Partition, auf der die ISO-Datei gespeichert wird. Wenn zum Beispiel die ISO-Datei in /dev/sda3 ist, gibt dieser Befehl die UUID aus: `lsblk -lno uuid /dev/sda3`. Ersetzen Sie auch `/repo/x86_64/slint-15.0/iso/` vom Pfad zur ISO-Datei. Danach führen Sie grub-mkconfig oder update-grub aus, damit dieser Booteintrag in grub.cfg enthalten ist. Der Installer wird Ihnen mitteilen, dass er die ISO-Datei nicht finden kann und wie sie gemountet werden kann, wenn sie sich auf einer internen Partition befindet.
fr_fr: Il suffit de remplacer <UUID> par l'UUID de la partition où l'ISO est stockée. Par exemple, si l'ISO est dans /dev/sda3, cette commande va générer cet UUID: ` lsblk -lno uuid /dev/sda3 `. Remplacer également `/repo/x86_64/slint-15.0/iso/ ` par le chemin d'accès au fichier ISO. Ensuite, exécutez grub-mkconfig ou update-grub pour que cette entrée d'amorçage soit incluse dans grub.cfg. Le programme d'installation vous dira qu'il ne trouve pas l'ISO et comment le monter si elle se trouve sur une partition d'un disque interne.
it_it: Basta sostituire <UUID> con l'UUID della partizione dove è memorizzato l'ISO. Ad esempio, se l'ISO si trova in /dev/sda3, questo comando produrrà questo UUID: `lsblk -lno uuid /dev/sda3`. Inoltre, sostituisce `/repo/x86_64/slint-15.0/iso/` con il percorso al file ISO. Dopodiché, esegui grub-mkconfig o update-grub così che questa voce d'avvio sia inclusa in grub.cfg. L'installatore di dirà che non riesce a trovare l'ISO e come montarla, se si trova in una partizione del disco interna.
nl_nl: Vervang <UUID> door het UUID van de partitie waarop de ISO is opgeslagen. Als de ISO bijvoorbeeld op /dev/sda3 staat, zal deze opdracht dit UUID uitvoeren: `lsblk -lno uuid /dev/sda3`. Vervang ook `/repo/x86_64/slint-15.0/iso/ ` door het pad naar het ISO-bestand. Voer daarna grub-mkconfig of update-grub uit zodat deze boot entry in grub.cfg wordt opgenomen. Het installatieprogramma zal aangeven de ISO niet te kunnen vinden en hoe die aan te koppelen als deze op een interne schijfpartitie staat.

source: Pictures of lightDM and the main desktops in Slint
de_de: Bilder von lightDM und den wichtigsten Desktops in Slint
fr_fr: Images de lightDM et des principaux bureaux de Slint
it_it: Immagini di lightDM e i desktop principali su Slint
nl_nl: Afbeeldingen van lightDM en de belangrijkste desktops in Slint

source: XFCE (installed on demand)
de_de: XFCE (bei Bedarf installiert)
fr_fr: XFCE (installé sur demande)
it_it: XFCE (installato su richiesta)
nl_nl: XFCE (indien gewenst)
