Repository: DidierSpaier/slint-translations
Catalog: news/*.news.po
Languages: de_de, fr_fr, it_it, nl_nl

source: News
de_de: Nachrichten
fr_fr: Nouvelles
it_it: Novità
nl_nl: Nieuws

source: 20 June 2024: Updates preparing the release of a new ISO
de_de: 20. Juni 2024: Updates, die die Veröffentlichung einer neuen ISO vorbereiten
fr_fr: 20 Juin 2024: Mises à jour préparant la sortie d'une nouvelle ISO

source: The batch of updates available today paves the way for a new ISO that will, beyond these updates and a few fixes of the installer, provide only one desktop: MATE.
de_de: Der Stapel von heute verfügbaren Updates ebnet den Weg für eine neue ISO, das Abgesehen von diesen Updates und ein paar Korrekturen des Installers nur einen Desktop bieten wird: MATE.
fr_fr: Le lot de mises à jour disponibles aujourd'hui ouvre la voie à une nouvelle ISO qui, au-delà de ces mises à jour et quelques correctifs du programme d'installation, ne fournira qu'un seul bureau : MATE.

source: Other desktops will be available, either provided in other ISOs, or installable as packages sets provided by contributors, at least the XFCE and LXQt desktops.
de_de: Andere Desktops werden verfügbar sein, entweder in anderen ISOs, oder installierbar als Pakete, die von Mitwirkenden bereitgestellt werden, zumindest auf dem XFCE und LXQt Desktop.
fr_fr: D'autres ordinateurs de bureau seront disponibles, soit fournis dans d'autres ISOs, soit installables en tant que paquets fournis par les contributeurs, au moins les bureaux XFCE et LXQt.

source: The current batch of updates provides mainly:
de_de: Der aktuelle Stapel von Updates bietet hauptsächlich:
fr_fr: Le lot de mises à jour actuel fournit principalement :

source: New versions of the MATE and LXQt desktops
de_de: Neue Versionen der MATE und LXQt Desktops
fr_fr: De nouvelles versions des bureaux MATE et LXQt

source: An enhancement of the visual appearance of the MATE desktop, huge thanks to miss Tell for her many hints and suggestions!
de_de: Eine Erweiterung des visuellen Erscheinens des MATE Desktops. Einen riesigen Dank an Miss Tell für ihre vielen Tipps und Anregungen!
fr_fr: Une amélioration de l'apparence visuelle du bureau MATE, un grand merci à Tell pour ses nombreuses suggestions et astuces !

source: An upgrade of several a11y applications to their latest stable versions
de_de: Ein Upgrade von mehreren a11y Anwendungen auf ihre neuesten stabilen Versionen
fr_fr: Une mise à niveau de plusieurs applications a11y vers leurs dernières versions stables

source: New and upraded packages in the main repository, /testing or /extra.
de_de: Neue und hochgeladene Pakete im Haupt-Repository, /testing oder /extra.
fr_fr: Des paquets nouveaux et modernisés dans le dépôt principal, /testing ou /extra.

source: The changes are detailed in the https://slackware.uk/slint/x86_64/slint-15.0/ChangeLog.txt[Changelog]
de_de: Die Änderungen werden detailliert in der https://slackware.uk/slint/x86_64/slint-15.0/ChangeLog.txt[Changelog] beschrieben.
fr_fr: Les modifications sont détaillées dans le https://slackware.uk/slint/x86_64/slint-15.0/ChangeLog.txt[Changelog]

source: Before listing the major ones, here is how to make existing desktops look as if they had been installed after the upgrade.
de_de: Bevor wir die wichtigsten auflisten, beschreiben wir, wie sich bestehende Desktops so aussehen lassen, als ob sie nach dem Upgrade installiert worden wären.
fr_fr: Avant d'énumérer les principaux, voici comment faire pour que les bureaux existants soient installés après la mise à niveau.

source: If you want to re-configure MATE to get its new appearance for a given user, just type as this user: `dconf reset -f /`
de_de: Wenn Sie MATE neu konfigurieren möchten, um sein neues Aussehen für einen bestimmten Benutzer zu erhalten, geben Sie einfach als dieser Benutzer in einem Terminal, auf Kommandozeile oder im Ausführen-Dialogfenster ein: `dconf reset -f /`
fr_fr: Si vous voulez reconfigurer MATE pour obtenir sa nouvelle apparence pour un utilisateur donné, tapez simplement comme cet utilisateur : `dconf reset -f /`

source: Be aware that this will override the customization that you'd have previously done at the user level!
de_de: Seien Sie sich bewusst, dass dies die Anpassung, die Sie zuvor auf Benutzerebene vorgenommen haben, überschreibt!
fr_fr: Sachez que cela remplacera la personnalisation que vous auriez précédemment effectuée au niveau utilisateur !

source: If you want to reconfigure LXQt to get its new appearance for a given user, you need to first get out of LXQt. Either type as root `login-chooser text` then reboot, or log in another desktop like MATE. Then type as regular user:
de_de: Wenn Sie LXQt neu konfigurieren wollen, um sein neues Aussehen für einen bestimmten Benutzer zu erhalten, müssen Sie sich zuerst aus LXQt abmelden. Geben Sie entweder als Root `login-chooser text` ein und starten Sie dann neu, oder melden Sie sich mit einem anderen Desktop wie MATE an. Geben Sie dann als regulärer Benutzer ein:
fr_fr: Si vous voulez reconfigurer LXQt pour obtenir sa nouvelle apparence pour un utilisateur donné, vous devez d'abord sortir de LXQt. Tapez `login-chooser text` puis redémarrez ou connectez vous à un autre bureau comme MATE. Tapez ensuite en tant qu'utilisateur normal :

source: Again, be aware that this will override the customization that you'd have previously done at the user level!
de_de: Beachten Sie nochmals, dass dies die Anpassung, die Sie zuvor auf der Benutzerebene vorgenommen haben, überschreibt!
fr_fr: Encore une fois, soyez conscient que cela remplacera la personnalisation que vous auriez déjà effectuée au niveau de l'utilisateur !

source: The MATE desktop and the graphical login manager
de_de: Der MATE-Desktop und der grafische Login-Manager
fr_fr: Le bureau MATE et le gestionnaire de connexion graphique

source: The Mate Control Center is customized for Slint.
de_de: Das Mate Control Center ist für Slint angepasst.
fr_fr: Le centre de contrôle du Mate est personnalisé pour Slint.

source: The Mate tweak application is customized for Slint. It includes several layouts of the panels, including Slint-legacy (the previous layout) and Slint (the new one).
de_de: Die Mate Optimierungsanwendung ist für Slint angepasst. Sie enthält mehrere Layouts der Paneele, einschließlich Slint-Legacy (das vorherige Layout) und Slint (das neue Layout).
fr_fr: L'application Mate tweak est personnalisée pour Slint. Elle comprend plusieurs agencements des panneaux, y compris Slint-legacy (la mise en page précédente) et Slint (la nouvelle).

source: The Slint layout provides a single panel including a Brisk menu giving a direct access to several utilities. 3 other menus are available: Advanced, Classic (the default for Slint-legacy) and Compact. In the Slint layout pressing alt-f1 now raises the Compact menu with a single column. In the Slint-legacy layout pressing alt-F1 still raises the Classical menu.
de_de: Das Slint-Layout bietet ein einzelnes Panel mit einem Brisk Menü, das einen direkten Zugriff auf verschiedene Hilfsprogramme ermöglicht. 3 weitere Menüs stehen zur Verfügung: Advanced, Classic (Standard für Slint-Legacy) und Compact. Mit dem Betätigen von Alt-F1 wird nun das Kompaktmenü mit einer einzigen Spalte aufgerufen. Im Slint-Legacy-Layout wird durch das drücken von Alt-F1 noch das klassische Menü geöffnet.
fr_fr: L'agencement Slint fournit un seul panneau comprenant un menu Brisk donnant un accès direct à plusieurs utilitaires. 3 autres menus sont disponibles: Advanced, Classic (la valeur par défaut pour Slint-legacy) et Compact. Dans la mise en page Slint, appuyez sur alt-f1 pour afficher le menu Compact avec une seule colonne. Dans la mise en page Slint-legacy, alt-F1 affiche toujours le menu Classical.

source: The Brisk menu includes at the bottom links to the Slint documentation and mate-tweak and a Favorite area, with by default the Caja file manager, the Mate terminal, Firefox, Thuderbird and the Mate Control Center
de_de: Das Brisk Menü enthält am unteren Rand Links zu der Slint-Dokumentation und mate-tweak und einem Favoriten Bereich, standardmäßig mit dem Caja Dateimanager, dem Mate Terminal, Firefox, Thuderbird und dem Mate Control Center
fr_fr: Le menu Brisk inclut en bas des liens vers la documentation Slint et mate-tweak et une zone de favoris, avec le gestionnaire de fichiers Caja, le terminal Mate, Firefox, Thuderbird et le centre de contrôle Mate

source: The default window manager for Mate is now Compiz whith an Emerald theme that can be changed using the custom script switch-emerald-theme. But Marco is still available. The change can be made in mate-tweak. In addition to the CCSM (compiz-config-settings-manager), simple-ccsm is provided in /extra.
de_de: Der Standard-Fenstermanager für Mate ist nun Compiz mit einem Emerald theme, das mit dem benutzerdefinierten Skript switch-emerald-theme geändert werden kann. Aber Marco ist immer noch verfügbar und lässt sich mit mate-tweak aktivieren. Zusätzlich zum CCSM (compiz-config-settings-manager) steht simple-ccsm in /extra zu Verfügung.
fr_fr: Le gestionnaire de fenêtres par défaut pour Mate est maintenant Compiz alors un thème Emerald qui peut être modifié en utilisant le script personnalisé switch-emerald-theme. Mais Marco est toujours disponible. Le changement peut être fait en mate-tweak. En plus du CCSM (compiz-config-settings-manager), simple-ccsm est fourni en /extra.

source: The lightdm-gtk-greeter is replaced by the lightdm-slick-greeter.
de_de: Der lightdm-gtk-greeter wird durch den lightdm-slick-greeter ersetzt.
fr_fr: Le greeter lightdm-gtk-greeter est remplacé par le greeter lightdm-slick.

source: The file /usr/share/glib-2.0/schemas/10.slint-appearance.gschema.override gathers customization of the Mate desktop and some other ones at the distribution level.
de_de: Die Datei /usr/share/glib-2.0/schemas/10.slint-appearance.gschema.override sammelt die Anpassung des Mate Desktop und einiger anderer auf der Distributionsebene.
fr_fr: Le fichier /usr/share/glib-2.0/schemas/10.slint-appearance.gschema.override rassemble la personnalisation du bureau Mate et d'autres au niveau distribution.

source: The LXQt desktop
de_de: Der LXQt-Desktop
fr_fr: Le bureau LXQt

source: This desktop is provided running build scripts provided by Frank Honolka aka snuk, and stored in the lxqt sub-directory, thanks Frank!
de_de: Dieser Desktop wird mit Build-Skripten von Frank Honolka aka snuk zur Verfügung gestellt und im lxqt-Unterverzeichnis gespeichert, dank Frank!
fr_fr: Ce bureau est fourni avec des scripts de compilation fournis par Frank Honolka aka snuk, et stockés dans le sous-répertoire lxqt, merci Frank!

source: This includes the desktop itself and associated applications.
de_de: Dies schließt den Desktop selbst und die zugehörigen Anwendungen ein.
fr_fr: Cela inclut le bureau lui-même et les applications associées.

source: As for Mate the default window manager is compiz and the decorator emerald but openbox is also available. The window manager can be changed from the menu or typing `lxqt-config-session`
de_de: Wie für Mate ist der Standard-Fenstermanager compiz und der Dekorator emerald, aber Openbox ist auch verfügbar. Der Fenstermanager kann aus dem Menü geändert werden oder `lxqt-config-session` eingeben
fr_fr: Comme pour Mate le gestionnaire de fenêtres par défaut est compiz et le décorateur emerald mais openbox est également disponible. Le gestionnaire de fenêtres peut être modifié à partir du menu ou en tapant ` lxqt-config-session `

source: Other upgrades and new software provided, sorted by category
de_de: Andere Upgrades und neue Software, die bereitgestellt wird, sortiert nach Kategorie
fr_fr: Autres mises à niveau et nouveaux logiciels fournis, classés par catégorie

source: Acessibility: at-spi2-core, orca, emacspeak, fenrir, liblouis, liblouisutdml and lios are upgraded.
de_de: Barrierefreiheit: at-spi2-core, orca, emacspeak, fenrir, liblouis, liblouisutdml und lios wurden aktualisiert.
fr_fr: Acessibility: at-spi2-core, orca, emacspeak, fenrir, liblouis, liblouisutdml et lios sont mis à jour.

source: Audio/video: vlc, mpv and yt-dlp are upgraded.
de_de: Audio/Video: vlc, mpv und yt-dlp wurden aktualisiert.
fr_fr: Audio/video: vlc, mpv et yt-dlp sont mis à jour.

source: The semantic application launchers cerebro, synapse and ulauncher are provided in /testing. A short presentation of them can be found for instance in https://www.debugpoint.com/top-ubuntu-launcher-2022/ and https://softwarelibre166246735.wordpress.com/2020/06/18/10-best-application-launchers-for-linux-desktops/. These launchers allow to start applications but also to find files in your system, do calculations or search the web, for instance, often through plugs-ins.
de_de: Die semantischen Anwendungs-Launcher cerebro, Synapse und Ulauncher wurden in /testing bereitgestellt. Eine kurze Präsentation davon finden Sie unter https://www.debugpoint.com/top-ubuntu-launcher-2022/ und https://softwarelibre166246735.wordpress.com/2020/06/18/10-best-application-launchers-for-linux-desktops/. Diese Launcher erlauben es, Anwendungen zu starten, aber auch Dateien in Ihrem System zu finden, Berechnungen durchzuführen oder im Web zu durchsuchen, zum Beispiel, oft über Plug-Ins.
fr_fr: Les lanceurs d'applications sémantiques cerebro, synapse et ulauncher sont fournis dans /testing. Une brève présentation peut être trouvée par exemple sur https://www.debugpoint.com/top-ubuntu-launcher-2022/ et https://softwarelibre166246735. ordpress.com/2020/06/18/10-best application-launchers-for-linux-desktops/. Ces lanceurs permettent de démarrer des applications mais aussi de trouver des fichiers dans votre système, d'effectuer des calculs ou de rechercher sur le web par exemple, souvent à travers des plug-ins.

source: Visual appearance: many themes are added or upgraded: Qogir-icon-theme, emerald-themes (the "overglossed" theme of the emerald decorator is associated with the Compiz window manager), kvantum-theme-qogir, breeze-blue-cursor-theme and breeze-icons for LXQt, papirus-icon-theme, yaru-gtk-theme. Newaita-reborn, posy-cursors and Tela-icon-theme are also available in /testing. Conversely, mate-colors-icon-teme, mate-backgrounds and murrine-themes are removed. Several desktop backgrounds or wallpapers are added.
de_de: Visuelles Aussehen: viele Themen wurden hinzugefügt oder aktualisiert: Qogir-Icon-Theme, Smaragd-Themes (das "overglossed" Thema des emerald dekorators ist mit dem Compiz-Fenstermanager assoziiert), kvantum-theme-qogir, breeze-blue-cursor-theme und breeze-icons für LXQt, papirus-icon-theme, yaru-gtk-theme. Newaita-reborn, posy-cursors und Tela-Icon-Theme sind auch in /testing verfügbar. Umgekehrt wurden mate-colors-icon-teme, mate-backgrounds und murrine-themes entfernt. Mehrere Desktop-Hintergründe oder Hintergrundbilder wurden hinzugefügt.
fr_fr: Apparence visuelle : de nombreux thèmes sont ajoutés ou mis à jour : thème Qogir-icône, emerald-themes (le thème "overglossed" du décorateur emerald est associé au gestionnaire de fenêtres Compiz), kvantum-theme-qogir, breeze-blue-cursor-theme et breeze-icons pour LXQt, papirus-icon-theme, yaru-gtk-theme. Newaita-reborn, posy-cursors et Tela-icon-theme sont également disponibles dans /testing. Inversement, mate-colors-icon-teme, mate-backgrounds et murrine-themes sont supprimés. Plusieurs fond arrières plans de bureau ou fonds d'écran sont ajoutés.

source: System: btrtbk (backup tool for BTRFS subvolumes) and sof-firmware are added, absm (BTRFS snashot manager), amd-microcode, intel-microcode, kernel, kernel-firmware, and qemu (in /extra) are upgraded. The guake drop-down terminal is added
de_de: System: btrtbk (Backup-Tool für BTRFS Untervolumen) und sof-firmware wurden hinzugefügt, Abwesenheit (BTRFS snapshot manager), amd-microcode, intel-microcode, kernel, kernel-kirmware und qemu (in /extra) wurden aktualisiert. Das Guake Drop-Down Terminal wurde hinzugefügt
fr_fr: Système: btrtbk (outil de sauvegarde pour les sous-volumes BTRFS) et sof-firmware sont ajoutés, absm (BTRFS snashot manager), amd-microcode, intel-microcode, kernel, kernel-firmware, et qemu (en /extra) sont mis à jour. Le terminal déroulant guake est ajouté

source: Development: vscode (Visual Studio Code) is added in /extra, nano and emacs are upgraded.
de_de: Entwicklung: vscode (Visual Studio Code) wurde in /extra, nano und emacs hinzugefügt.
fr_fr: Développement : vscode (Visual Studio Code) est ajouté dans /extra, nano et emacs sont mis à niveau.

source: Office: LibreOffice and associated help files and dictionaries are upgraded, thanks to Eric Hameleers aka alienBOB and libreoffice-sdkdoc is available in /extra. Remind is also updated.
de_de: Büro: LibreOffice und zugehörige Hilfedateien und Wörterbücher wurden aktualisiert, dank Eric Hameleers aka alienBOB und libreoffice-sdkdoc ist verfügbar in /extra. Remind wurde ebenfalls aktualisiert.
fr_fr: Bureau : LibreOffice les fichiers d'aide et les dictionnaires associéssont mis à jour, grâce à Eric Hameleers alias alienBOB et libreoffice-sdkdoc est disponible en /extra. Remind est également mis à jour.

source: Known issues
de_de: Bekannte Probleme
fr_fr: Problèmes connus

source: After upgrade LXQt can have a black background because the previous default wallpaper has been removed. You can choose another one typing `lxqt-config-appearance`, that can also be started form the menu or a left click on the desktop. Alternatively, as indicated above type after a text login: `cp /usr/share/pcmanfm-qt/lxqt/settings.conf ~/.config/lxqt/`. This will display the new default wallpaper.
de_de: Nach dem Upgrade kann LXQt einen schwarzen Hintergrund haben, da der vorherige Standardhintergrund entfernt wurde. Sie können einen anderen auswählen, indem Sie `lxqt-config-appearance` aufrufen, das auch aus dem Menü oder einem Linksklick auf der Arbeitsfläche gestartet werden kann. Alternativ, wie oben angegeben, nach einem Text-Login: `cp /usr/share/pcmanfm-qt/lxqt/settings.conf ~/.config/lxqt/`. Dies wird den neuen Standard-Hintergrund anzeigen.
fr_fr: Après la mise à niveau LXQt peut avoir un fond noir car le papier peint par défaut précédent a été supprimé. Vous pouvez en choisir un autre en tapant "lxqt-config-apparence", qui peut également être lancé dans le menu ou avec un clic gauche sur le bureau. Sinon, comme indiqué ci-dessus, tapez après une connexion de texte: ` cp /usr/share/pcmanfm-qt/lxqt/settings.conf ~/.config/lxqt/`. Le nouveau fonds d'écran par défaut sera affiché.

source: In MATE if started in text mode the date can't be set using the widget in the boottom panel. Use clocksetup or gtkclocksetup instead.
de_de: Wenn MATE im Textmodus gestartet wird, kann das Datum nicht über das Widget im unteren Panel festgelegt werden. Verwenden Sie stattdessen clocksetup oder gtkclocksetup.
fr_fr: Dans MATE s'il est démarré en mode texte, la date ne peut pas être définie à l'aide du widget dans le panneau d'amorçage. Utilisez plutôt clocksetup ou gtkclocksetup.

source: If you disable the display of the desktop icons in mate-tweak, a right click on the desktop becomes ineffective.
de_de: Wenn Sie die Anzeige der Desktop-Symbole in mate-tweak deaktivieren, wird ein Rechtsklick auf den Desktop unwirksam.
fr_fr: Si vous désactivez l'affichage des icônes du bureau en cas dans mate-tweak, le clic droit sur le bureau est désactivé.

source: 16 May 2023: A new ISO is available (yes, again!)
de_de: 16. Mai 2023: Eine neue ISO ist verfügbar (ja, wieder!)
fr_fr: 16 mai 2023 : Une nouvelle ISO est disponible (oui, de nouveau !)
it_it: 16 maggio 2023: Un nuovo ISO è disponibile (sì, di nuovo!)
nl_nl: 16 Mei 2023: Een nieuwe ISO is beschikbaar (ja, alweer!)

source: This new ISO is provided mainly to fix the bug described in https://slackware.uk/slint/x86_64/slint-15.0/iso/previous_iso/BUG-15.0-3[BUG-15.0-3].
de_de: Dieses neue ISO wird hauptsächlich angeboten, um den in https://slackware.uk/slint/x86_64/slint-15.0/iso/previous_iso/BUG-15.0-3[BUG-15.0-3] beschriebenen Fehler zu beheben.
fr_fr: Cette nouvelle ISO est fournie principalement pour corriger le bogue décrit dans https://slackware.uk/slint/x86_64/slint-15.0/iso/previous_iso/BUG-15.0-3[BUG-15.0-3].
it_it: Questo nuovo ISO è fornito principalmente per risolvere il bug descritto in https://slackware.uk/slint/x86_64/slint-15.0/iso/previous_iso/BUG-15.0-3[BUG-15.0-3].
nl_nl: Deze nieuwe ISO verschijnt met name om de bug te repareren beschreven in https://slackware.uk/slint/x86_64/slint-15.0/iso/previous_iso/BUG-15.0-3[BUG-15.0-3].

source: Other fixes and enhancements:
de_de: Weitere Korrekturen und Verbesserungen:
fr_fr: Autres corrections et améliorations :
it_it: Altre correzioni e miglioramenti:
nl_nl: Andere fixes en verbeteringen:

source: The user who refuses the proposed (through geoIP) time zone is given the choice to select another one or keep the default one (UTC), as if none were proposed.
de_de: Der Benutzer, der die vorgeschlagene Zeitzone (durch geoIP) ablehnt, hat die Wahl, eine andere zu wählen oder die Standardzeit (UTC) beizubehalten, als ob keine vorgeschlagen worden wäre.
fr_fr: L'utilisateur qui refuse le fuseau horaire proposé (via géoIP) a le choix d'en choisir un autre ou de conserver celui par défaut (UTC), comme si aucun n'était proposé.
it_it: L'utente che rifiuta il fuso orario proposto (tramite geoIP), può scegliere di selezionarne un altro o di mantenere quello predefinito (UTC), se non ne è stato proposto nessuno.
nl_nl: De gebruiker die de voorgestelde tijdzone (via geoIP) weigert, krijgt de keuze om een andere tijdzone te kiezen of de standaard tijdzone te behouden (UTC), alsof er geen werd voorgesteld.

source: The EFI boot loader grub.x64.efi is installed in /boot/efi/EFI/slint-$SLINTVERSION, currently /boot/efi/EFI/slint-15.0, to help select the boot entry if several versions are installed.
de_de: Der EFI Bootloader grub.x64.efi wird in /boot/efi/EFI/slint-$SLINTVERSION, derzeit /boot/efi/EFI/slint-15.0, installiert, um den Boot-Eintrag auszuwählen, falls mehrere Versionen installiert sind.
fr_fr: Le chargeur de démarrage EFI grub.x64.efi est installé dans /boot/efi/EFI/slint-$SLINTVERSION, actuellement /boot/efi/EFI/slint-15.0, pour vous aider à sélectionner l'entrée d'amorçage si plusieurs versions sont installées.
it_it: Il caricatore d'avvio EFI grub.x64.efi è installato in /boot/efi/EFI/slint-$SLINTVERSION, correntemente /boot/efi/EFI/slint-15.0, per aiutare a selezionare la voce d'avvio, se sono installate svariate versioni.
nl_nl: De EFI boot loader grub.x64.efi is geïnstalleerd in /boot/efi/EFI/slint-$SLINTVERSION, momenteel /boot/efi/EFI/slint-15.0, om je het opstartitem te kunnen laten kiezen als er meerdere versies zijn geïnstalleerd.

source: In case of manual partitioning:
de_de: Bei manueller Partitionierung:
fr_fr: En cas de partitionnement manuel :
it_it: In caso di partizionamento manuale:
nl_nl: In geval van handmatige partitionering:

source: If the machine booted the installer in Legacy mode GRUB is also installed in EFI mode if an EFI System Partition (ESP) is found on the drive of the root partition.
de_de: Wenn der Rechner den Installer im Legacy-Modus gebootet hat, wird GRUB auch im EFI-Modus installiert, wenn eine EFI-System-Partition (ESP) auf dem Laufwerk der Root-Partition gefunden wird.
fr_fr: Si la machine a démarré le programme d'installation en mode Legacy, GRUB est également installé en mode EFI si une partition ESP (EFI System Partition) se trouve sur le périphérique de la partition racine.
it_it: Se la macchina ha avviato l'installatore in modalità Ereditaria, anche GRUB è installato in modalità EFI se una Partizione di Sistema EFI (ESP) è trovata sull'unità della partizione di root.
nl_nl: Als de machine het installatieprogramma heeft opgestart in Legacy-modus wordt GRUB ook geïnstalleerd in de EFI-modus als er een EFI-systeempartitie (ESP) op het station van de rootpartitie wordt aangetroffen.
