Repository: DidierSpaier/slint-translations
Catalog: wiki/a002/*.a002.po
Languages: fr_fr

source: Customize a Slint system layout
fr_fr: Personnaliser la disposition d'un système Slint

source: In this article, we review how the Slint installer organizes the system's basic directories (their layout), and show how to customize this layout after installation. The installation process is detailed in Chapter 2: Installation of the HandBook.
fr_fr: Dans cet article, nous examinons comment l'installateur Slint organise les répertoires de base du système (leur disposition) et nous montrons comment personnaliser cette disposition après l'installation. Le processus d'installation est détaillé dans le Chapitre 2 : Installation du manuel Slint.

source: The installer places all the directories listed below, which constitute the core of the system, in the same partition:
fr_fr: Le programme d'installation place tous les répertoires répertoriés ci-dessous, qui constituent le cœur du système, dans la même partition :

source: If other partitions already formatted are accessible during the installation, the installer proposes that they be mounted at system startup, with a directory name chosen by the user as mount point, except those listed above.
fr_fr: Si d'autres partitions déjà formatées sont accessibles pendant l'installation, le programme d'installation propose qu'elles soient montées au démarrage du système, avec un nom de répertoire choisi par l'utilisateur comme point de montage, à l'exception de ceux répertoriés ci-dessus.

source: Furthermore, if automatic partitioning has been chosen, the installer proposes to create an additional partition in the remaining space available on the device, with a mount point chosen by the user, also outside those listed above.
fr_fr: De plus, si le partitionnement automatique a été choisi, l'installateur propose de créer une partition supplémentaire dans l'espace disponible sur le périphérique, avec un point de montage choisi par l'utilisateur, également en dehors de ceux listés ci-dessus.

source: In sum, the installer:
fr_fr: En somme, l'installateur :

source: places all directories constituting the core of the system in the same partition,
fr_fr: place tous les répertoires constituant le cœur du système dans la même partition,

source: allows to set up other directories in other partitions, previously formatted.
fr_fr: permets de configurer d'autres répertoires dans d'autres partitions, préalablement formattées.

source: However, you may want to install files or directories that are part of the core of the system such as /home in another partition, especially if space is limited on the device. For example, if the computer is equipped with a fast device (SSD or NVMe) and also with a slower but larger capacity hard disk, you might want to install the system on the SSD or NVMe and the larger files on the hard disk.
fr_fr: Cependant, vous pouvez installer des fichiers ou des répertoires qui font partie du cœur du système, comme /home dans une autre partition, surtout si l'espace est limité sur le périphérique. Par exemple, si l'ordinateur est équipé d'un périphérique rapide (SSD ou NVMe) et d'un disque dur plus lent mais de plus grande capacité, vous pouvez installer le système sur le SSD ou NVMe et les fichiers plus gros sur le disque dur.

source: You may also want to share large files usually stored in /home with another system, such as images, various documents, audio or video files.
fr_fr: Vous pouvez également partager des fichiers volumineux généralement stockés dans /home avec un autre système, tels que des images, des documents divers, des fichiers audio ou vidéo.

source: Practical guide
fr_fr: Guide pratique

source: As an example we show how to move /home to another device, with some variations.
fr_fr: À titre d'exemple nous montrons comment déplacer /home sur un autre périphériques avec quelques variantes.

source: Move /home entirely to another device
fr_fr: Déplacer / home entièrement vers un autre périphérique

source: We assume that you want to move the /home directory, initially installed on an SSD or NVMe, to a hard disk. This can be done right after installation or later. All the following is to be done as root.
fr_fr: Nous supposons que vous voulez déplacer le répertoire /home, initialement installé sur un SSD ou NVMe, sur un disque dur. Cela peut être fait juste après l'installation ou plus tard. Tout ce qui suit est à faire en tant que root.

source: First, you need a formatted partition on the hard disk, named /dev/sdb1 below, to host /home:
fr_fr: Tout d'abord, vous avez besoin d'une partition formatée sur le disque dur, nommée /dev/sdb1 ci-dessous, pour héberger /home:

source: Create if not already done on the hard disk the partition table (GPT type) and the partition using one of theses tools: parted, gdisk, cgdisk or gparted, all included in Slint, big enough for its intended use.
fr_fr: Créer si ce n'est déjà fait sur le disque dur la table de partitions (de type GPT) et la partition en utilisant un de ces outils : parted, gdisk, cgdisk ou gparted, tous inclus dans Slint, assez grande pour son utilisation prévue.

source: Format this partition using one of the btrfs, ext4, or xfs file types (commands `mkfs.btrfs`, `mkfs.ext4` or `mkfs.xfs`)
fr_fr: Formatez cette partition en utilisant l'un des types de fichiers btrfs, ext4 ou xfs (commandes `mkfs.btrfs`, `mkfs.ext4` ou `mkfs.xfs`)

source: To be able to copy the /home directory to this partition you need to mount it, for example on /mnt, with one of the following commands:
fr_fr: Pour pouvoir copier le répertoire /home sur cette partition, vous devez le monter par exemple sur /mnt, avec l'une des commandes suivantes :

source: mount /dev/sdb1 /mnt -o compress=zstd:3 # if /dev/sdb1 has been formatted with btrfs mount /dev/sdb1 /mnt # if /dev/sdb1 was formatted with xfs or ext4
fr_fr: mount /dev/sdb1 /mnt -o compress=zstd:3 # si /dev/sdb1 a été formattée avec btrfs mount /dev/sdb1 /mnt # si /dev/sdb1 a été formatée avec xfs ou ext4

source: Then copy the files, for example like this:
fr_fr: Copiez ensuite les fichiers, par exemple comme ceci :

source: or like this:
fr_fr: ou comme ceci :

source: Then, check that the copy has been done correctly:
fr_fr: Vérifiez ensuite que la copie a été correctement effectuée :

source: Then modify the /etc/fstab file to mount /home on the new partition at the next boot.
fr_fr: Puis modifiez le fichier /etc/fstab pour monter /home sur la nouvelle partition au prochain démarrage.

source: If the root file system is btrfs, /home is mounted as subvolume. In this case comment out the line in the file used to mount /home by inserting a # character at its beginning. For example edit this line (replace <uuid1> with the UUID value specified in /etc/fstab):
fr_fr: Si le système de fichiers racine est btrfs, /home est monté comme sous volume. Dans ce cas, commentez la ligne dans le fichier utilisé pour monter /home en insérant un caractère # au début. Par exemple, modifiez cette ligne (remplacez <uuid1> par la valeur UUID spécifiée dans /etc/fstab) :

source: which becomes:
fr_fr: qui devient :

source: Then insert in the file a line to mount at boot time /home on the new partition. We will designate <uuid2> the value of its UUID, displayed by this command:
fr_fr: Insérez ensuite dans le fichier une ligne pour monter au démarrage /home sur la nouvelle partition. Nous allons désigner <uuid2> la valeur de son UUID, affichée par cette commande :

source: The line to insert in the /etc/fstab file depends on the chosen file system of /dev/sdb1.
fr_fr: La ligne à insérer dans le fichier /etc/fstab dépend du système de fichiers choisi pour /dev/sdb1.

source: For btrfs:
fr_fr: Pour btrf :

source: For ext4 or xfs:
fr_fr: Pour ext4 ou xfs :

source: Then, reboot the machine. In case of problem, to go back:
fr_fr: Ensuite, redémarrez la machine. En cas de problème, pour revenir en arrière :

source: Case occurring uncomment the commented line in /etc/fstab (remove the # character at the beginning of the line)
fr_fr: Le cas échéant dé-commentez la ligne commentée de /etc/fstab (enlever le caractère # au début de la ligne

source: Comment the new one (insert a # character at the beginning of the line)
fr_fr: Commenter la nouvelle (insérer un caractère # au début de la ligne)

source: Then reboot.
fr_fr: Puis redémarrez le système.

source: Once the new partition has been checked for correct operation, the old one can be deleted. The way to do this depends on the file system configured by the installer. Once the machine is rebooted, make sure that /home is mounted on the new partition, for example with the command
fr_fr: Une fois que la nouvelle partition a été vérifiée come fonctionnnant correctement, l'ancienne peut être supprimée. La façon de faire dépend du système de fichiers configuré par l'installateur. Une fois la machine redémarrée, assurez-vous que /home est monté sur la nouvelle partition, par exemple avec la commande

source: Then delete the old /home:
fr_fr: Supprimez ensuite l'ancien /home :

source: In case of btrfs type these commands (we assume that the system was installed in /dev/sda3):
fr_fr: Dans le cas de btrfs tapez ces commandes (nous supposons que le système a été installé dans /dev/sda3) :

source: umount /mnt mount /dev/sda3 /mnt -o subvolid=0 btrfs subvolume delete -c /mnt/@home btrfs subvolume sync /mnt # this command initiates the recovery of the space occupied by the old /home btrfs filesystem sync # this command ends the recovery of the space occupied by the old /home umount /mnt
fr_fr: umount /mnt mount /dev/sda3 /mnt -o subvolid=0 btrfs subvolume delete -c /mnt/@home btrfs subvolume sync /mnt # cette commande lance la récupération de l'espace occupé par l'ancien /home btrfs filesystem sync # cette commande termine la récupération de l'espace occupé par l'ancien /home umount /mnt

source: In case of ext4 or xfs, we need that the new /home be not in use to remove the old one. So:
fr_fr: Dans le cas de ext4 ou xfs, nous avons besoin que le nouveau /home ne soit pas en cours d'utilisation pour supprimer l'ancien. Donc :

source: First, reboot in text mode. Login as root # Not as regular user, else we could not umount /home as it would be busy. umount /home # This makes the previous /home accessible again. rm -r /home/* # We delete the content of the previous /home but keep the directory. mount /home # Now /dev/sdb1 is mounted as /home
fr_fr: First, reboot in text mode. Connevtez vous comme root # Pas comme utilisateur ordinaire, sinon nous ne pourrions pas démonte /home car il serait occupé. umount /home # Ceci rend le précédent /home de nouveau accessible. rm -r /home/* # Nous effaçons le pércebt /home mais conservons le répertoire mount /home # Maintenant /dev/sdb1 est montée comme /home

source: Move only the largest files from /home to the hard disk
fr_fr: Déplacer uniquement les fichiers les plus volumineux de /home vers le disque dur

source: In the example above the /home directory has been completely transferred from the SSD to the hard disk.
fr_fr: Dans l'exemple ci-dessus, le répertoire /home a été complètement transféré du SSD vers le disque dur.

source: It may be preferable to store only large files on the hard disk and to leave hidden directories and files on the SSD, which are subject to frequent writes, much faster on an SSD.
fr_fr: Il peut être préférable de ne stocker que les gros fichiers sur le disque dur et de laisser les répertoires et fichiers cachés sur le SSD, lesquels sont sujets à des écritures fréquentes, beaucoup plus rapides sur un SSD.

source: To do this, you can name the mount point of the /dev/sdb1 partition `/data` in /etc/fstab, for example, then once this partition is mounted, copy the directories to be transferred from /home to /data, and finally replace these directories in /home with symbolic links to the directories in /data. For instance, once the /data directory is created and mounted on /dev/sdb1:
fr_fr: Pour ce faire, vous pouvez nommer le point de montage de la partition /dev/sdb1 `/data ` dans /etc/fstab, par exemple, une fois que cette partition est montée, copier les répertoires à transférer de /home vers /data, et enfin remplacer ces répertoires dans /home par des liens symboliques vers les répertoires dans /data. Par exemple, une fois le répertoire /data créé et monté sur /dev/sdb1:

source: This way of doing is to be adapted if the system is multi-user, for example by creating a subdirectory per user in /data.
fr_fr: Cette façon de faire est adaptée si le système est multi-utilisateur, par exemple en créant un sous-répertoire par utilisateur dans /data.

source: Move /home to the hard disk but store frequently changed files on the SSD
fr_fr: Déplacer /home sur le disque dur mais stocker les fichiers fréquemment modifiés sur le SSD

source: On the other hand it is possible to selectively store frequently changed files on the SSD, like those contained in ~/.mozilla, ~/.thunderbird or ~/.purple.
fr_fr: D'un autre côté, il est possible de stocker de manière sélective les fichiers fréquemment modifiés sur le SSD, comme ceux contenus dans ~/.mozilla, ~/.thunderbird ou ~/.purple.

source: For example, you can create a directory /data and a subdirectory /data/.thunderbird on the SSD, move ~/.thunderbird to it, and create a symbolic link /data/.thunderbird => ~/.thunderbird.
fr_fr: Par exemple, vous pouvez créer un répertoire /data et un sous-répertoire /data/.thunderbird sur le SSD, déplacer ~/. et créez un lien symbolique /data/.thunderbird => ~/.thunderbird.

source: If btrfs is used for the core system it is recommended to create a subvolume for /data with the following commands, before moving ~/.mozilla or ~/.thunderbird there, like this:
fr_fr: Si btrfs est utilisé pour le cœur du système, il est recommandé de créer un sous-volume pour /data avec les commandes suivantes, avant d'y déplacer ~/.mozilla ou ~/.thunderbird là, comme ceci :

source: Then insert a line in /etc/fstab to mount /data at system boot (<uuid1> is the UUID value of /dev/sda3):
fr_fr: Insérez ensuite une ligne dans /etc/fstab pour monter /data au démarrage du système (<uuid1> est la valeur de l'UUID de /dev/sda3) :

source: Then reboot and type the following commands:
fr_fr: Puis redémarrez et tapez les commandes suivantes :
