Repository: DidierSpaier/slint-translations
Catalog: auto/*.auto.po
Languages: de_de, sv_se

source: Installation of $PKG failed for this reason:
de_de: Die Installation von $PKG ist aus folgendem Grund fehlgeschlagen:
sv_se: Installationen av $PKG misslyckades av den här orsaken:

source: Slint installation can't continue
de_de: Die Installation von Slint kann nicht fortgesetzt werden
sv_se: Slint installationen kan inte fortsätta

source: Therefore, Slint installation is not possible.
de_de: Daher ist die Installation von Slint nicht möglich.
sv_se: Därför är installation av Slint inte möjligt.

source: Check the integrity of the installation media.
de_de: Überprüfen Sie die Integrität der Installationsmedien.
sv_se: Kontrollera integriteten för installationsmediet.

source: Please type the machine name or "hostname" and press Enter or just press Enter to accept the default name "slint".
de_de: Bitte geben Sie den Rechnernamen oder "hostname" ein und drücken Sie Enter oder nur Enter um den Standardnamen "slint" zu akzeptieren.
sv_se: Skriv maskinnamnet eller "hostname" och tryck på Enter eller tryck bara på Enter om du vill acceptera standardnamnet "slint".

source: Machine name[slint]:
de_de: Rechnername [slint]:
sv_se: Maskinnamn[slint]:

source: Please select a default desktop among those listed below. mate is the most accessible with a screen reader.
de_de: Bitte wählen Sie einen Standard-Desktop aus, aus denen, die unten aufgeführt sind. MATE ist der am besten barrierefreie, unter Verwendung eines Screenreaders.
sv_se: Välj ett standardskrivbord bland dem som anges nedan. Mate är den mest tillgängliga med en skärmläsare.

source: i3 is also accessible. If you need speech, preferably type i38 before starting it.
de_de: i3 ist ebenfalls barrierefrei. Wenn Sie Sprachausgabe benötigen, geben Sie bitte vor dem Start i38 ein.

source: Your choice:
de_de: Ihre Wahl:
sv_se: Ditt val:

source: $session is not an available desktops.
de_de: $session ist keine verfügbare Desktopoberfläche.

source: $session has been chosen.
de_de: $session wurde ausgewählt.

source: building an initramfs...
de_de: Eine Initramfs wird gebaut...
sv_se: bygger en initramfs...

source: Installing the GRUB bootloader...
de_de: Der GRUB Bootloader wird installiert...
sv_se: Installerar GRUB-bootloader...

source: Building the GRUB boot menu...
de_de: Das GRUB Bootmenü wird erstellt...
sv_se: Skapar GRUB startmeny...

source: Installation and initial configuration of Slint are complete. If you want a preview of the boot menu displayed after rebooting, type now: chroot /SLINT list_boot_entries To exit press q (not Alt+F4 in this context) then y. To quit the installer and start your new Slint remove the installation media then type 'reboot' or press Ctrl+Alt+Del.
de_de: Installation und Erstkonfiguration von Slint sind abgeschlossen. Wenn Sie eine Vorschau des Startmenüs nach dem Neustart angezeigt bekommen möchten, tippen Sie jetzt: chroot /SLINT list_boot_entries Zum Beenden drücken Sie q (nicht Alt+F4 in diesem Kontext) dann y. Um den Installer zu beenden und Ihr neues Slint zu starten, entfernen Sie die Installationsmedien und geben Sie dann 'reboot' ein oder drücken Sie Strg+Alt+Entfernen.
sv_se: Installation och initial konfigurering av Slint är klar. Om du vill att en förhandsgranskning av startmenyn ska visas efter omstart, skriver du nu: chroot /SLINT list_boot_entries För att avsluta tryck q (inte Alt + F4 i det här sammanhanget) sen y. Om du vill avsluta installationsprogrammet och starta den nya Slint tar du bort installationsmediet och sedan trycker du på Ctrl+Alt+Del.

source: In the links web browser you navigate with the keyboard: To go to the next or previous fields press the up or down arrow keys To quit press q then confirm pressing Enter To display the key bindings press F1 to display the menu press Esc then navigate in it with the arrow keys
sv_se: I webbläsarens länkar navigerar du med tangentbordet: För att gå till nästa eller föregående fält trycker du på piltangenterna uppåt eller nedåt För att avsluta trycker du på q och bekräftar sedan genom att trycka på Enter För att visa tangentbindningarna trycker du på F1 För att visa menyn trycker du på Esc och navigerar sedan i den med piltangenterna

source: Only lower case letters and "/" are allowed.
sv_se: Endast små bokstäver och "/" är tillåtna.

source: Found $INSTALLMEDIA installation media! Please restart leaving only one inserted or plugged in.
sv_se: Hittade $INSTALLMEDIA installationsmedia! Vänligen starta om och lämna endast en insatt eller inkopplad.

source: $INSTALLERPATH is not a media including this Slint installer or is corrupted.
sv_se: $INSTALLERPATH är inte ett media inklusive denna Slint installerare eller är skadad.

source: If you prefer manual (custom) partitioning but did do the partitioning yet, press q to quit now. You will type 'start' again when ready.
sv_se: Om du föredrar manuell (anpassad) partitionering men inte har gjort partitioneringen ännu, trycker du på q för att avsluta nu. Du skriver "start" igen när du är klar.

source: $NEWPARTNAME is a reserved directory name.
sv_se: $NEWPARTNAME är ett reserverat katalognamn.

source: Only lower case letters are allowed
sv_se: Endast små bokstäver är tillåtna

source: In the next dialog, yo will chose the language for your Slint System.
sv_se: I nästa dialogruta kommer du att välja språk för ditt Slint System.

source: Passphrase:
sv_se: Lösenordsfras:

source: $session is not an available desktops:
sv_se: $session är inte ett tillgängligt skrivbord:
