Repository: DidierSpaier/slint-translations
Catalog: auto/*.auto.po
Languages: de_de, sv_se

source: There don't seem to be any partitions on this machine of type Linux and size at least ${GCOUNT}G. You need one to install Linux. For more information, choose 'doc' from the menu.
de_de: Auf diesem Rechner scheint keine Partition vom Typ Linux und der Größe von mindestens ${GCOUNT}G vorhanden zu sein. Sie benötigen eine, um Linux zu installieren. Für weitere Informationen wählen Sie 'doc' aus dem Menü.
sv_se: Det verkar inte finnas några partitioner på den här maskinen av typen Linux och en storlek på minst ${GCOUNT}G. Du behöver en för att installera Linux. För mer information, välj 'doc' från menyn.

source: This machine booted in EFI mode but no big enough EFI System Partition found. For more information. choose 'doc' from the menu.
de_de: Dieser Rechner wurde im EFI-Modus gebootet, es wurde aber keine EFI-System-Partition gefunden, die groß genug ist. Für weitere Informationen, wählen Sie 'doc' aus dem Menü.
sv_se: Denna maskin startades upp i EFI-läge men ingen tillräckligt stor EFI-systempartition hittades. För mer information. Välj 'doc' från menyn.

source: If the root partition is in a drive with a GPT, GRUB needs a BIOS boot partition on the same drive, of size at least 3M. We didn't find such a configuration.
de_de: Wenn sich die Root-Partition auf einem Laufwerk mit GPT befindet, benötigt GRUB eine BIOS-Boot-Partition auf der gleichen Festplatte, die mindestens 3M groß ist. Eine solche Konfiguration wurde nicht gefunden.
sv_se: Om rotpartitionen är på en enhet med en GPT behöver GRUB en BIOS boot partition på samma enhet, med en storlek på minst 3M. Vi hittade inte en sådan konfiguration.

source: We didn't find a drive of size at least ${GCOUNT}G and no mounted partition, so the automatic partitioning is not possible.
de_de: Es konnte kein Laufwerk von mindestens ${GCOUNT}G und keine eingehängte Partition gefunden werden, was die automatische Partitionierung unmöglich macht.
sv_se: Vi hittade inte en enhet med storlek på minst ${GCOUNT}G och ingen monterad partition, så automatisk partitionering är inte möjligt.

source: The machine booted in EFI mode but we did not find a potential root partition with an EFI system partition on the same drive so the manual partitioning mode is not possible.
de_de: Dieser Rechner wurde im EFI-Modus gebootet, es konnte aber keine geeignete Root-Partition mit einer EFI-Systempartition auf demselben Laufwerk gefunden werden. Deshalb ist der manuelle Modus zum Partitionieren nicht möglich.
sv_se: Maskinen startades i EFI-läget men vi hittade inte någon potentiell rotpartition med ett EFI-systempartition på samma enhet så den manuella partitioneringen är inte möjlig.

source: Press Enter to go back to the menu
de_de: Drücken Sie die Eingabetaste, um zurück zum Menü zu gelangen
sv_se: Tryck på Enter för att gå tillbaka till menyn

source: Welcome back to the menu of the Slint installer. You may now type (without the quotes): 'doc' to know the features and usage of the installer. 'start' to start the installation. The installer can prepare the drive where Slint will be installed, creating the the needed partitions. If you prefer you can do it yourself using command line utilities available in the installer, then type 'start' when done. You can also leave the installer and use a tool like gparted to do that then start the installer again. We recommend that you type 'doc' first in this case, or if you want to encrypt the root Slint partition. When you finish reading this menu will be displayed again.
de_de: Willkommen zurück im Menü des Slint-Installers. Sie können nun folgendes eingeben (ohne Anführungszeichen): 'doc', um die Funktionen und die Verwendung des Installers kennenzulernen. 'start', um die Installation zu starten. Der Installer kann das Laufwerk vorbereiten, auf dem Slint installiert wird und die benötigten Partitionen erstellen. Wenn Sie es vorziehen, können Sie es selbst mit den Kommandozeilen-Dienstprogrammen im Installer tun, und geben dann 'start' ein, wenn Sie fertig sind. Sie können den Installer auch verlassen und ein Werkzeug wie gparted verwenden, um dies zu tun und dann den Installer erneut zu starten. Wir empfehlen Ihnen, in diesem Fall zuerst 'doc' einzugeben oder wenn Sie die Root-Slint-Partition verschlüsseln wollen. Wenn Sie das Lesen beendet haben, wird dieses Menü erneut angezeigt.
sv_se: Välkommen tillbaka till menyn i Slint-installationsprogrammet. Du kan nu skriva (utan citationstecken): 'doc' för att få information om installationsprogrammets funktioner och användning. "start" för att starta installationen. Installationsprogrammet kan förbereda enheten där Slint ska installeras, skapa de nödvändiga partitionerna. Om du föredrar det kan du göra det själv med hjälp av de kommandoradsverktyg som finns i installationsprogrammet, skriv sedan "start". när du är klar. Du kan också lämna installationsprogrammet och använda ett verktyg som gparted. för att göra det och sedan starta installationsprogrammet igen. Vi rekommenderar att du skriver "doc" först i det här fallet, eller om du vill kryptera root-partitionen för Slint. När du har läst färdigt kommer den här menyn att visas igen.

source: In manual partitioning mode you partition and format the drive where you want to install Slint to your liking, using utilities it includes. This gives you more choices of partitions layout and file systems but needs to be acquainted to Linux and the command line (but you may also have used a tool like gparted live before starting the installer, or from another system).
de_de: Im manuellen Partitionierungsmodus partitionieren und formatieren Sie das Laufwerk, auf welchem Sie Slint nach Ihren Wünschen installieren möchten, mit Dienstprogrammen, die es beinhaltet. Dies bietet mehr Optionen für Partitionen-Layout und Dateisysteme, wenn man sich mit Linux und der Kommandozeile auskennt (aber Sie können auch ein Tool wie gparted live vor dem Starten des Installers benutzen oder von einem anderen System).
sv_se: I det manuella partitionsläget partitionerar och formaterar du enheten där du vill installera Slint enligt dina önskemål, med hjälp av de verktyg som ingår. Detta ger dig fler valmöjligheter när det gäller partitionslayout och filsystem, men kräver att du är bekant med Linux och kommandoraden (men du kan också ha använt ett verktyg som gparted live innan du startade installationsprogrammet, eller från ett annat system).

source: In auto mode the installer do it for you, but chooses the partition layout and the file system.
de_de: Im automatischen Modus erledigt das der Installer für Sie, wählt aber Partitionen-Layout und Dateisystem selbst aus.
sv_se: I automatiskt läge gör installationsprogrammet det åt dig, men väljer partitionslayout och filsystemet.

source: In both modes you will be given a chance to indicate existing partitions (not needed by Slint) that you want to access from Slint.
de_de: In beiden Modi erhalten Sie die Möglichkeit, vorhandene Partitionen anzugeben (die nicht von Slint genutzt werden) auf die Sie von Slint zugreifen möchten.
sv_se: I båda lägen kommer du att ges en chans att ange befintliga partitioner (som inte behövs av Slint) som du vill få åtkomst till från Slint.

source: Press Enter to continue
de_de: Drücken Sie die Eingabetaste, um fortzufahren
sv_se: Tryck på Enter för att fortsätta

source: These directories should not be mounted on separate partitions: $RESERVED or use arbitrary directory names, for instance to mount other Linux systems.
de_de: Diese Verzeichnisse sollten nicht auf separaten Partitionen gemountet werden: $RESERVED oder verwenden Sie beliebige Verzeichnisnamen, zum Beispiel um andere Linux-Systeme zu mounten.
sv_se: Dessa kataloger bör inte monteras på separata partitioner: $RESERVED eller använda godtyckliga katalognamn, till exempel för att montera andra Linux-system.

source: You may dedicate all the space available on the drive (${ARG2}G) to the root Slint partition, or make this partition smaller (at least ${ARG1}G) to reserve some space for a future use, like setting up a partition shared across OS or installing later another OS alongside Slint. To dedicate all the available space to the root Slint partition, set its size to ${ARG2}G.
de_de: Sie können den gesamten verfügbaren Platz auf dem Laufwerk (${ARG2}G) der Slint-Root-Partition zuweisen oder diese Partition verkleinern (mindestens ${ARG1}G), um etwas Platz für eine spätere Verwendung zu reservieren, wie z.B. das Einrichten einer OS-übergreifenden Partition oder um später ein anderes Betriebssystem neben Slint zu installieren. Um den gesamten verfügbaren Platz für die Slint-Root-Partition zu reservieren, setzen Sie ihre Größe auf ${ARG2}G. Wenn Sie stattdessen eine zusätzliche Partition benötigen, um Daten abzulegen, die möglicherweise mit anderen Betriebssystemen geteilt werden sollen, verkleinern Sie die Slint-Root-Partition und im nächsten Schritt wird Ihnen der Installer beim Einrichten helfen.
sv_se: Du kan dedikera all tillgängligt utrymme på enheten (${ARG2}G) till Slint root-partition eller göra den här partitionen mindre (minst ${ARG1}G) för att reservera ett visst utrymme för en framtida användning, som att installera en partition som delas mellan OS eller för att installera ett annat OS tillsammans med Slint. För att dedikera all tillgänglig plats till Slint root-partition, ställer du in dess storlek till ${ARG2}G.

source: brtfs is the most advanced and flexible linux file system, offering snapshots, subvolumes support, online check and repair, RAID. Using these features needs some learning. ex4 is the most common Linux file system and is very reliable. xfs can be preferred to ext if you have very large storage requirements with large files
de_de: brtfs ist das fortschrittlichste und flexibelste Linux-Dateisystem, das Snapshots, SubVolumes Support, Online-Check und Reparatur von RAID bietet. Die Verwendung dieser Funktionen erfordert etwas Lernen. ext4 ist das gängigste Linux-Dateisystem und ist sehr zuverlässig. xfs kann bevorzugt werden, wenn Sie sehr große Speicheranforderungen mit großen Dateien haben
sv_se: brtfs är det mest avancerade och flexibla linux-filsystemet, som erbjuder ögonblicksbilder, undervolymsstöd, onlinekontroll och reparation, RAID. För att använda dessa funktioner behöver du lära dig en del. ex4 är det vanligaste Linux-filsystemet och är mycket tillförlitligt. xfs kan föredras gämfört med ext om du har mycket stora lagringskrav med stora filer

source: Encrypt a drive prevents theft of the data it contains in case of loss or theft of the drive itself or of the machine where it is installed. If you decide to encrypt it, you will need to type a so called "passphrase" to unlock it every time you boot Slint. Be aware that if you forget the passphrase all data in the drive will be irrecoverably lost! So write it down carefully on a safe place. We will ask you to type the passphrase later using a "us" keyboard map.
de_de: Das Laufwerk $NAME kann verschlüsselt werden, um einen Diebstahl der Daten, der Maschine oder des Laufwerks selbst zu verhindern. Wenn Sie sich für die Verschlüsselung entscheiden, müssen Sie bei jedem Start von Slint eine so genannte "Passphrase" eingeben, um das Laufwerk zu entsperren. Seien Sie sich bewusst, dass, wenn Sie die Passphrase vergessen, alle Daten auf dem Laufwerk unwiederbringlich verloren sind! Notieren Sie sich die Passphrase also sorgfältig an einem sicheren Ort. Wir werden Sie später auffordern, die Passphrase mit einer "us"-Tastaturbelegung einzugeben.
sv_se: Kryptera en enhet förhindrar stöld av data som den innehåller i händelse av förlust eller stöld av själva enheten eller maskinen där den är installerad. Om du bestämmer dig för att kryptera den måste du skriva en så kallad "lösenordsfras" för att låsa upp den varje gång du startar Slint. Var medveten om att om du glömmer lösenordsfrasen kommer all data på enheten att vara oåterkalleligt förlorat! Så skriv ner det noggrant på en säker plats. Vi kommer att be dig att skriva lösenordsfrasen senare med "us"-tangentbordslayout.

source: As you are currently using a "$KEYMAP" keyboard map, we will spell each character of the passphrase you type, which may differ from the one engraved on the keyboard key.
de_de: Da Sie derzeit eine "$KEYMAP"-Tastaturbelegung verwenden, buchstabieren wir jedes Zeichen der von Ihnen eingegebenen Passphrase, das von dem auf der Tastaturtaste aufgedruckten Zeichen abweichen kann.
sv_se: Eftersom du för närvarande använder en "$KEYMAP"-tangentbordslayout stavar vi var och ett tecken för lösenordsfrasen du skriver, som kan skilja sig från den som är tryckt på tangentbordet.

source: The passphrase should have at least 8 characters. Only ASCII printable characters are allowed. This includes non accented lower case and capital letters, digits from 0 to 9, space and following punctuation characters:
de_de: Das Passwort sollte mindestens 8 Zeichen lang sein. Es sind nur druckbare ASCII-Zeichen erlaubt. Das beinhaltet kleine und große Buchstaben ohne Umlaute, Ziffern von 0 bis 9, Leerzeichen und folgende Satz- und Trennzeichen:
sv_se: Lösenfrasen ska ha minst 8 tecken. Endast ASCII-skrivbara tecken är tillåtna. Detta inkluderar små och stora bokstäver utan accent, siffror från 0 till 9, mellanslag och följande skiljetecken:

source: If you choose C (Console) Slint will start in text mode, in a console where you type commands at the prompt. It will first ask your login name then your password. After that you can type commands or start a graphical environment just typing: 'startx' without the quotes. If instead you choose G (Graphical) you will type your login name then your password in a window, then the graphical environment will be displayed.
de_de: Wenn Sie C (Konsole) wählen, startet Slint im Textmodus einer Konsole, in der Sie Befehle an der Eingabeaufforderung eingeben. Es wird zuerst nach Ihrem Anmeldenamen und dann nach Ihrem Passwort gefragt. Danach können Sie Befehle eingeben oder eine grafische Umgebung starten, indem Sie einfach 'startx' ohne Anführungszeichen eingeben. Wenn Sie stattdessen G (Grafisch) wählen, geben Sie Ihren Anmeldenamen und Ihr Kennwort in ein Fenster ein, woraufhin die grafische Umgebung angezeigt wird.
sv_se: Om du väljer C (konsol) startar Slint i textläge i en konsol där du skriver kommandon vid prompten. Det kommer först att fråga om ditt inloggningsnamn sen ditt lösenord. Därefter kan du skriva kommandon eller starta en grafisk miljö, skriv bara: 'startx' utan citationstecken. Om du istället väljer G (Grafisk) skriver du ditt inloggningsnamn och sedan ditt lösenord i ett fönster, då visas den grafiska miljön.

source: In the links web browser you navigate with the keyboard: To go to the next or previous fields press the up or down arrow keys To quit press q then confirm pressing Enter To display the key bindings press F1 to display the menu press Esc then navigate with the arrow keys
de_de: In den Links des Webbrowsers navigieren Sie mit der Tastatur: Um zu den nächsten oder vorherigen Feldern zu gehen, drücken Sie die Pfeiltasten Zum Beenden drücken drücken Sie q und bestätigen Sie dann Eingabe Um die Tastenzuordnungen anzuzeigen, drücken Sie F1 Um das Menü anzeigen zu lassen, drücken Sie Esc und navigieren Sie mit den Pfeiltasten

source: Press Enter to continue.
de_de: Drücken Sie die Eingabetaste, um fortzufahren.
sv_se: Tryck på Enter för att fortsätta.

source: Please choose mount point for $NAME. Use only lower case letters and do not choose a directory name reserved in Linux or in other OS from which this partition will be accessed.
de_de: Bitte wählen Sie den Einhängepunkt für $NAME. Verwenden Sie nur Kleinbuchstaben und wählen Sie keinen Verzeichnisnamen aus, der in Linux oder in einem anderen Betriebssystem reserviert ist, von dem aus auf diese Partition zugegriffen wird.
sv_se: Välj monteringspunkt för $NAME. Använd endast gemener och välj inte ett katalognamn som är reserverat i Linux eller i annat operativsystem som den här partitionen kommer att nås från.

source: Please choose a name for the new partition; like "data". Use only lower case letters and do not choose a reserved directory name in Linux or in other OS from which this partition will be accessed.
de_de: Bitte wählen Sie einen Namen für die neue Partition aus; z. B. "daten". Verwenden Sie nur Kleinbuchstaben und wählen Sie keinen reservierten Verzeichnisnamen in Linux oder einem anderen Betriebssystem, von dem auf diese Partition zugegriffen wird.
sv_se: Välj ett namn för den nya partitionen. Som "data". Använd endast små bokstäver och välj inte ett reserverat katalognamn i Linux eller i andra OS från som partitionen kommer att accessas.

source: Type the name of the new partition, or h for help:
de_de: Geben Sie den Namen der neuen Partition ein, oder h für Hilfe:
sv_se: Skriv namnet på den nya partitionen eller h för hjälp:

source: Type the mount point for $NAME, or h for help:
de_de: Geben Sie den Einhängepunkt für $NAME ein, oder h für Hilfe:
sv_se: Skriv in monteringspunkten för $NAME, eller h om du vill ha hjälp:

source: $MOUNTPOINT is a reserved directory name.
de_de: $MOUNTPOINT ist ein reservierter Verzeichnisname.
sv_se: $MOUNTPOINT är ett reserverat katalognamn.

source: This mount point is already in use.
de_de: Dieser Einhängepunkt wird bereits verwendet.
sv_se: Denna monteringspunkt används redan.

source: in "auto" mode a partition for /home should be located in another drive.
de_de: Im "auto"-Modus sollte eine Partition für /home auf einem anderen Laufwerk liegen.

source: You will be allowed to select one later, already used or just created.
de_de: Man kann später einen bereits benutzten oder gerade erstellten auswählen.

source: If it already contains data you will choose to keep or erase them.
de_de: Wenn sie bereits Daten enthält, können Sie diese speichern oder löschen.

source: Do you want to format this partition? If yes we will erase everything in it so all data it contains will be lost!
de_de: Soll diese Partition formatieren werden? Falls ja, werden alle Daten darauf gelöscht und gehen verloren!

source: Do you want to delete all data on $NAME et re-format it?
de_de: Möchten Sie alle Daten auf $NAME löschen und dann Slint darauf installieren?

source: Type yes or no:
de_de: Geben Sie yes oder no ein:
sv_se: Skriv in yes eller no:

source: Allowed file system types for linux partitions are:
de_de: Erlaubte Dateisystem-Typen für Linux-Partitionen sind:
sv_se: Tillåtna filsystemtyper för linux-partitioner är:

source: Type the file system type for $NAME or h for help:
de_de: Geben Sie den Dateisystemtyp für $NAME oder h für Hilfe ein:
sv_se: Skriv in filsystemstyp för $NAME eller h om du vill ha hjälp:

source: No installation media found. Please restart leaving it inserted or plugged in.
de_de: Keine Installationsmedien gefunden. Bitte schließen Sie ein Medium an und starten neu.
sv_se: Ingen installationsmedia hittades. Starta om och lämna den insatt eller inkopplad.

source: But if the installation ISO is in some disk partition, mount this partition like this: mount <partition /dev/something/> /floppy then type: mount <path to the ISO> /ISO then type start again.
de_de: Fall ein ISO-Abbild mit dem Installer auf einer Laufwerks-Partition ist, binden sie es wie folgt ein: mount <partition /dev/something/> /floppy mount <path to the ISO> /ISO Danach geben Sie erneut 'start' ein.

source: We could not mount the installer for this reason: $MOUNTSRCERROR
de_de: Wir konnten den Installer aus folgendem Grund nicht einhängen: $MOUNTSRCERROR
sv_se: Vi kunde inte montera installeraren av denna orsak: $MOUNTSRCERROR

source: The Slint installer proposes installation options and let you choose what you prefer, through question/answer dialogues, then it installs and configure Slint. After installation you may customize the system through simple commands listed in the included documentation.
de_de: Der Slint-Installer schlägt Installationsoptionen vor und lässt Sie in Frage/Antwort-Dialogen Ihre bevorzugten Einstellungen wählen, installiert und konfiguriert dann Slint. Nach der Installation können Sie das System durch einfache Befehle anpassen, die in der mitgelieferten Dokumentation aufgelistet sind.
sv_se: Slint-installeraren föreslår installationsalternativ och låter dig välja vad du föredrar, genom frågor/svar dialoger, sedan installerar du och konfigurerar Slint. Efter installationen kan du anpassa systemet genom enkla kommandon som listas i den inkluderade dokumentationen.

source: You can chose between a manual or auto partitioning.
de_de: Sie können zwischen manueller oder automatischer Partitionierung wählen.
sv_se: Du kan välja mellan en manuell eller automatisk partitionering.

source: If you prefer manual (custom) partitioning but did not do the partitioning yet, press q to quit now. You will type 'start' again when ready.
de_de: Wenn Sie die manuelle Partitionierung (custom) bevorzugen, aber die Partitionierung noch nicht durchgeführt haben, drücken Sie q, um jetzt abzubrechen. Geben Sie erneut 'start' ein, sobald Sie bereit sind.

source: Press m for manual, a for auto, h for help or q to quit:
de_de: Drücke m für manuell, a für Auto, h für Hilfe oder q zum Beenden:
sv_se: Tryck på m för manuell, a för automatisk, h för hjälp eller q för att avsluta:

source: Type 'start' again when you will be ready.
de_de: Geben Sie 'start' erneut ein, wenn Sie bereit sind.
sv_se: Skriv 'start' igen när du är klar.

source: $ANSWER is not a valid answer.
de_de: $ANSWER ist keine gültige Antwort.
sv_se: $ANSWER är inte ett giltigt svar.

source: Slint can be installed on this drive:
de_de: Slint kann auf folgendem Laufwerk installiert werden:
sv_se: Slint kan installeras på den här enheten:

source: To install Slint on this drive we need to wipe all data in it
de_de: Um Slint auf diesem Laufwerk zu installieren, werden alle Daten darauf gelöscht
sv_se: För att installera Slint på den här enheten måste vi rensa alla data på den

source: Slint can be installed on one of the drives listed below.
de_de: Slint kann auf einem der unten aufgeführten Laufwerke installiert werden.
sv_se: Slint kan installeras på någon av de enheter som anges nedan.

source: Please type the chosen drive's number, or q to quit:
de_de: Bitte geben Sie die Nummer des gewählten Laufwerks ein, oder q zum Beenden:
sv_se: Skriv in den valda enhetens nummer, eller q för att avsluta:

source: Slint would be installed on this drive:
de_de: Slint wird auf diesem Laufwerk installiert:
sv_se: Slint skulle installeras på denna enhet:

source: To dedicate $NAME, size ${SIZEG}G to Slint we need to delete all data stored on this drive, including existing OS case occurring. Here are its current partitions:
de_de: Um $NAME für Slint (Größe ${SIZEG}G) zuzuweisen, werden alle auf diesem Laufwerk gespeicherten Daten gelöscht, einschließlich evtl. vorhandener Betriebssysteme. Dies sind die aktuellen Partitionen:
sv_se: För att dedikera $NAME, storlek ${SIZEG}G till Slint måste vi ta bort all data som lagrats på den här enheten, inklusive befintligt OS. Här är de aktuella partitionerna:

source: Do you want to delete all data on $NAME then install Slint on it?
de_de: Möchten Sie alle Daten auf $NAME löschen und dann Slint darauf installieren?
sv_se: Vill du radera all data på $NAME och sen installera Slint på den?

source: Do you want to install Slint on it?
de_de: Möchten Sie Slint darauf installieren?
sv_se: Vill du installera Slint på den?
