Repository: DidierSpaier/slint-translations
Catalog: auto/*.auto.po
Languages: de_de, sv_se

source: You can dedicate all the available space: ${GAVAILABLE}G to Slint's root partition, or keep part of it for another usage. The size of the Slint root partition should be between ${GCOUNT}G and ${GAVAILABLE}G.
de_de: Sie können den gesamten verfügbaren Speicherplatz (${GAVAILABLE}G) der Root-Partition von Slint zuweisen oder einen Teil davon für eine andere Verwendung freihalten. Die Größe der Slint-Root-Partition sollte zwischen ${GCOUNT}G und ${GAVAILABLE}G liegen.
sv_se: Du kan tillägna allt tillgängligt utrymme: ${GAVAILABLE}G till Slints rootpartition, eller behålla en del av den för annan användning. Storleken på Slint-rotpartitionen bör vara mellan ${GCOUNT}G och ${GAVAILABLE}G.

source: Size of the Slint root partition (h for help):
de_de: Größe der Slint-Root-Partition (h für Hilfe):
sv_se: Storleken på Slint root-partition (h för hjälp):

source: $GROOTSIZE is not a number.
de_de: $GROOTSIZE ist keine Zahl.
sv_se: $GROOTSIZE är inte ett nummer.

source: $GROOTSIZE is not a number between $GCOUNT and $GAVAILABLE.
de_de: $GROOTSIZE ist keine Zahl zwischen $GCOUNT und $GAVAILABLE.
sv_se: $GROOTSIZE är inte ett nummer mellan $GCOUNT och $GAVAILABLE.

source: There remains ${GREMAINING}G of free space in $DRIVEPATH. You may allocate all or part of it to an additional partition. If you want an additional partition type its size below (at most ${GREMAINING}G), else just press Enter.
de_de: Es bleiben ${GREMAINING}G Speicherplatz auf $DRIVEPATH frei. Sie können ihn ganz oder teilweise einer zusätzlichen Partition zuweisen. Wenn Sie eine zusätzliche Partition benötigen, geben Sie deren Größe unten ein (höchstens ${GREMAINING}G), ansonsten drücken Sie einfach die Eingabetaste.
sv_se: Det finns ${GREMAINING}G ledigt utrymme på $DRIVEPATH. Du kan fördela allt eller en del av den till ytterligare en partition. Om du vill ha ytterligare en partition skriv dess storlek nedan (högst ${GREMAINING}G), annars trycker du bara på Enter.

source: Size of the added partition (h for help):
de_de: Größe der hinzugefügten Partition (h für Hilfe):
sv_se: Storleken på den tillagda partitionen (h för hjälp):

source: The size should be at most ${GREMAINING}G.
de_de: Die Größe sollte maximal ${GREMAINING}G betragen.
sv_se: Storleken bör vara högst ${GREMAINING}G.

source: You have chosen the "manual" partitioning mode.
de_de: Sie haben den "manuellen" Modus für die Partitionierung gewählt.
sv_se: Du har valt "manuell" partitioneringsläge.

source: We need to identify the root Slint partition, to be mounted as "/". We will later format this partition, which will erase its content.
de_de: Wir müssen die Slint-Root-Partition identifizieren, die als "/"gemountet werden soll. Diese Partition wird später formatiert, was ihren Inhalt löschen wird.
sv_se: Vi måste identifiera Slint root-partitionen, att vara monterad som "/". Vi kommer senare att formatera den här partitionen, vilket raderar dess innehåll.

source: We have found only one Linux partition big enough to install Slint: ${ROOTNAME}, size ${GSIZE}G.
de_de: Es wurde nur eine Linux-Partition gefunden, die groß genug ist, um Slint installieren zu können: ${ROOTNAME}, Größe ${GSIZE}G.
sv_se: Vi har bara hittat en Linux-partition tillräckligt stor för att installera Slint: ${ROOTNAME}, storlek ${GSIZE}G.

source: Do you want to install Slint on $ROOTNAME?
de_de: Möchten Sie Slint auf $ROOTNAME installieren?
sv_se: Vill du installera Slint på $ROOTNAME?

source: Please type yes to confirm or no to quit:
de_de: Bitte geben Sie 'yes' zum Bestätigen ein, oder 'no' zum Beenden:
sv_se: Skriv yes för att bekräfta eller no till att avsluta:

source: You can select the root partition among these:
de_de: Wählen Sie die Root-Partition aus:
sv_se: Du kan välja root-partitionen bland följande:

source: Please type the root partitions's number, or q to quit:
de_de: Bitte geben Sie die Nummer der Root-Partition ein, oder q zum Beenden:
sv_se: Ange root-partitionens nummer eller q om du vill avsluta:

source: $ANSWER is not a listed partition number.
de_de: $ANSWER ist keine gelistete Partitionsnummer.
sv_se: $ANSWER är inte ett listat partitionsnummer.

source: You can associate a mount point to each partition listed below. You will first select a partition typing its number, then its mount point. Type d when done, l to display the list again, or q to quit.
de_de: Jede der unten aufgeführten Partitionen kann mit einem Einhängepunkt verknüpft werden. Wählen Sie zuerst die Nummer einer Partition aus und dann den Einhängepunkt. Geben Sie d zum Bestätigen ein, l um die Liste erneut anzeigen zu lassen, oder q zum Abbruch.
sv_se: Du kan koppla en monteringspunkt till varje partition som anges nedan. Du väljer först en partition genom att ange dess nummer och sedan dess monteringspunkt. Skriv d när du är klar, l för att visa listan igen eller q för att avsluta.

source: Partition number? (or l to display the list, d when done, q to quit):
de_de: Partitionsnummer? (oder l um die Liste anzeigen zu lassen, d zum Bestätigen, q zum Abbruch):
sv_se: Partitionsnummer? (eller l för att visa listan, d när du är klar, q för att avsluta):

source: We will now list the partitions found on this machine with one of the file systems exfat, ntfs, vfat, used by Windows. You will now type the numbers of those you want to be automatically mounted at boot time, either read-only or read-write.
de_de: Nun werden die Partitionen auf diesem Rechner mit einem exfat-, ntfs- oder vfat-Dateisystem aufgelistet, welche von Windows genutzt werden. Sie können nun die Nummern derer eingeben, die beim Booten automatisch eingehängt werden sollen, entweder schreibgeschützt oder beschreibbar.
sv_se: Vi kommer nu att lista de partitioner som finns på den här maskinen med ett av filsystemen exfat, ntfs, vfat, som används av Windows. Du ska nu skriva in numren på de partitioner som du vill ha monterade automatiskt vid uppstart, antingen skrivskyddad eller skrivbar.

source: Partition number? (l to display the list, d when done, h for help):
de_de: Partitionsnummer? (oder l um die Liste anzeigen zu lassen, d zum Bestätigen, q zum Abbruch):
sv_se: Partitionsnummer? (l för att visa listan, d när du är klar, h för hjälp):

source: $ANSWER is not a listed partition number
de_de: $ANSWER ist keine gelistete Partitionsnummer
sv_se: $ANSWER är inte ett listat partitionsnummer

source: The root Slint partition can be encrypted to prevent data steal in case of loss or theft of the machine or the drive where Slint is installed. Then you will type a so-called "passphrase" to unlock the Slint partition, giving access to the boot menu. We will record this passphrase
de_de: Das Laufwerk kann verschlüsselt werden, um einen Diebstahl der Daten beim Verlust des Rechners oder des Laufwerks selbst zu verhindern. Dann muss eine sogenannte "Passphrase" eingegeben werden, um das Laufwerk zu entsperren und Slint zu starten. Diese Passphrase wird aufgezeichnet
sv_se: Slint root-partition kan krypteras för att förhindra datastöld vid förlust eller stöld av maskinen eller enheten där Slint är installerat. Då skriver du in en så kallad "lösenordsfras" för att låsa upp Slint -partitionen, vilket ger åtkomst till uppstartsmenyn. Vi kommer att spela in detta lösenord

source: using a "us" keyboard map
de_de: Verwendung einer „us“ Tastaturbelegung
sv_se: använder "us" tangentbordslayout

source: Do you want to encrypt $NAME? type yes, no or h for help.
de_de: Wollen Sie $NAME verschlüsseln? Geben Sie yes, no oder h für Hilfe ein.
sv_se: Vill du kryptera $NAME? skriv in yes, no eller h för hjälp.

source: We are ready to do what you requested: Install Slint on this drive: $NAME $VEND $MOD size ${SIZEG}G
de_de: Wir sind bereit, Ihre Anweisungen auszuführen: Slint auf diesem Laufwerk installieren: $NAME $VEND $MOD; Größe: ${SIZEG}G
sv_se: Vi är redo att göra det du har begärt: Installera Slint på denna enhet: $NAME $VEND $MOD storlek ${SIZEG}G

source: All data previously stored on it will be deleted.
de_de: Alle zuvor gespeicherten Daten werden gelöscht.
sv_se: Alla data som tidigare lagrats på den kommer att tas bort.

source: We are ready to do what you requested: Install Slint on this partition: $NAME, size ${SIZEG}G, file system $FSTYPE All data previously stored on it will be deleted but the contents of other partitions on $PKNAME will be preserved.
de_de: Wir sind bereit, Ihre Anweisungen auszuführen: Slint auf dieser Partition installieren: $NAME, Größe ${SIZEG}G, mit dem Dateisystem $FSTYPE. Alle zuvor darauf gespeicherten Daten werden gelöscht, aber der Inhalt von anderen Partitionen auf $PKNAME wird beibehalten.
sv_se: Vi är redo att göra det du har begärt: Installera slint på den här partitionen: $NAME, storlek ${SIZEG}G, filsystem $FSTYPE All data som tidigare lagrats på den kommer att tas bort men innehållet i andra partitioner på $PKNAME kommer att bevaras.

source: The root partition will be encrypted.
de_de: Die Root-Partition wird verschlüsselt.
sv_se: Root-partitionen kommer att krypteras.

source: The Slint system partition will have a size of ${ROOTSIZE}G.
de_de: Die Slint-Systempartition wird eine Größe von ${ROOTSIZE}G haben.
sv_se: Slint-systempartitionen kommer att ha storleken ${ROOTSIZE}G.

source: A "$ADDEDPARTNAME" partition of size ${ADDEDPARTSIZE}G will be set up.
de_de: Es wird eine Partition "$ADDEDPARTNAME" mit der Größe ${ADDEDPARTSIZE}G eingerichtet.
sv_se: En "$ADDEDPARTNAME"-partition med storleken ${ADDEDPARTSIZE}G kommer att ställas in.

source: A space of size ${GAVAILABLE}G will stay free after the last partition.
de_de: Ein Speicherplatz der Größe ${GAVAILABLE}G bleibt nach der letzten Partition frei.
sv_se: Ett utrymme av storlek ${GAVAILABLE}G förblir fritt efter den sista partitionen.

source: Partitions listed below will be accessible:
de_de: Unten aufgeführte Partitionen werden erreichbar sein:
sv_se: De partitioner som anges nedan kommer att vara tillgängliga:

source: If you confirm these settings they will be applied, else you will go back to the greeting screen of the installer.
de_de: Wenn Sie diese Einstellungen bestätigen, werden sie angewendet, sonst werden Sie zum Begrüßungsbildschirm des Installers zurückkehren.
sv_se: Om du bekräftar dessa inställningar kommer de att tillämpas, annars går du tillbaka till välkomstskärmen i installationsprogrammet.

source: To confirm these settings type yes, else type no:
de_de: Um diese Einstellungen zu bestätigen, geben Sie yes ein, sonst no:
sv_se: För att bekräfta dessa inställningar, skriv yes, annars skriv no:

source: You can redo a configuration.
de_de: Sie können eine Konfiguration wiederholen.
sv_se: Du kan göra om en konfiguration.

source: We prepare $DRIVEPATH to install Slint...
de_de: Wir bereiten $DRIVEPATH für die Installation von Slint vor...
sv_se: Vi förbereder $DRIVEPATH för att installera Slint...

source: We will now record the passphrase to use to unlock the drive $DRIVEPATH
de_de: Wir werden nun die Passphrase zum entsperren des Laufwerks $DRIVEPATH aufzeichnen.
sv_se: Vi kommer nu att spela in den lösenordsfras som ska användas för att låsa upp enheten $DRIVEPATH

source: It should include at least one capital letter, one lower case letter, one digit and one punctuation sign and have at least 8 characters. Write it in a safe place first!
de_de: Sie sollte mindestens einen Großbuchstaben, einen Kleinbuchstaben, eine Ziffer und ein Satzzeichen enthalten und mindestens 8 Zeichen lang sein. Schreiben Sie sie zuerst an einem sicheren Ort auf!
sv_se: Den bör innehålla minst en bokstav, en gemen, en siffra och ett skiljetecken och har minst 8 tecken. Skriv det på ett säkert ställe först!

source: You are currently using a "$KEYMAP" keyboard map, but when you will type the passphrase to unlock the drive a "us" keyboard map will be set up. For this reason we will now display the typed characters using an "us" keyboard map.
de_de: Sie verwenden derzeit eine "$KEYMAP"-Tastaturbelegung, aber wenn Sie die Passphrase zum Entsperren des Laufwerks eingeben, wird eine "us"-Tastaturbelegung eingerichtet. Aus diesem Grund werden wir nun die eingegebenen Zeichen mit einer "us"-Tastaturbelegung anzeigen.
sv_se: Du använder för närvarande en "$KEYMAP"-tangentbordslayout, men när du skriver lösenordsfras för att låsa upp enheten kommer en "us"-tangentbordslayout att ställas in. Av den anledningen visar vi nu de skrivna tecknen med hjälp av en "us"-tangentbordslayout.

source: Passphrase (h for help):
de_de: Passphrase (h für Hilfe):
sv_se: Lösenordsfras (h för hjälp):

source: The passphrase may only contain ASCII characters
de_de: Die Passphrase darf nur ASCII-Zeichen enthalten
sv_se: Lösenordsfrasen får endast innehålla ASCII-tecken

source: The passphrase should have at least 8 characters.
de_de: Das Passwort sollte mindestens 8 Zeichen lang sein.
sv_se: Lösenordsfrasen ska ha minst 8 tecken.

source: The passphrase should include at least one lower case letter.
de_de: Die Passphrase sollte mindestens einen Kleinbuchstaben enthalten.
sv_se: Lösenordsfrasen bör innehålla minst en liten bokstav.

source: The passphrase should include at least one capital letter.
de_de: Die Passphrase sollte mindestens einen Großbuchstaben enthalten.
sv_se: Lösenordsfrasen bör innehålla minst en stor bokstav.

source: The passphrase should include at least one digit.
de_de: Die Passphrase sollte mindestens eine Ziffer enthalten.
sv_se: Lösenordsfrasen bör innehålla minst en siffra.

source: The passphrase should include at least one punctuation character.
de_de: Die Passphrase sollte mindestens ein Satzzeichen enthalten.
sv_se: Lösenordsfrasen ska innehålla minst ett skiljetecken.

source: Please type again the passphrase, to check:
de_de: Bitte geben Sie das Passwort erneut ein, um es zu überprüfen:
sv_se: Skriv in lösenordsfrasen igen för att kontrollera:

source: Passphrases do not match. please try again.
de_de: Die Passphrasen stimmen nicht überein. Bitte versuchen Sie es erneut.
sv_se: Lösenordsfraserna stämmer inte överens. Försök igen.

source: Encrypting the root Slint partition...
de_de: Die Slint-Root-Partition wird verschlüsselt...
sv_se: Krypterar Slint root-partition...

source: Installing the first software packages...
de_de: Die ersten Softwarepakete werden installiert...
sv_se: Installerar de första programvarupaketen...

source: Generating a decryption keyfile...
de_de: Eine Schlüsseldatei wird generiert...
sv_se: Genererar en dekrypteringsnyckelfil...

source: The user "root" has all rights on the system, including to wipe it. This status should be accessed only with a good password.
de_de: Der Benutzer "root" hat alle Rechte auf dem System, auch um es zu löschen. Dieser Status sollte nur mit einem guten Passwort erreicht werden.
sv_se: Användaren "root" har alla rättigheter på systemet, inklusive att radera den. Denna status bör endast accessas med ett bra lösenord.

source: Please type the password for $THISUSER:
de_de: Bitte geben Sie das Passwort für $THISUSER ein:
sv_se: Skriv lösenordet för $THISUSER:

source: The password should have at least 6 characters.
de_de: Das Passwort sollte mindestens 6 Zeichen lang sein.
sv_se: Lösenordet bör innehålla minst 6 tecken.

source: Please type again the password for $THISUSER, to check:
de_de: Bitte geben Sie das Passwort für $THISUSER erneut ein, um es zu überprüfen:
sv_se: Vänligen skriv lösenordet för $THISUSER igen för att kontrollera:

source: Passwords do not match. please try again.
de_de: Passwörter stimmen nicht überein, bitte versuche es erneut.
sv_se: Lösenordsfraserna stämmer inte överens. Försök igen.

source: We will now set up an account for a regular user. Other user accounts can be set up after installation. We need to know under which name this user will log in to access Slint.
de_de: Nun wird ein Konto für einen regulären Benutzer eingerichtet. Andere Benutzerkonten können nach der Installation eingerichtet werden. Es wird ein Name benötigt, unter dem sich dieser Benutzer anmelden wird, um auf Slint zuzugreifen.
sv_se: Vi kommer nu att skapa ett konto för en vanlig användare. Andra användarkonton kan konfigurera efter installationen. Vi behöver veta under vilket namn den här användaren loggar in för att komma åt Slint.

source: Login name of the first registered user:
de_de: Anmeldename des ersten registrierten Benutzers:
sv_se: Inloggningsnamn för den första registrerade användaren:

source: The username should not begin with a '_'
de_de: Der Benutzername sollte nicht mit einem '_' beginnen
sv_se: Användarnamnet får inte börja med ett '_'

source: The user name should only contains non accented lower case letters, digits from 0 to 9, '_' or '-'
de_de: Der Benutzername sollte nur Kleinbuchstaben ohne Umlaute, Ziffern von 0 bis 9, '_' oder '-' enthalten.
sv_se: Användarnamnet får endast innehålla små bokstäver utan accent, och siffror från 0 till 9, "_" eller "-"

source: Blind users can run Slint with a Braille device or a screen reader.
de_de: Blinde Benutzer können Slint mit einem Braille-Gerät oder einem Screenreader nutzen.
sv_se: Blind användare kan köra Slint med en punktskriftsenhet eller en skärmläsare.

source: Will you use a Braille device? Please answer yes or no:
de_de: Wollen Sie ein Braille-Gerät verwenden? Bitte antworten Sie mit yes oder no:
sv_se: Kommer du att använda en Braille-enhet? Vänligen svara yes eller no:

source: Do you want to start Slint in a console or in graphical mode?
de_de: Möchten Sie Slint in einer Konsole oder im grafischen Modus starten?
sv_se: Vill du starta Slint i en konsol eller i grafiskt läge?

source: Type c for console or g for graphical, or h for help then press Enter:
de_de: Geben Sie c für Konsole oder g für grafisch oder h für Hilfe ein und drücken Sie die Eingabetaste:
sv_se: Skriv c för konsol eller g för grafik, eller h för hjälp och tryck sedan på Enter:

source: In the next dialog, you will choose the language for your Slint System.
de_de: Im nächsten Dialog wählen Sie die Sprache Ihres Slint-Systems.

source: Press Enter to continue:
de_de: Drücken Sie die Eingabetaste, um fortzufahren:
sv_se: Tryck Enter för att fortsätta:

source: Please wait...
de_de: Bitte warten...
sv_se: Vänligen vänta...

source: An internet connection would allow to get software packages newer than those shipped with the installer, but we couldn't get a wired connection.
de_de: Eine Internetverbindung würde es ermöglichen, neuere Softwarepakete zu erhalten, eine kabelgebundene Verbindung konnte aber nicht hergestellt werden.
sv_se: En internetanslutning skulle göra det möjligt att hämta programpaket nyare än som levererades med installationsprogrammet, men vi kunde inte få en trådbunden anslutning.

source: Should we try to get a wifi connection? Please type yes or no:
de_de: Soll versucht werden, eine WLAN-Verbindung herzustellen? Bitte tippen Sie yes oder no:
sv_se: Ska vi försöka få en wifi-anslutning? Vänligen skriv yes eller no:

source: Scanning the wifi networks...
de_de: Scanne die WLAN-Netzwerke...
sv_se: Skannar wifi-nätverken...

source: No wifi network detected.
de_de: Kein WLAN-Netzwerk erkannt.
sv_se: Inget wifi-nätverk upptäcktes.

source: SSID (network name) or l to get a list:
de_de: SSID (Netzwerkname) oder l, um eine Liste zu erhalten:
sv_se: SSID (nätverksnamn) eller l för att få en lista:

source: Wrong SSID.
de_de: Falsche SSID.
sv_se: Fel SSID.

source: Press Enter to try again or type q to give up:
de_de: Drücken Sie die Eingabetaste, um es erneut zu versuchen, oder geben Sie q ein, um aufzugeben:
sv_se: Tryck på Enter för att försöka igen eller skriv q för att ge upp:

source: A WPA passphrase should have between 8 and 63 characters
de_de: Eine WPA-Passphrase sollte zwischen 8 und 63 Zeichen lang sein
sv_se: WPA lösenordsfras måste vara mellan 8 och 63 tecken

source: Wrong passphrase. Press Enter to try again or type q to quit:
de_de: Falsche Passphrase. Drücken Sie die Eingabetaste, um es erneut zu versuchen, oder geben Sie q ein, um zu beenden:
sv_se: Fel lösenordsfras. Tryck på Enter för att försöka igen eller skriv q för att avsluta:

source: Wifi connection failed. Wrong passphrase?
de_de: WLAN-Verbindung fehlgeschlagen. Falsche Passphrase?
sv_se: WiFi-anslutning misslyckades. Fel lösenordsfras?

source: Press Enter to try again or type q to quit:
de_de: Drücken Sie die Eingabetaste, um es erneut zu versuchen, oder geben Sie q ein, um den Vorgang zu beenden:
sv_se: Tryck på Enter för att försöka igen eller skriv q för att avsluta:

source: Are credentials requested to use $SSID? Type yes or no:
de_de: Soll $SSID für die Verbindung verwendet werden? Geben Sie yes oder no ein:
sv_se: Behöver du autentiseringsuppgifter för att använda $SSID? Skriv yes eller no:

source: Wifi connection failed.
de_de: WLAN-Verbindung fehlgeschlagen.
sv_se: WiFi-anslutning misslyckades.

source: You will now type the credentials in a web browser.
de_de: Geben Sie nun die Zugangsdaten in einen Webbrowser ein.
sv_se: Du ska nu skriva in inloggningsuppgifterna i en webbläsare.

source: When done press Q to quit the browser.
de_de: Wenn Sie fertig sind, drücken Sie Q, um den Browser zu verlassen.
sv_se: När du är klar trycker du på Q för att avsluta webbläsaren.

source: Press Enter to start the browser or type h for help on its usage:
de_de: Drücken Sie die Eingabetaste, um den Browser zu starten, oder geben Sie h ein, um Hilfe zur Verwendung des Browsers zu erhalten:
sv_se: Tryck på Enter för att starta webbläsaren eller skriv h för hjälp med dess användning:

source: Please type the password for $SSID, or q to give up using wifi:
de_de: Bitte geben Sie das Passwort für $SSID ein, oder q, um die Verwendung des WLANs zu beenden:
sv_se: Skriv lösenordet för $SSID, eller q för att ge upp med wifi:

source: A password is requested.
de_de: Es wird ein Passwort benötigt.
sv_se: Ett lösenord begärs.

source: Wrong password. Try again.
de_de: Falsches Passwort, bitte versuchen Sie es erneut.
sv_se: Fel lösenord. Försök igen.

source: Setting of the time zone.
de_de: Einstellung der Zeitzone.
sv_se: Inställning av tidszon.

source: Is $PROPOSEDTZ the current time zone? type yes or no:
de_de: Ist $PROPOSEDTZ die aktuelle Zeitzone? Geben Sie yes oder no ein:
sv_se: Är $PROPOSEDTZ den aktuella tidszonen? skriv yes eller no:

source: You can set the time zone now, or accept the default value (UTC) and modify this setting after installation.
de_de: Sie können die Zeitzone jetzt festlegen oder den Standardwert (UTC) akzeptieren und diese Einstellung nach der Installation ändern.
sv_se: Du kan ange tidszonen nu, eller acceptera standardvärdet (UTC) och ändra inställningen efter installationen.

source: To set the time zone now type yes, else type no:
de_de: Um die Zeitzone jetzt einzustellen, geben Sie yes ein, andernfalls geben Sie nein no:
sv_se: För att ställa in tidszonen skriver du yes, annars skriver du no:

source: We will now install all packages. This takes about 10 to 40 minutes.
de_de: Nun werden alle Pakete installiert. Das dauert etwa 10 bis 40 Minuten.
sv_se: Vi kommer nu att installera alla paket, vilket tar ca 10 till 40 minuter.

source: Do you want a short description of each package during its installation?
de_de: Möchten Sie während der Installation eine kurze Beschreibung für jedes Paket erhalten?
sv_se: Vill du ha en kort beskrivning av varje paket under installationen?

source: Please type yes or no:
de_de: Bitte tippen Sie yes oder no:
sv_se: Vänligen tryck yes eller no:

source: Installing the packages. Please be patient.
de_de: Die Pakete werden installiert. Bitte warten.
sv_se: Installera paketen. Ha tålamod.

source: Preparing packages installation...
de_de: Die Installation der Pakete wird vorbereitet...
sv_se: Förbereder paketinstallation...
