Repository: DidierSpaier/slint-translations
Catalog: translations20220904/slint-scripts/*.slint_scripts.po
Languages: el_gr, sv_se

source: Installer documentation
el_gr: Τεκμηρίωση εγκατάστασης
sv_se: Installationsdokumentation

source: Navigate in this menu with the up and down arrow keys. Press Enter to read a highlighted document. Press Q to stop reading a document and go back to the menu. Press Escape to quit.
el_gr: Πλοηγηθείτε σε αυτό το μενού με τα πλήκτρα βέλους πάνω και κάτω. Πατήστε Enter για να διαβάσετε ένα επισημασμένο έγγραφο. Πατήστε Q για να σταματήσετε να διαβάζετε ένα έγγραφο και να επιστρέψετε στο μενού. Πατήστε Escape για να κλείσετε.
sv_se: Navigera i den här menyn med upp-och nedåt-pilarna. Tryck på Enter om du vill läsa ett markerat dokument. Tryck på Q om du vill sluta läsa ett dokument och gå tillbaka till menyn. Tryck på Escape för att avsluta.

source: Presentation of the Slint installer.
el_gr: Παρουσίαση του εγκαταστάτη Slint.
sv_se: Presentation av installationsprogrammet Slint.

source: How-to use the installer
el_gr: Πώς να χρησιμοποιήσετε τον εγκαταστάτη
sv_se: Hur du använder installationsprogrammet

source: The automatic installation mode
el_gr: Η λειτουργία αυτόματης εγκατάστασης
sv_se: Det automatiska installationsläget

source: Slint in an encrypted drive
el_gr: Slint σε μια κρυπτογραφημένη μονάδα δίσκου
sv_se: Slint på en krypterad enhet

source: The manual installation mode
el_gr: Η λειτουργία χειροκίνητης εγκατάστασης
sv_se: Det manuella installationsläget

source: How to make room for Slint on a drive
el_gr: Πώς να κάνετε χώρο για το Slint σε μια μονάδα δίσκου
sv_se: Hur du gör plats för Slint på en enhet

source: Glossary of technical terms used in the documentation
el_gr: Γλωσσάριο τεχνικών όρων που χρησιμοποιούνται στην τεκμηρίωση
sv_se: Ordlista över tekniska termer som används i dokumentationen

source: key bindings for the speakup screen reader
el_gr: συντομεύσεις πλήκτρων για την ανάγνωση οθόνης ομιλίας
sv_se: tangentbindningar för speakup skärmläsaren

source: First steps after Slint installation
el_gr: Πρώτα βήματα μετά την εγκατάσταση του Slint
sv_se: Första stegen efter Slint-installationen

source: Welcome back to the menu of the Slint installer Available commands (do not type the quotes): 'doc' to know the features and usage of the installer. 'auto' to start a semi-automatic, guided installation. 'setup' to start a manual installation. We recommend that you type 'doc' first, especially if you want to use the 'Manual' installation mode or want that the installer encrypt the drive where Slint will be installed. When done reading you will go back to this menu.
el_gr: Καλώς ήρθατε πίσω στο μενού του προγράμματος εγκατάστασης Slint Διαθέσιμες εντολές (μην πληκτρολογήσετε τα εισαγωγικά): 'doc' για να γνωρίζετε τα χαρακτηριστικά και τη χρήση του προγράμματος εγκατάστασης. 'αυτόματο' για να ξεκινήσει μια ημι-αυτόματη, καθοδηγούμενη εγκατάσταση. 'εγκατάσταση' για να ξεκινήσει μια χειροκίνητη εγκατάσταση. Σας συνιστούμε να πληκτρολογήσετε πρώτα το 'doc', ειδικά αν θέλετε να χρησιμοποιήσετε τη 'Χειροκίνητη' λειτουργία εγκατάστασης ή θέλετε ο εγκαταστάτης να κρυπτογραφήσει τη μονάδα δίσκου όπου θα εγκατασταθεί το Slint. Όταν γίνει η ανάγνωση, θα επιστρέψετε σε αυτό το μενού.
sv_se: Välkommen tillbaka till menyn i Slint-installeraren Tillgängliga kommandon (ange inte citattecknen): 'doc' för att känna till funktionerna och användningen av installationsprogrammet. 'auto' för att starta en halvautomatisk, vägledd installation. "setup" för att starta en manuell installation. Vi rekommenderar att du skriver "doc" först, särskilt om du vill använda 'Manuell' installationsläget eller vill att installationsprogrammet ska kryptera enheten där Slint kommer att installeras. När du har läst klart går du tillbaka till den här menyn.

source: Please run this script as root.
el_gr: Παρακαλώ εκτελέστε αυτό το σενάριο ως root.
sv_se: Vänligen kör detta skript som rot.

source: KDE is not installed.
el_gr: Το KDE δεν είναι εγκατεστημένο.
sv_se: KDE är inte installerat.

source: This script includes KDE applications in the menus of KDE only, for all users. This can be reverted with the command show-kde-apps.
el_gr: Αυτό το σενάριο περιλαμβάνει εφαρμογές KDE μόνο στα μενού του KDE, για όλους τους χρήστες. Αυτό μπορεί να αναστραφεί με την εντολή show-kde-apps.
sv_se: Detta skript inkluderar endast KDE-program i KDE's menyer för alla användare. Detta kan återställas med kommandot show-kde-apps.

source: To confirm press Y else press N:
el_gr: Για να επιβεβαιώσετε τον Τύπο Ν:
sv_se: För att bekräfta tryck på Y annars tryck på N:

source: Nothing done.
el_gr: Τίποτα δεν έγινε.
sv_se: Ingenting gjort.

source: All done.
el_gr: Όλα έγιναν.
sv_se: Allt klart.

source: This script should be run as root.
el_gr: Αυτό το σενάριο θα πρέπει να εκτελείται ως root.
sv_se: Detta skript skall köras som root.

source: Usage: login-chooser <login manager>
el_gr: Χρήση: επιλογή σύνδεσης <login manager>
sv_se: Användning: login-chooser <login manager>

source: Available login managers:
el_gr: Διαθέσιμοι διαχειριστές σύνδεσης:
sv_se: Tillgängliga inloggningshanterare:

source: Short descriptions:
el_gr: Σύντομες περιγραφές:
sv_se: Kort beskrivning:

source: text: Login in text mode, in a console. From there, you can type "startx" to start a graphical session.
el_gr: κείμενο: Σύνδεση σε κατάσταση κειμένου, σε μια κονσόλα. Από εκεί, εσείς μπορείτε να πληκτρολογήσετε "startx" για να ξεκινήσετε μια γραφική συνεδρία.
sv_se: text: Logga in i textläge, i en konsol. Därifrån kan du skriva "startx" för att starta en grafisk session.

source: lightdm: Light Display Manager, accessible with speech.
el_gr: lightdm: Light Display Manager, προσβάσιμο με ομιλία.
sv_se: lightdm: Light Display Manager, tillgänglig med tal.

source: kdm: KDE Display Manager.
el_gr: kdm: Διαχειριστής εμφάνισης του KDE.

source: gdm: GNOME Display Manager, fully accessible with speech.
el_gr: gdm: GNOME Display Manager, πλήρως προσβάσιμο με ομιλία.
sv_se: gdm: GNOME Display Manager, fullt tillgängligt med tal.

source: xdm: X Display Manager.
el_gr: xdm: Διαχειριστής εμφάνισης X.

source: Login is currently set to text mode.
el_gr: Η σύνδεση έχει οριστεί σε λειτουργία κειμένου.
sv_se: Inloggning är för närvarande inställd på textläge.

source: The display manager ${dm} is currently set.
el_gr: Ο διαχειριστής εμφάνισης ${dm} έχει ρυθμιστεί.
sv_se: Displayhanteraren ${dm} är för närvarande inställd.

source: To reboot immediatly press R then Enter, else just press Enter.
el_gr: Για να επανεκκινήσετε αμέσως πατήστε το πλήκτρο R και μετά το Enter, αλλιώς πατήστε το πλήκτρο Enter.
sv_se: Tryck sedan på R för att starta om direkt, annars trycker du bara på Enter.

source: If you want speech at login press S then Enter, else just press Enter.
el_gr: Αν θέλετε ομιλία κατά τη σύνδεση πατήστε S τότε Enter, αλλιώς πατήστε Enter.
sv_se: Om du vill ha tal vid inloggningen tryck S sedan Enter, annars trycker du bara på Enter.

source: You will have speech at login.
el_gr: Θα έχετε ομιλία κατά τη σύνδεση.
sv_se: Du kommer att ha tal vid inloggning.

source: You won't have speech at login.
el_gr: Δεν θα έχετε ομιλία κατά τη σύνδεση.
sv_se: Du kommer inte att ha tal vid inloggning.

source: "$1" is not among the available login managers:
el_gr: Το "$1" δεν είναι μεταξύ των διαθέσιμων διαχειριστών σύνδεσης:
sv_se: "$1" hör inte till de tillgängliga inloggningshanterarna:

source: Login will occur in text mode on next boot.
el_gr: Η σύνδεση θα συμβεί σε λειτουργία κειμένου στην επόμενη εκκίνηση.
sv_se: Inloggning kommer att ske i textläge vid nästa uppstart.

source: If you need speech type one of these commands before rebooting:
el_gr: Εάν χρειάζεστε ομιλία, πληκτρολογήστε μία από αυτές τις εντολές πριν από την επανεκκίνηση:
sv_se: Om du behöver tal skriv in ett av dessa kommandon innan du startar om:

source: The display manager $choice will be in use on next boot.
el_gr: Ο διαχειριστής οθόνης $choice θα χρησιμοποιηθεί στην επόμενη εκκίνηση.
sv_se: Displayhanteraren $choice kommer att användas vid nästa uppstart.

source: Unknown choice. Check your spelling.
el_gr: Άγνωστη επιλογή. Ελέγξτε την ορθογραφία σας.
sv_se: Okänt val. Kontrollera din stavning.

source: Please run this script as regular user.
el_gr: Παρακαλώ εκτελέστε αυτό το σενάριο ως κανονικός χρήστης.
sv_se: Vänligen kör detta skript som vanlig användare.

source: Orca has been disabled for user $username.
el_gr: Το Orca έχει απενεργοποιηθεί για το χρήστη $username.
sv_se: Orca har inaktiverats för användaren $username.

source: File ~/.config/autostart/startorca.desktop not found.
el_gr: Το αρχείο ~/.config/autostart/startorca.desktop δεν βρέθηκε.
sv_se: Filen ~/.config/autostart/startorca.desktop hittades inte.

source: Start a graphical environment as root with speech is not advisable. Please run this script as regular user.
el_gr: Η εκκίνηση ενός γραφικού περιβάλλοντος ως root με ομιλία δεν συνιστάται. Παρακαλώ εκτελέστε αυτό το σενάριο ως κανονικός χρήστης.
sv_se: Starta en grafisk miljö som root med tal är inte lämpligt. Kör det här skriptet som vanlig användare.

source: Orca has been enabled for user $username.
el_gr: Το Orca έχει ενεργοποιηθεί για το χρήστη $username.
sv_se: Orca har aktiverats för användaren $username.

source: Slint for the visually impaired
el_gr: Slint για άτομα με προβλήματα όρασης
sv_se: Slint för synskadade

source: Navigate in this sub-menu with the up and down arrow keys. Press Enter to read a highlighted document. Press Q to stop reading a document and go back to this sub-menu. Press Escape to return to the main menu.
el_gr: Πλοηγηθείτε σε αυτό το υπομενού με τα πλήκτρα πάνω και κάτω βέλους. Πατήστε Enter για να διαβάσετε ένα επιλεγμένο έγγραφο. Πατήστε Q για να σταματήσετε την ανάγνωση ενός εγγράφου και να επιστρέψετε σε αυτό το υπομενού. Πατήστε Απόδραση για να επιστρέψετε στο κύριο μενού.
sv_se: Navigera i den här menyn med upp-och nedåt-pilarna. Tryck på Enter om du vill läsa ett markerat dokument. Tryck på Q om du vill sluta läsa ett dokument och gå tillbaka till menyn. Tryck på Escape för att avsluta.

source: Accessibility HowTo
el_gr: Προσβασιμότητα Howto
sv_se: Hjälpmedel HowTo

source: Key bindings for Compiz
el_gr: Δεσμοί πλήκτρων για το Compiz
sv_se: Tangentbindningar för Compiz

source: Key bindings for Mate
el_gr: Δεσμοί πλήκτρων για το Mate
sv_se: Tangentbindningar för Mate

source: Espeakup usage
el_gr: Χρήση Espeakup
sv_se: Användning av Espeakup

source: Fenrir usage
el_gr: Χρήση Fenrir
sv_se: Fenrir-användning

source: How-to use the MBROLA voices
el_gr: Πώς να χρησιμοποιήσετε τις φωνές MBROLA
sv_se: Hur du använder MBROLA-rösterna

source: SpeechD-El usage
el_gr: Χρήση SpeechD-El
sv_se: Användning av SpeechD-El

source: SpeechD-Up usage
el_gr: Χρήση SpeechD- Up
sv_se: Användning av SpeechD-Up

source: How-to make Slint speak (or not).
el_gr: Πώς να κάνετε το Slint να μιλήσει (ή όχι).
sv_se: Att få Slint att tala (eller inte).

source: Speakup key bindings with a numeric keypad
el_gr: Συντομεύσεις πλήκτρων Speakup με αριθμητικό πληκτρολόγιο
sv_se: Speakup-tangentbindningar med en numerisk knappsats

source: Speakup key bindings without numeric keypad
el_gr: Συντομεύσεις πλήκτρων Speakup χωρίς αριθμητικό πληκτρολόγιο
sv_se: Speakup tangentbindningar utan numerisk knappsats

source: Voices and TTS in Slint
el_gr: Φωνές και TTS στο Slint
sv_se: Röster och TTS i Slint

source: Speakup guide (kernel documentation)
el_gr: Οδηγός Speakup (τεκμηρίωση πυρήνα)
sv_se: Speakup guide (kärndokumentation)

source: How to localize shell scripts
el_gr: Πώς να εντοπίσετε σενάρια κελύφους
sv_se: Hur man lokaliserar skalskript

source: General presentation
el_gr: Γενική παρουσίαση
sv_se: Allmän presentation

source: Processes diagrams
el_gr: Διεργασίες διαγράμματα
sv_se: Bearbetar diagram

source: Internationalization process
el_gr: Διαδικασία διεθνοποίησης
sv_se: Internationaliseringsprocess

source: Localization, usage and maintenance processes
el_gr: Διαδικασίες εντοπισμού, χρήσης και συντήρησης
sv_se: Lokalisering, användnings-och underhållsprocesser

source: Recommendations for developers and maintainers
el_gr: Συστάσεις για προγραμματιστές και συντηρητές
sv_se: Rekommendationer för utvecklare och underhållare

source: Recommendations for translators
el_gr: Συστάσεις για μεταφραστές
sv_se: Rekommendationer för översättare

source: How to display man pages in Persian
el_gr: Πώς να εμφανίσετε τις σελίδες man στα περσικά
sv_se: Hur man visar man-sidor på persiska

source: How to in English (Portable Document)
el_gr: Πώς να στα αγγλικά (Portable Document)
sv_se: Howto på engelska (Portabelt Dokument)

source: How to in Persian (Portable Document)
el_gr: Πώς να στα περσικά (Portable Document)
sv_se: Howto på persiska (Portabelt Dokument)

source: Slint documentation
el_gr: Τεκμηρίωση Slint
sv_se: Slint dokumentation

source: Presentation of the Slint project
el_gr: Παρουσίαση του έργου Slint
sv_se: Presentation av Slint-projektet

source: >> Slint for the visually impaired (sub-menu)
el_gr: > > Slint για άτομα με προβλήματα όρασης (υπομενού)
sv_se: >> Slint för synskadade (undermeny)

source: Announce of Slint64-14.2.1.2
el_gr: Ανακοίνωση του Slint64-14.2.1.2
sv_se: Tillkännagiva Slint64-14.2.1.2

source: Introduction - Slint documentation
el_gr: Εισαγωγή-Τεκμηρίωση Slint
sv_se: Introduktion - Slint dokumentation

source: How to upgrade the kernels provided by Slint
el_gr: Πώς να αναβαθμίσετε τους πυρήνες που παρέχονται από το Slint
sv_se: Hur man uppgraderar kärnor som tillhandahålls av Slint

source: >> How-to localize shell scrips (sub-menu)
el_gr: >> Τρόπος τοπικής προσαρμογής σεναρίου φλοιού (υπομενού)
sv_se: >> Hur man lokaliserar skalskript (undermeny)

source: >> How-to display man pages in Persian (sub-menu)
el_gr: >> Πώς να εμφανίσετε τις σελίδες man στα περσικά (υπο-μενου)
sv_se: >> Hur man visar man-sidor på persiska (under-meny)

source: How to manage network connections
el_gr: Πώς να διαχειριστείτε τις συνδέσεις δικτύου
sv_se: Hur man hanterar nätverksanslutningar

source: What's new in Slint64-14.2.1.2
el_gr: Τι νέο υπάρχει στο Slint64-14.2.1.2
sv_se: Vad är nytt i Slint64-14.2.1.2

source: Presentation of Slint64-14.2.1.2
el_gr: Παρουσίαση του Slint64-14.2.1.2
sv_se: Presentation av Slint64-14.2.1.2

source: Create and maintain a portable Slint
el_gr: Δημιουργία και διατήρηση φορητού Slint
sv_se: Skapa och underhålla en portabel slint

source: Software Management in Slint
el_gr: Διαχείριση λογισμικού στο Slint
sv_se: Programvaruhantering i Slint

source: Manage the sound in Slint
el_gr: Διαχείριση του ήχου στο Slint
sv_se: Hantera ljud i Slint

source: Utilities to manage your Slint system
el_gr: Βοηθήματα για τη διαχείριση του συστήματος Slint
sv_se: Verktyg för att hantera ditt slint-system

source: Running a graphical session as root is not allowed.
el_gr: Η εκτέλεση μιας γραφικής συνεδρίας ως root δεν επιτρέπεται.
sv_se: Att köra en grafisk session som rot är inte tillåtet.

source: Usage: $0 <desktop session> Available desktop sessions:
el_gr: Χρήση: $0 <desktop session> Διαθέσιμες συνεδρίες:
sv_se: Syntax: $0 <desktop session> Tillgängliga skrivbordssessioner:

source: The session is currently set for $USER to
el_gr: Η συνεδρία έχει οριστεί για $USER σε
sv_se: Sessionen är för närvarande inställd för $USER till

source: $1 not found among the available sessions
el_gr: $1 δεν βρέθηκε μεταξύ των διαθέσιμων χρήσεων
sv_se: $1 hittades inte bland de tillgängliga sessionerna

source: The current session is
el_gr: Η τρέχουσα συνεδρία είναι
sv_se: Den aktuella sessionen är

source: A default session $thissession has been set for ${USER}.
el_gr: Μια προεπιλεγμένη συνεδρία $thissession έχει οριστεί για ${USER}.
sv_se: En standardsession $thissession har ställts in för ${USER}.

source: Usage: $program_name username.
el_gr: Χρήση: $program_name όνομα χρήστη.
sv_se: Användning: $program_name användarnamn.

source: This script should be run as root, for a regular user account that has just been created. To set your default session as regular user, use session-chooser instead. errors go to /tmp/setsession-errors
el_gr: Αυτό το σενάριο θα πρέπει να εκτελείται ως root, για έναν κανονικό λογαριασμό χρήστη που μόλις δημιουργήθηκε. Για να ορίσετε την προεπιλεγμένη συνεδρία ως κανονικό χρήστη, χρησιμοποιήστε τον επιλογέα συνεδρίας. τα σφάλματα πηγαίνουν στο /tmp/setsession-errors
sv_se: Detta skript bör köras som root, för ett vanligt användarkonto som just har skapats. För att ställa in din standardsession som vanlig användare, använd session-chooser istället. fel går till /tmp/setsession-error

source: No system wide default session has been set.
el_gr: Δεν έχει οριστεί προεπιλεγμένη συνεδρία συστήματος.
sv_se: Ingen systemomfattande standardsession har angetts.

source: No home directory for user $user. Does it exist?
el_gr: Δεν υπάρχει κατάλογος για το χρήστη $user. -Υπάρχει;
sv_se: Ingen hemkatalog för användaren $user. Existerade den?

source: A default session has already been set for user $user.
el_gr: Μια προεπιλεγμένη συνεδρία έχει ήδη οριστεί για το χρήστη $user.
sv_se: En standardsession har redan ställts in för användaren $user.

source: A default session $xsession has been set for user $user.
el_gr: Μια προεπιλεγμένη συνεδρία $xsession έχει οριστεί για $user.
sv_se: En standardsession $xsession har ställts in för $user.

source: Only root is allowed to run this program.
el_gr: Μόνο το root επιτρέπεται να εκτελέσει αυτό το πρόγραμμα.
sv_se: Det är bara root som får köra det här programmet.

source: This script includes KDE applications in the menus of all graphical environments for all users, but the applications for personal information management, that however stay available from KDE. This can be reverted with the command hide-kde-apps.
el_gr: Αυτό το σενάριο περιλαμβάνει εφαρμογές του KDE στα μενού όλων των γραφικών περιβαλλόντων για όλους τους χρήστες, αλλά οι αιτήσεις για διαχείριση προσωπικών πληροφοριών που ωστόσο παραμένουν διαθέσιμες από το KDE. Αυτό μπορεί να επανέλθει με την εντολή hide-kde-apps.
sv_se: Det här skriptet innehåller KDE-program i menyerna för alla grafiska miljöer för alla användare, men programmen för personlig informationshantering, som dock är tillgängliga från KDE. Detta kan återföras med kommandot dölj-kde-apps.

source: This script lists languages and synthesizers available for applications relying on Speech Dispatcher, like Orca or speech-up. Each command below answers the question following it. Don't type the quotes surrounding the command.
el_gr: Αυτό το σενάριο παραθέτει τις γλώσσες και τα synthesizers διαθέσιμα για τις εφαρμογές βασίζεται σε Speech Dispatcher, όπως Orca ή το speech-up. Κάθε εντολή που ακολουθεί απαντά στην ερώτηση που ακολουθεί. Μην πληκτρολογήσετε τα εισαγωγικά που περιβάλλουν την εντολή.
sv_se: Detta skript listar språk och syntar tillgängliga för program förlitar sig på Speech Dispatcher, som Orca eller speech-up. Varje kommando nedan svarar på frågan efter den. Skriv inte citattecknen som omger kommandot.

source: "$program_name" usage?
el_gr: "$program_name" χρήση;
sv_se: "$program_name" användning?

source: "$program_name -s" available synthesizers?
el_gr: "$program_name -s " διαθέσιμα synthesizers;
sv_se: "$program_name -s" tillgängliga synthesizers?

source: "$program_name -l" available languages codes?
el_gr: "$program_name -l" διαθέσιμοι κωδικοί γλωσσών;
sv_se: "$program_name -l" tillgängliga språkkoder?

source: "$program_name -ls <synthesizer>" languages available for this synthesizer?
el_gr: "$program_name -- <synthesizer>" διαθέσιμες γλώσσες για αυτό το synthesizer;
sv_se: "$program_name -ls <synthesizer>" tillgängliga språk för denna synthesizer?

source: "$program_name -sl <language code>" synthesizers providing voices in this language?
el_gr: "$program_name -sl <language code>" συνθέτες που παρέχουν φωνές σε αυτή τη γλώσσα;
sv_se: "$program_name -sl <language code>" Synthesizer som tillhandahåller röster på det här språket?

source: The language code has most often two characters, like 'en' 'es' or 'fr'
el_gr: Ο κωδικός γλώσσας έχει συνήθως δύο χαρακτήρες, όπως 'en' '' ή 'fr'
sv_se: Språkkoden har oftast två tecken, som 'en' 'es' eller 'fr'

source: "$program_name $*" is not a valid command.
el_gr: "$program_name $* " δεν είναι έγκυρη εντολή.
sv_se: "$program_name $* " är inte ett giltigt kommando.

source: Installed synthesizers:
el_gr: Εγκατεστημένοι συνθέτες:
sv_se: Installerade synthesizers:

source: Available languages:
el_gr: Διαθέσιμες γλώσσες:
sv_se: Tillgängliga språk:

source: $parameter2 is not the name of an available synthesizer
el_gr: $parameter2 δεν είναι το όνομα ενός διαθέσιμου συνθέτη
sv_se: $parameter2 är inte namnet på en tillgänglig synthesizer

source: No information available about languages for $parameter2.
el_gr: Δεν υπάρχουν διαθέσιμες πληροφορίες σχετικά με τις γλώσσες για το $parameter2.
sv_se: Det finns ingen information tillgänglig om språk för $parameter2.

source: Available languages codes for $parameter2:
el_gr: Διαθέσιμοι κωδικοί γλωσσών για το $parameter2:
sv_se: Tillgängliga språkkoder för $parameter2:

source: No installed synthesizer provides the language $parameter2
el_gr: Κανένας εγκατεστημένος συνθέτης δεν παρέχει τη γλώσσα $parameter2
sv_se: Ingen installerad synthesizer tillhandahåller språket $parameter2

source: The language $parameter2 is provided by:
el_gr: Η γλώσσα $parameter2 παρέχεται από:
sv_se: Språket $parameter2 tillhandahålls av:

source: espeakup (Console screen reader connecting espeak-ng and speakup)\n
el_gr: espeakup (Κονσόλα ανάγνωσης οθόνης σύνδεσης espeak-ng και speakup)\n
sv_se: espeakup (konsolskärmsläsare som ansluter espeak-ng och speakup)\n

source: speechd-up (Console screen reader connecting Speech Dispatcher and speakup)\n
el_gr: espeakup (Κονσόλα ανάγνωσης οθόνης σύνδεσης espeak-ng και speakup)\n
sv_se: speechd-up (konsolskärmsläsare som ansluter Speech Dispatcher och speakup)\n

source: fenrir (Modular, flexible and fast console screen reader)\n
el_gr: fenrir (Modular, ευέλικτο και γρήγορο πρόγραμμα ανάγνωσης οθόνης κονσόλας)\n
sv_se: fenrir (modulär, flexibel och snabb konsolskärmläsare)\n

source: Usage: $program_name <screen reader> or <hard synthesizer> or none
el_gr: Χρήση: $program_name <screen reader> ή <hard synthesizer> ή κανένα
sv_se: Användning: $program_name <screen reader> eller <hard synthesizer> eller ingen

source: Choose a console screen reader to talk with among:
el_gr: Επιλέξτε μια λειτουργία ανάγνωσης οθόνης κονσόλας για να μιλήσετε μεταξύ:
sv_se: Välj en skärmläsare att prata med bland:

source: or use one of the supported hard synthesizers:
el_gr: ή χρησιμοποιήστε ένα από τα υποστηριζόμενα σκληρά synthesizers:
sv_se: eller använd en av de hårdsynteser som stöds:

source: or type "$program_name none" to mute all screen readers.
el_gr: ή πληκτρολογήστε "$program_name κανένα" για σίγαση όλων των αναγνωστών οθόνης.
sv_se: eller skriv "$program_name none" för att stänga av alla skärmläsare.

source: $first_argument_name is not a valid argument of this command.
el_gr: $first_argument_name δεν είναι ένα έγκυρο όρισμα αυτής της εντολής.
sv_se: $first_argument_name är inte ett giltigt argument för detta kommando.

source: espeakup is not installed.
el_gr: το espeakup δεν έχει εγκατασταθεί.
sv_se: espeakup är inte installerad.

source: $first_argument_name is already started.
el_gr: $first_argument_name έχει ήδη ξεκινήσει.
sv_se: $first_argument_name har redan startat.

source: # File written by speak-with. Do not edit.
el_gr: # Αρχείο γραμμένο με ομιλία-με. Μην επεξεργαστείτε.
sv_se: # Filen skriven av speak-with. Redigera inte.

source: Should espeakup be also started at next boot? [Y/n]
el_gr: Θα πρέπει το speechd-up να ξεκινήσει επίσης στο επόμενο boot? [Y/n]
sv_se: Skall espeakup också starta vid nästa start? [J/n]

source: Done.
el_gr: Ολοκληρώθηκε.
sv_se: Klart.
