Repository: DidierSpaier/slint-translations
Catalog: translations20220904/slint-scripts/*.slint_scripts.po
Languages: el_gr, sv_se

source: speechd-up is not installed.
el_gr: το speechd-up δεν έχει εγκατασταθεί.
sv_se: speechd-up är inte installerat.

source: speechd-up is already started.
el_gr: το speechd-up έχει ήδη ξεκινήσει.
sv_se: speechd-up är redan startad.

source: Should speechd-up be also started at next boot? [Y/n]
el_gr: Θα πρέπει espeakup να ξεκινήσει επίσης στο επόμενο boot? [Y/n]
sv_se: Skall speechd-up också starta vid nästa start? [J/n]

source: fenrir is not installed.
el_gr: το fenrir δεν έχει εγκατασταθεί.
sv_se: fenrir är inte installerat.

source: fenrir is already started.
el_gr: το fenrir έχει ήδη ξεκινήσει.
sv_se: fenrir har redan startats.

source: Do you also want a mute console at next boot? [Y/n]
el_gr: Θέλετε επίσης μια κονσόλα σίγασης στο επόμενο boot? [Y/n]
sv_se: Vill du också ha en stum konsol vid nästa start? [J/n]

source: OK
el_gr: ΟΚ

source: Unable to switch to the $ARGUMENT synthesizer. Something should be wrong.
el_gr: Δεν είναι δυνατή η μετάβαση στο συνθέτη $ARGUMENT. Κάτι πρέπει να είναι λάθος.
sv_se: Det går inte att byta till syntesen $ARGUMENT. Något bör vara fel.

source: Should $ARGUMENT be also used at next boot? [Y/n]
el_gr: Θα πρέπει $ARGUMENT να χρησιμοποιηθεί επίσης στην επόμενη εκκίνηση; [Ν/ν]
sv_se: Skall $ARGUMENT också starta vid nästa start? [J/n]

source: Current speakup settings have been saved in
el_gr: Οι τρέχουσες ρυθμίσεις ομιλητή έχουν αποθηκευτεί σε
sv_se: Nuvarande speakup inställningar har sparats i

source: emacspeak (The Complete Audio Desktop, based on emacs)
el_gr: emacspeak (Η πλήρης επιφάνεια εργασίας ήχου, βασισμένη σε emacs)
sv_se: emacspeak (Det kompletta ljudskrivbordet, baserad på emacs)

source: speechd-el (Emacs client to speech synthesizers and Braille displays)
el_gr: speechd-el (Πελάτης Emacs σε συνθέτες ομιλίας και οθόνες Braille)
sv_se: speechd-el (Emacs-klient till talsyntar och punktskriftsdisplayer)

source: Usage: $program_name <emacspeak> or <speechd-el>
el_gr: Χρήση: $program_name <emacspeak> ή <speechd-el>
sv_se: Användning: $program_name <emacspeak> eller <speechd-el>

source: This script allows to disable:
el_gr: Αυτό το σενάριο επιτρέπει την απενεργοποίηση:
sv_se: Skriptet gör det möjligt att avaktivera:

source: $1 is an unknown feature.
el_gr: $1 είναι ένα άγνωστο χαρακτηριστικό.
sv_se: $1 är en okänd funktion.

source: Available features:
el_gr: Διαθέσιμες δυνατότητες:
sv_se: Tillgängliga funktioner:

source: $1 is not installed
el_gr: $1 δεν έχει εγκατασταθεί
sv_se: $1 är inte installerad

source: emacspeak is disabled.
el_gr: το emacspeak είναι απενεργοποιημένο.
sv_se: emacspeak är inaktiverat.

source: $1 is not installed.
el_gr: $1 δεν έχει εγκατασταθεί.
sv_se: $1 är inte installerad.

source: speechd-el is disabled.
el_gr: η ομιλία speechd-el είναι απενεργοποιημένη.
sv_se: speechd-el är inaktiverad.

source: This script allows to enable:
el_gr: Αυτό το σενάριο επιτρέπει την ενεργοποίηση:
sv_se: Detta skript tillåter aktivering:

source: emacspeak is enabled and speechd-el is disabled, as they are mutually exclusive.
el_gr: το emacspeak είναι ενεργοποιημένο και το speechd-el είναι απενεργοποιημένο, καθώς αλληλοαποκλείονται.
sv_se: emacspeak är aktiverat och speechd-el är inaktiverad, eftersom de utesluter varandra.

source: Do you want to use a voxin voice with emacspeak? [Y/n]
el_gr: Θέλετε να χρησιμοποιήσετε μια φωνή voxin με emacspeak? [Y/n]
sv_se: Vill du använda en voxinröst med emacspeak? [J/n]

source: speechd-el is enabled and emacspeak is disabled, as they are mutually exclusive.
el_gr: το speechd-el είναι ενεργοποιημένο και το emacspeak είναι απενεργοποιημένο, καθώς αλληλοαποκλείονται.
sv_se: speechd-el är aktiverat och emacspeak är avaktiverat, eftersom de utesluter varandra.
