Repository: DidierSpaier/slint-translations
Catalog: po/wiki/a001/*.a001.po
Languages: el_gr

source: Slint with BTRFS
el_gr: Slint με BTRFS

source: In this article we outline the unique characteristics of the BTRFS file system and how a Slint system is configured at installation to take advantage of them.
el_gr: Σε αυτό το άρθρο περιγράφουμε τα μοναδικά χαρακτηριστικά του συστήματος αρχείων BTRFS και πώς ένα σύστημα Slint έχει ρυθμιστεί κατά την εγκατάσταση για να επωφεληθεί από αυτά.

source: In order not to overload this document with definitions, we refer the reader to the https://slint.fr/en/HandBook.html#_glossary[glossary] included in the Slint Manual and more specifically for btrfs "jargon" to the https://btrfs.readthedocs.io/en/latest/Glossary.html[glossary] included in its documentation.
el_gr: Για να μην υπερφορτώσουμε αυτό το έγγραφο με ορισμούς, παραπέμπουμε τον αναγνώστη στο https://slint.fr/en/HandBook.html#_glossary[glossary] που περιλαμβάνεται στο εγχειρίδιο Slint και πιο συγκεκριμένα για btrfs "jargon" στο https://btrfs.readthedocs.io/en/latest/Glossary.html[glossary] που περιλαμβάνεται στην τεκμηρίωσή του.

source: A BTRFS file system consists of a logical volume that can span multiple block devices (partitions or disks). Initially Slint is installed on a single partition.
el_gr: Ένα σύστημα αρχείων BTRFS αποτελείται από έναν λογικό όγκο που μπορεί να καλύπτει πολλαπλές συσκευές (διαμερίσματα ή δίσκους). Αρχικά, το Slint εγκαθίσταται σε ένα ενιαίο διαμέρισμα.

source: A subvolume is a subtree of files inside the volume, the root of which can be mounted as if it were an independent filesystem. However, the space allocated to a volume is also allocated to each of its sub-volumes: it is therefore not necessary to distribute it between the sub-volumes, as if they were in distinct partitions.
el_gr: Ένας υποόγκος είναι ένα υποδέντρο αρχείων μέσα στον τόμο, η ρίζα του οποίου μπορεί να τοποθετηθεί σαν να ήταν ένα ανεξάρτητο σύστημα αρχείων. Ωστόσο, ο χώρος που κατανέμεται σε όγκο κατανέμεται επίσης σε καθέναν από τους επιμέρους όγκους του: δεν είναι επομένως αναγκαίο να κατανεμηθεί μεταξύ των υποόγκων, σαν να ήταν σε ξεχωριστά χωρίσματα.

source: Subvolumes can be created at the same time as the volume (by the mkfs.btrfs command), but also added or deleted later using the btrfs tools.
el_gr: Οι υποόγκοι μπορούν να δημιουργηθούν ταυτόχρονα με τον τόμο (από την εντολή mkfs.btrfs), αλλά και να προστεθούν ή να διαγραφούν αργότερα χρησιμοποιώντας τα εργαλεία btrfs.

source: As an example the commands below create the Slint "system" volume and its subvolumes, in case BTRFS is used. In the following $ROOTNAME is the name of the partition in which Slint will be installed and $SLINT the mount point of the system volume during installation.
el_gr: Για παράδειγμα, οι παρακάτω εντολές δημιουργούν τον τόμο Slint "system" και τους υποτόμους του, σε περίπτωση που χρησιμοποιείται BTRFS. Στο ακόλουθο $ROOTNAME είναι το όνομα του διαμερίσματος στο οποίο θα εγκατασταθεί το Slint και $SLINT το σημείο προσάρτησης του τόμου του συστήματος κατά την εγκατάσταση.

source: mkdir /SLINT SLINT="/SLINT" mkfs.btrfs -L root $ROOTNAME mount -o compress=zstd:3,noatime $ROOTNAME $SLINT btrfs subvolume create $SLINT/@ btrfs subvolume create $SLINT/@home btrfs subvolume create $SLINT/@swap umount $SLINT mount -o subvol=/@,compress=zstd:3,noatime $ROOTNAME $SLINT mkdir $SLINT/home mkdir $SLINT/swap
el_gr: mkdir /SLINT SLINT="/SLINT" mkfs. trfs -L root $ROOTNAME mount -o compress=zstd:3, oatime $ROOTNAME $SLINT btrfs subvolume create $SLINT/@ btrfs subvolume create $SLINT/@home btrfs subvolume create $SLINT/@swap umount $SLINT mount -o subvol=/@, ompress=zstd:3,noatime $ROOTNAME $SLINT mkdir $SLINT/home mkdir $SLINT/swap

source: The $ROOTNAME partition (denoted by its UUID which we will call <uuid>) will then be mounted three times (once per subvolume) each time Slint is started, as indicated in the /etc/fstab file:
el_gr: Το διαμέρισμα $ROOTNAME (υποδεικνύεται από το UUID το οποίο θα καλέσουμε <uuid>) θα τοποθετηθεί στη συνέχεια τρεις φορές (μία φορά ανά υποτόμο) κάθε φορά που ξεκινά το Slint, όπως αναφέρεται στο αρχείο /etc/fstab:

source: UUID=<uuid> / btrfs subvol=/@,compress=zstd:3,noatime 0 0 UUID=<uuid> /home btrfs subvol=/@home,compress=zstd:3,noatime 0 0 UUID=<uuid> /swap btrfs subvol=/@swap,compress=zstd:3,noatime 0 0
el_gr: UUID=<uuid> / btrfs subvol=/@,compress=zstd:3,noatime 0 UUID=<uuid> /home btrfs subvol=/@home,compress=zstd:3,noatime 0 UUID=<uuid> /swap btrfs subvol=/@swap,compress=zstd:3,noatime 0

source: Which gives for example (taken from the output of lsblk /dev/sda5):
el_gr: Αυτό δίνει για παράδειγμα (λαμβάνεται από την έξοδο του lsblk /dev/sda5):

source: We see that the space available for the volume (28G) is also available for each of the sub-volumes. On the other hand, the "compress_zstd:3" mount option means that all the files that will be stored will be compressed by the zstd utility with compression level 3. Thus the size of the system is approximately half that with the ext4 file system.
el_gr: Βλέπουμε ότι ο διαθέσιμος χώρος για τον όγκο (28G) είναι επίσης διαθέσιμος για κάθε επιμέρους τόμο. Από την άλλη πλευρά, η επιλογή προσάρτησης "compress_zstd:3" σημαίνει ότι όλα τα αρχεία που θα αποθηκευτούν θα συμπιέζονται από το βοηθητικό πρόγραμμα zstd με το επίπεδο συμπίεσης 3. Έτσι, το μέγεθος του συστήματος είναι περίπου το μισό που θα ήταν με το σύστημα αρχείων ext4.

source: If we mount the device at the root of the volume (without mention of a subvolume), like this:
el_gr: Εάν προσαρτήσουμε τη συσκευή στη ρίζα του όγκου (χωρίς να αναφέρουμε έναν υποόγκο), όπως αυτό:

source: we see the subvolumes appear as subdirectories of /mnt:
el_gr: βλέπουμε τους υποτόμους να εμφανίζονται ως υποκατάλογοι του /mnt:

source: Another remarkable feature of BTRFS is "copy-on-write". When editing a file, modified parts are written to another location, the metadata (which record the location of all parts of the file) being updated. As long as the previous data are still referenced, they will stay untouched.
el_gr: Ένα άλλο αξιοσημείωτο χαρακτηριστικό του BTRFS είναι το "copy-on-write". Κατά την επεξεργασία ενός αρχείου, τα τροποποιημένα μέρη γράφονται σε άλλη τοποθεσία, τα μεταδεδομένα (που καταγράφουν τη θέση όλων των τμημάτων του αρχείου) που ενημερώνονται. Όσο τα προηγούμενα δεδομένα αναφέρονται ακόμη, θα παραμείνουν άθικτα.

source: This makes it very easy to create snapshots of BTRFS subvolume: taking a new snapshot is "free", as it uses very few disk space: only the metadata of the snapshot are written, which stores the physical location of all parts of files in the subvolume, and this is done almost instantly. The space used by the snapshot will only grow when the original subvolume and the snapshot differ, as then the snapshot will retrieves data removed from the original. On the other hand data added to the original will not be included in he snapshot: in other words a modification of the original subvolume does not modify the snapshot.
el_gr: Αυτό το καθιστά πολύ εύκολο να δημιουργήσετε στιγμιότυπα του υποτόμου BTRFS: λαμβάνοντας ένα νέο στιγμιότυπο είναι "ελεύθερο", καθώς χρησιμοποιεί πολύ λίγους χώρους στο δίσκο: μόνο τα μεταδεδομένα του στιγμιοτύπου γράφονται, το οποίο αποθηκεύει τη φυσική θέση όλων των τμημάτων των αρχείων στον υποτόμου, και αυτό γίνεται σχεδόν αμέσως. Ο χώρος που χρησιμοποιείται από το στιγμιότυπο θα αυξηθεί μόνο όταν ο αρχικός υποόγκος και το στιγμιότυπο διαφέρουν, καθώς το στιγμιότυπο θα ανακτά τα δεδομένα που αφαιρέθηκαν από το αρχικό. Από τα άλλα δεδομένα που προστίθενται στο αρχικό δεν θα συμπεριληφθούν στο στιγμιότυπο: με άλλα λόγια, η τροποποίηση του αρχικού υποτόμου δεν τροποποιεί το στιγμιότυπο.

source: Slint includes the utility `absm`, which takes snapshots of the subvolume @, allowing to return to a previous state of the system if an update goes wrong, by booting the system on this snapshot, selected in the GRUB boot menu. To know its usage, just type `absm` as root or using sudo.
el_gr: Το Slint περιλαμβάνει το βοηθητικό πρόγραμμα `absm`, το οποίο επιτρέπει τη λήψη στιγμιότυπων του υποτόμου @, επιτρέποντας την επιστροφή σε προηγούμενη κατάσταση του συστήματος εάν μια ενημέρωση πάει στραβά, εκκινώντας το σύστημα σε αυτό το στιγμιότυπο, επιλεγμένο στο μενού εκκίνησης GRUB. Για να γνωρίζετε τη χρήση του, απλά πληκτρολογήστε `absm` ως root ή χρησιμοποιώντας sudo.

source: BTRFS also verifies the integrity of each file when it is opened using a checksum, making it unnecessary to check the file system at system startup. In addition, the "btrfs scrub" command verifies the integrity of all files, including those that are rarely read. By default, the utility `btrfsmaintenance` included in Slint runs "btrtfs scrub" once a week.
el_gr: Το BTRFS επαληθεύει επίσης την ακεραιότητα κάθε αρχείου όταν ανοίγει με τη χρήση αθροίσματος ελέγχου, καθιστώντας περιττό να ελέγξετε το σύστημα αρχείων κατά την εκκίνηση του συστήματος. Επιπλέον, η εντολή "btrfs scrub" επαληθεύει την ακεραιότητα όλων των αρχείων, συμπεριλαμβανομένων εκείνων που σπάνια διαβάζονται. Από προεπιλογή, το βοηθητικό πρόγραμμα `btrfsmaintenance` που περιλαμβάνεται στο Slint τρέχει "btrtfs scrub" μία φορά την εβδομάδα.

source: `btrfsmaintenance` also triggers "btrfs balance" once a week by default. This command allows you to distribute the data between the devices if the file system extends over several, but also to reorganize the space used, in particular to free the unallocated space of the file system, which improves in particular the performance of BTRFS in the case of a hard disk. To know more about `btrfsmaintenance` read /usr/doc/btrfsmaintenance*/README.html
el_gr: Το "btrfsmaintenance" ενεργοποιεί επίσης το "btrfs balance" μία φορά την εβδομάδα από προεπιλογή. Με αυτή την εντολή μπορείτε να κατανείμετε τα δεδομένα μεταξύ των συσκευών αν το σύστημα αρχείων εκτείνεται σε διάφορες, αλλά και να αναδιοργανώσετε το χρησιμοποιούμενο χώρο, ιδίως για να ελευθερώσετε τον αδιάθετο χώρο του συστήματος αρχείων, το οποίο βελτιώνει ιδιαίτερα την απόδοση του BTRFS στην περίπτωση ενός σκληρού δίσκου. Για να μάθετε περισσότερα για το ` btrfsmaintenance` διαβάστε το /usr/doc/btrfsmaintenance*/README.html

source: Other useful and BTRFS-compatible tools are included in Slint, all have a --help option and a man page:
el_gr: Άλλα χρήσιμα και BTRFS-συμβατά εργαλεία περιλαμβάνονται στο Slint, όλα έχουν μια επιλογή βοήθειας και μια σελίδα man:

source: `jdupes` detects duplicate files and allows you to take action accordingly, regardless of the file system used
el_gr: "Jdupes" ανιχνεύει τα διπλότυπα αρχεία και σας επιτρέπει να αναλάβετε δράση αναλόγως, ανεξάρτητα από το σύστημα αρχείων που χρησιμοποιείται

source: `btdu` allows to know with precision the place occupied by the BTRFS sub-volumes and directories
el_gr: `btdu` επιτρέπει να γνωρίζετε με ακρίβεια τη θέση που καταλαμβάνουν οι υπό-τόμοι και οι κατάλογοι BTRFS

source: `restic` is a very versatile backup software that can be used for any file system.
el_gr: `restic` είναι ένα πολύ ευέλικτο λογισμικό δημιουργίας αντιγράφων ασφαλείας που μπορεί να χρησιμοποιηθεί για οποιοδήποτε σύστημα αρχείων.

source: Recommendations.
el_gr: Προτάσεις.

source: BTRFS needs room to breathe and reorganize. Always keep 10-20% free space.
el_gr: Το BTRFS χρειάζεται χώρο για να αναπνέει και να αναδιοργανώνεται. Να διατηρείτε πάντα 10-20 % ελεύθερο χώρο.

source: Some tool options included in the btrfs-tools package can be dangerous or counterproductive. Use only those whose effect you know perfectly well and if in doubt seek advice first, on the Slint mailing list or by IRC on irc.libera.chat, channel #btrfs.
el_gr: Ορισμένες επιλογές εργαλείων που περιλαμβάνονται στο πακέτο btrfs-tools μπορεί να είναι επικίνδυνες ή αντιπαραγωγικές. Χρησιμοποιήστε μόνο εκείνους των οποίων την επίδραση γνωρίζετε πολύ καλά και αν σε αμφιβολία αναζητούν συμβουλές πρώτα, στη λίστα αλληλογραφίας Slint ή από IRC για irc.libera.chat, κανάλι #btrfs.

source: In particular, avoid using "btrfs filesystem defrag" and especially not "btrfs check --repair".
el_gr: Ειδικότερα, αποφύγετε τη χρήση του "btrfs filesystem defrag" και ειδικά όχι "btrfs check --repair".

source: Before using a command, carefully read the corresponding man page (starting with "man btrtfs" which lists the others).
el_gr: Πριν χρησιμοποιήσετε μια εντολή, διαβάστε προσεκτικά την αντίστοιχη man σελίδα (ξεκινώντας με το "man btrtfs" που αναφέρει τα άλλα).

source: As with any file system: make regular backups! This is usually the only way to recover your data in the event of hardware failure.
el_gr: Όπως συμβαίνει με κάθε σύστημα αρχείων: κάντε κανονικά αντίγραφα ασφαλείας! Αυτός είναι συνήθως ο μόνος τρόπος για να ανακτήσετε τα δεδομένα σας σε περίπτωση βλάβης υλικού.

source: For further:
el_gr: Περαιτέρω:

source: The Forza wiki: https://wiki.tnonline.net/w/Category:Btrfs
el_gr: Forza wiki: https://wiki.tnonline.net/w/Category:Btrfs

source: The official documentation: https://btrfs.readthedocs.io/en/latest/
el_gr: Η επίσημη τεκμηρίωση: https://btrfs.readthedocs.io/en/latest/

source: Questions, problems: on irc.libera.chat channel #btrfs
el_gr: Ερωτήσεις, προβλήματα: στο κανάλι irc.libera.chat #btrfs
