Repository: DidierSpaier/slint-translations
Catalog: translations20220905/slint-scripts/*.slint_scripts.po
Languages: de_de, fr_fr, it_it, nl_nl, pt_pt, uk_ua

source: Installer documentation
de_de: Dokumentation des Installationsprogramms
fr_fr: Documentation de l'installateur
it_it: Documentazione dell'installatore
nl_nl: Documentatie van het installatieprogramma
pt_pt: Documentação do instalador
uk_ua: Документація встановлювача

source: Navigate in this menu with the up and down arrow keys. Press Enter to read a highlighted document. Press Q to stop reading a document and go back to the menu. Press Escape to quit.
de_de: Navigieren Sie in diesem Menü durch Betätigen der Pfeil-rauf und Pfeil-runter Tasten. Drücken Sie die Eingabetaste, um das hervorgehobene Dokument zu lesen. Drücken Sie Q, um das Lesen eines Dokuments zu beenden und in das Menü zurückzukehren. Zum Beenden drücken Sie die Escape-Taste.
fr_fr: Naviguez dans ce menu avec les touches fléchées haut et bas. Appuyez sur Entrée pour lire un document mis en évidence. Appuyez sur Q pour arrêter de lire un document et revenir au menu. Pressez Échap pour quitter.
it_it: Naviga in questo menu con i tasti freccia su e giù. Premi Invio per leggere un documento evidenziato. Premi Q per interrompere la lettura di un documento e tornare al menu. Premi Esc per uscire.
nl_nl: Navigeer in dit menu met de pijltjestoetsen omhoog en omlaag. Druk op Enter om een geaccentueerd document te lezen. Druk op Q om een document te sluiten en terug te gaan naar het menu. Druk op Escape om te stoppen.
pt_pt: Navegue neste menu com as teclas de seta para cima e para baixo. Prima Enter para ler um documento destacado. Prima Q para parar de ler um documento e voltar ao menu. Prima Esc para sair.
uk_ua: Для навігації по цьому меню, використовуйте курсорні клавіші вгору та вниз. Натисніть Enter, щоб переглянути вибраний документ. Натисніть Q щоб зупинити читання документа, і повернутися у меню. Натисніть Escape щоб вийти.

source: Presentation of the Slint installer.
de_de: Vorstellung des Slint-Installationsprogramms.
fr_fr: Présentation de l'installateur Slint.
it_it: Presentazione dell'installatore Slint.
nl_nl: Beschrijving van het Slint installatieprogramma.
pt_pt: Apresentação do instalador Slint.
uk_ua: Знайомство зі встановлювачем Slint.

source: How-to use the installer
de_de: Wie man das Installationsprogramm benutzt
fr_fr: Comment utiliser l'installateur
it_it: Come usare l'installatore
nl_nl: Hoe gebruik je het installatieprogramma
pt_pt: Como usar o instalador
uk_ua: Як використовувати встановлювач

source: The automatic installation mode
de_de: Der automatische Installationsmodus
fr_fr: Le mode d'installation automatique
it_it: La modalità d'installazione automatica
nl_nl: De automatische installatie-modus
pt_pt: O modo de instalação automática
uk_ua: Напівавтоматичний режим встановлення

source: Slint in an encrypted drive
de_de: Slint auf einem verschlüsselten Laufwerk
fr_fr: Slint dans un lecteur chiffré
it_it: Slint in un'unità crittografata
nl_nl: Slint in een versleuteld station
pt_pt: Slint numa unidade criptografada
uk_ua: Slint на зашифрованому диску

source: The manual installation mode
de_de: Der manuelle Installationsmodus
fr_fr: Le mode d'installation manuel
it_it: La modalità d'installazione manuale
nl_nl: De handmatige installatie-modus
pt_pt: O modo de instalação manual
uk_ua: Експертний режим встановлення

source: How to make room for Slint on a drive
de_de: Wie man sich auf einem Laufwerk Platz für Slint freischaufelt
fr_fr: Comment faire de la place pour Slint sur un lecteur
it_it: Come fare spazio per Slint su un'unità
nl_nl: Hoe maak je vrije ruimte voor Slint op een station
pt_pt: Como criar espaço para o Slint numa unidade
uk_ua: Як звільнити на диску простір для Slint

source: Glossary of technical terms used in the documentation
de_de: Glossar vorkommender technischer Begriffe in dieser Dokumentation
fr_fr: Glossaire des termes techniques utilisés dans la documentation
it_it: Glossario di termini tecnici usati nella documentazione
nl_nl: Woordenlijst van in de documentatie gebruikte technische termen
pt_pt: Glossário de termos técnicos utilizados na documentação
uk_ua: Словник технічних термінів, що використовуються в документації

source: key bindings for the speakup screen reader
de_de: Tastenkürzel für den speakup Screenreader
fr_fr: raccourcis clavier pour le lecteur d'écran
it_it: associazioni di tasti per il lettore vocale dello schermo
nl_nl: sneltoetsen voor de Speakup schermlezer
pt_pt: teclas de atalho para o leitor de voz no ecrã
uk_ua: сполучення клавіш читача екрана speakup

source: First steps after Slint installation
de_de: Erste Schritte nach erfolgter Slint-Installation
fr_fr: Premiers pas après l'installation de Slint
it_it: Primi passaggi dopo l'installazione di Slint
nl_nl: Eerste stappen na de installatie van Slint
pt_pt: Primeiros passos após a instalação do Slint
uk_ua: Перші кроки після встановлення Slint

source: Welcome back to the menu of the Slint installer Available commands (do not type the quotes): 'doc' to know the features and usage of the installer. 'auto' to start a semi-automatic, guided installation. 'setup' to start a manual installation. We recommend that you type 'doc' first, especially if you want to use the 'Manual' installation mode or want that the installer encrypt the drive where Slint will be installed. When done reading you will go back to this menu.
de_de: Willkommen zurück im Menü des Slint Installationsprogramms Verfügbare Befehle (geben Sie diese ohne Anführungszeichen ein): 'doc' um die Funktionen und Verwendung des Installationsprogramms zu erfahren. 'auto' um eine halbautomatische, geführte Installation zu starten. 'setup' um eine manuelle Installation zu starten. Wir empfehlen Ihnen, dass Sie zuerst 'doc' eingeben - insbesondere dann, wenn Sie beabsichtigen den manuellen Installationsmodus zu verwenden, oder wenn Sie das Laufwerk, auf welchem Slint installiert wird, verschlüsseln möchten. Nach dem Lesen, landen Sie wieder in diesem Menü.
fr_fr: Bienvenue dans le menu de l'installateur Slint Commandes disponibles (ne tapez pas les guillemets): 'doc' pour connaître les fonctionnalités et l'utilisation de l'installateur. 'auto' pour démarrer une installation semi-automatique et guidée. 'setup' pour démarrer une installation manuelle. Nous vous recommandons de taper 'doc' en premier, surtout si vous voulez utiliser le mode d'installation 'Manuel' ou si vous voulez que l'installateur chiffre le lecteur où Slint sera installé. Une fois la lecture terminée, vous reviendrez à ce menu.
it_it: Bentornato al menu dell'installatore di Slint Comandi disponibili (non mantenere le virgolette): 'doc' per conoscere le funzionalità e l'uso dell'installatore. 'auto' per avviare l'installazione guidata semi-automatica. 'setup' per avviare un'installazione manuale. Ti consigliamo di digitare 'doc' prima, specialmente se vuoi usare la modalità d'installazione 'Manuale' o se vuoi che l'installatore crittografi l'unità in cui Slint sarà installato. Quando hai finito di leggere, tornerai a questo menu.
nl_nl: Welkom terug in het menu van het Slint installatieprogramma Beschikbare opdrachten(zonder aanhalingstekens): 'doc' voor de beschrijving van de functies en het gebruik van het installatieprogramma. 'auto' om een half-automatische, begeleide installatie te starten. 'setup' om een handmatige installatie te starten. Wij adviseren je eerst 'doc' te typen, met name als je de handmatige installatiemodus wilt gebruiken of als je wilt dat het installatieprogramma het station waarop Slint wordt geïnstalleerd versleutelt. Wanneer je klaar bent met lezen keer je terug naar dit menu.
pt_pt: Bem-vindo(a) de volta ao menu do instalador Slint Comandos disponíveis (não escreva os apóstrofos): 'doc' para conhecer as funcionalidades e a utilização do instalador. 'auto' para iniciar uma instalação semi-automática e guiada. 'setup' para iniciar uma instalação manual. Recomendamos que escreva 'doc' primeiro, especialmente se quiser utilizar o modo de instalação 'Manual' ou quer que o instalador encripte a unidade onde o Slint será instalado. Quando terminar a leitura, regressará a este menu.
uk_ua: Ласкаво просимо назад, до меню встановлювача Slint Доступні команди (вводьте без лапок): "doc" - інформація про особливості встановлювача, а також про його використання. "auto" - розпочати встановлення у напівавтоматичному режимі. "setup" - розпочати встановлення у експертному режимі. Рекомендуємо ввести "doc", щоб підготуватися до використання експертного режиму встановлення, або якщо ви бажаєте зашифрувати диск, на якому буде встановлений Slint. Після прочитання, ви повернетеся до цього меню.

source: Please run this script as root.
de_de: Bitte führen Sie dieses Script als root aus.
fr_fr: Merci d'exécuter ce script en tant que root.
it_it: Sei pregato di eseguire questo script come di root.
nl_nl: Voer dit script uit als root.
pt_pt: Executar este script como root.
uk_ua: Будь ласка, запустіть цей скрипт із правами root.

source: KDE is not installed.
de_de: KDE ist nicht installiert.
fr_fr: KDE n'est pas installé.
it_it: KDE non è installato.
nl_nl: KDE wordt niet geïnstalleerd.
pt_pt: O KDE não está instalado.
uk_ua: KDE не встановлено.

source: This script includes KDE applications in the menus of KDE only, for all users. This can be reverted with the command show-kde-apps.
de_de: Dieses Script sorgt dafür, dass bei allen Benutzern KDE-Applikationen auch nur in KDE selbst angezeigt werden. Dies kann mit folgendem Kommando rückgängig gemacht werden: show-kde-apps.
fr_fr: Ce script inclut des applications KDE dans les menus de KDE seulement, pour tous les utilisateurs. Cela peut être inversé avec la commande show-kde-apps.
it_it: Questo script include le applicazioni KDE solo nei menu di KDE, per tutti gli utenti. Questo è ripristinabile con il comando show-kde-apps.
nl_nl: Dit script bevat KDE-toepassingen in de menu's van alleen KDE voor alle gebruikers. Dit kan worden teruggedraaid met de opdracht show-kde-apps.
pt_pt: Este script inclui aplicações KDE apenas nos menus do KDE, para todos os utilizadores. Isto pode ser revertido com o comando: show-kde-apps.
uk_ua: Цей скрипт вмикає відображення програм KDE лише у меню KDE, для всіх користувачів. Для зворотньої дії, скористайтеся командою show-kde-apps.

source: To confirm press Y else press N:
de_de: Um zu bestätigen drücken Sie Y, andernfalls drücken Sie N:
fr_fr: Pour confirmer appuyez sur Y, sinon appuyez sur N:
it_it: Per confermare, premi Y altrimenti premi N:
nl_nl: Druk op Y om te bevestigen, anders N:
pt_pt: Para confirmar prima Y caso contrário prima N:
uk_ua: Для підтвердження натисніть Y. Інакше - натисніть N:

source: Nothing done.
de_de: Nichts geändert.
fr_fr: Rien n'a été fait.
it_it: Niente fatto.
nl_nl: Niets gedaan.
pt_pt: Nada feito.
uk_ua: Нічого не виконано.

source: All done.
de_de: Alles erledigt.
fr_fr: Tout a été fait.
it_it: Tutto fatto.
nl_nl: Klaar!
pt_pt: Tudo feito.
uk_ua: Усе виконано.

source: This script should be run as root.
de_de: Dieses Script sollte als root ausgeführt werden.
fr_fr: Ce script doit être exécuté en tant que root.
it_it: Questo script dovrebbe esser eseguito come di root.
nl_nl: Dit script moet als root worden uitgevoerd.
pt_pt: Este script deve ser executado como root.
uk_ua: Цей скрипт потрібно запускати з правами root.

source: Usage: login-chooser <login manager>
de_de: Verwendung: login-chooser <login manager>
fr_fr: Usage: login-chooser <gestionnaire de connexion>
it_it: Uso: login-chooser <login manager>
nl_nl: Gebruik: login-chooser <login manager>
pt_pt: Utilização: login-chooser <login manager>
uk_ua: Використання: login-chooser <менеджер входу>

source: Available login managers:
de_de: Verfügbare Login Manager:
fr_fr: Gestionnaires de connexion disponibles :
it_it: Gestori d'accesso disponibili:
nl_nl: Beschikbare login managers:
pt_pt: Gestores de acesso disponíveis:
uk_ua: Доступні менеджери входу:

source: Short descriptions:
de_de: Kurzbeschreibungen:
fr_fr: Brèves descriptions :
it_it: Descrizioni brevi:
nl_nl: Korte beschrijvingen:
pt_pt: Breve descrição:
uk_ua: Короткі описи:

source: text: Login in text mode, in a console. From there, you can type "startx" to start a graphical session.
de_de: text: Login im Text-Modus, in einer Konsole. Von dort können Sie "startx" eingeben, um eine grafische Session zu starten.
fr_fr: text: Connexion en mode texte, dans une console. De là, vous pouvez taper "startx" pour démarrer une session graphique.
it_it: testo: Accedi in modalità di testo, in una console. Da lì, puoi digitare "startx" per avviare una sessione grafica.
nl_nl: text: Inloggen in tekstmodus, in een console. Van daar uit kun je "startx" typen om een grafische sessie te starten.
pt_pt: texto: Iniciar sessão no modo texto, numa consola. A partir daí pode escrever "startx" para iniciar uma sessão gráfica.
uk_ua: text: Вхід у текстовий режим, у консоль. У цьому режимі, Для запуску графічного сеансу, введіть "startx".

source: lightdm: Light Display Manager, accessible with speech.
de_de: lightdm: Light Display Manager, zugänglich mit Sprachausgabe.
fr_fr: lightdm: gestionnaire d'affichage léger, accessible par la parole.
it_it: lightdm: Gestore Schermo Leggero, accessibile vocalmente.
nl_nl: lightdm: Light Display Manager, toegankelijk met spraak.
pt_pt: lightdm: Gestor de sessão Light, acessível com voz.
uk_ua: lightdm: Light Display Manager, доступний для незрячих користувачів.

source: lxdm: LXDE Display Manager.
fr_fr: lxdm: Gestionnaire d'affichage LXDE.
it_it: lxdm: Gestore Schermo LXDE.
pt_pt: lxdm: Gestor de sessão LXDE.

source: kdm: KDE Display Manager.
fr_fr: kdm : Gestionnaire d'affichage de KDE.
it_it: kdm: Gestore Schermo KDE.
pt_pt: kdm: Gestor de sessão KDE.

source: sddm: Simple Desktop Display Manager.
fr_fr: sddm: Gestionnaire d'affichage simple du bureau.
it_it: sddm: Gestore Schermo Desktop Semplice.
pt_pt: sddm: Gestor de sessão Simple Desktop.

source: gdm: GNOME Display Manager, fully accessible with speech.
de_de: gdm: GNOME Display Manager, vollständig zugänglich mit Sprachausgabe.
fr_fr: gdm: Gestionnaire d'affichage GNOME, entièrement accessible par la parole.
it_it: gdm: Gestore Schermo GNOME, totalmente accessibile vocalmente.
nl_nl: gdm: GNOME Display Manager, volledig toegankelijk met spraak.
pt_pt: gdm: Gestor de sessão GNOME, totalmente acessível com voz.
uk_ua: gdm: GNOME Display Manager, повністю доступний для незрячих користувачів.

source: xdm: X Display Manager.
fr_fr: xdm: Gestionnaire d'affichage X.
it_it: xdm: Gestore Schermo X.
pt_pt: xdm: Gestor de sessão X.

source: Login is currently set to text mode.
de_de: Login ist zurzeit auf Text-Modus eingestellt.
fr_fr: La connexion est actuellement définie en mode texte.
it_it: L'accesso è correntemente impostato alla modalità di testo.
nl_nl: Inloggen is momenteel ingesteld op tekstmodus.
pt_pt: O acesso está definido para o modo de texto.
uk_ua: Наразі вхід здійснюється у текстовому режимі.

source: The display manager ${dm} is currently set.
de_de: Zurzeit ist der Display-Manager ${dm} eingestellt.
fr_fr: Le gestionnaire d'affichage ${dm} est actuellement sélectioné.
it_it: Il gestore dello schermo ${dm} è correntemente impostato.
nl_nl: Display-manager ${dm} is momenteel ingesteld.
pt_pt: O gestor de sessão ${dm} está atualmente definido.
uk_ua: Наразі вибрано менеджер входу ${dm}.

source: To reboot immediatly press R then Enter, else just press Enter.
de_de: Um sofort neuzustarten drücken Sie R, gefolgt von der Eingabetaste. Andernfalls drücken Sie nur die Eingabetaste.
fr_fr: Pour redémarrer immédiatement, appuyez sur R puis sur Entrée, sinon appuyez sur Entrée.
it_it: Per riavviare immediatamente premi R poi Invio, altrimenti premi Invio.
nl_nl: Om nu meteen opnieuw op te starten, druk je op R en vervolgens op Enter, anders alleen Enter.
pt_pt: Para reiniciar imediatamente prima R e depois Enter, caso contrário basta premir Enter.
uk_ua: Для негайного перезавантаження, натисніть R а потім Enter. Інакше - просто натисніть Enter.

source: If you want speech at login press S then Enter, else just press Enter.
de_de: Wenn Sie beim Login Sprachausgabe verwenden möchten, drücken Sie S gefolgt von der Eingabetaste. Andernfalls drücken Sie nur die Eingabetaste.
fr_fr: Si vous voulez la parole à la connexion appuyez sur S puis Entrée, sinon appuyez sur Entrée.
it_it: Se vuoi parlare all'accesso premi S poi Invio, altrimenti premi solo Invio.
nl_nl: Als je bij het inloggen spraak wilt gebruiken druk je op S en vervolgens op Enter, anders alleen Enter.
pt_pt: Se pretender voz no início de sessão prima S depois Enter, caso contrário basta premir Enter.
uk_ua: Якщо бажаєте використовувати мовлення під час входу, натисніть S а потім Enter. Інакше - просто натисніть Enter.

source: You will have speech at login.
de_de: Beim Login wird Sprachausgabe verfügbar sein.
fr_fr: Vous aurez la parole à la connexion.
it_it: Avrai il discorso all'accesso.
nl_nl: Je gebruikt nu spraak bij het inloggen.
pt_pt: Terá voz no iniciar sessão.
uk_ua: Мовлення під час входу ввімкнено.

source: You won't have speech at login.
de_de: Beim Login wird keine Sprachausgabe verfügbar sein.
fr_fr: Vous n'aurez pas de parole à la connexion.
it_it: Non avrai il discorso all'accesso.
nl_nl: Je gebruikt geen spraak bij het inloggen.
pt_pt: Não terá voz no iniciar sessão.
uk_ua: Мовлення під час входу вимкнено.

source: "$1" is not among the available login managers:
de_de: "$1" befindet sich nicht unter den verfügbaren Login-Managern:
fr_fr: "$1" ne fait pas partie des gestionnaires de connexion disponibles:
it_it: "$1" non è tra i gestori d'accesso disponibili:
nl_nl: "$1" is niet een van de beschikbare login managers:
pt_pt: "$1" não está entre os gestores de acesso disponíveis:
uk_ua: "$1" немає серед доступних менеджерів входу:

source: Login will occur in text mode on next boot.
de_de: Login wird ab dem nächsten Boot im Text-Modus stattfinden.
fr_fr: La connexion se fera en mode texte au prochain démarrage.
it_it: L'acceso si verificherà in modalità testuale al prossimo avvio.
nl_nl: Inloggen vindt bij de volgende herstart plaats in tekstmodus.
pt_pt: O iniciar sessão ocorrerá no modo texto no próximo arranque.
uk_ua: При наступному завантаженні, вхід відбуватиметься у текстовому режимі.

source: If you need speech type one of these commands before rebooting:
de_de: Wenn Sie Sprachausgabe benötigen, tippen Sie bitte einen der folgenden Befehle bevor Sie neustarten:
fr_fr: Si vous avez besoin de la parole, tapez l'une de ces commandes avant de redémarrer :
it_it: Se necessiti l'uso del dialogo, digita uno di questi comandi prima del riavvio:
nl_nl: Als je spraak wenst geef je een van deze commando's voordat je opnieuw opstart:
pt_pt: Se precisar de voz escreva um destes comandos antes de reiniciar:
uk_ua: Якщо вам необхідна підтримка мовлення, введіть одну з цих команд перед перезавантаженням:

source: The display manager $choice will be in use on next boot.
de_de: Der Display-Manager $choice wird ab dem nächsten Neustart verwendet werden.
fr_fr: Le gestionnaire d'affichage $choice sera utilisé au prochain démarrage.
it_it: Il gestore dello schermo $choice sarà in uso al prossimo avvio.
nl_nl: De display-manager $choice wordt gebruikt na de volgende herstart.
pt_pt: O gestor da sessão $choice estará em uso no próximo arranque.
uk_ua: Менеджер входу $choice використовуватиметься при наступному завантаженні.

source: Unknown choice. Check your spelling.
de_de: Unbekannte Auswahl. Bitte überprüfen Sie Ihre Eingabe.
fr_fr: Choix inconnu. Vérifiez votre frappe.
it_it: Scelta sconosciuta. Controlla l'ortografia.
nl_nl: Onbekende keuze. Controleer je spelling.
pt_pt: Escolha desconhecida. Verifique a ortografia.
uk_ua: Не відома назва. Перевірте правильність написання.

source: Please run this script as regular user.
de_de: Bitte führen Sie dieses Script als regulärer Benutzer aus.
fr_fr: Veuillez exécuter ce script en tant qu'utilisateur normal.
it_it: Sei pregato di eseguire questo script come utente regolare.
nl_nl: Je dient dit script als gewone gebruiker uit te voeren.
pt_pt: Executar este script como utilizador.
uk_ua: Будь ласка, запустіть цей скрипт із правами звичайного користувача.

source: Orca has been disabled for user $username.
de_de: Orca wurde für den Benutzer $username deaktiviert.
fr_fr: Orca a été désactivé pour l'utilisateur $username.
it_it: Orga è stata disabilitata per l'utente $username.
nl_nl: Orca is uitgeschakeld voor gebruiker $username.
pt_pt: O Orca foi desativado para o utilizador $username.
uk_ua: Orca вимкнено для користувача $username.

source: File ~/.config/autostart/startorca.desktop not found.
de_de: Datei ~/.config/autostart/startorca.desktop wurde nicht gefunden.
fr_fr: Fichier ~/.config/autostart/startorca.desktop introuvable.
it_it: File ~/.config/autostart/startorca.desktop non trovato.
nl_nl: Het bestand ~/.config/autostart/startorca.desktop werd niet gevonden.
pt_pt: Ficheiro ~/.config/autostart/startorca.desktop não encontrado.
uk_ua: Файл ~/.config/autostart/startorca.desktop не знайдено.

source: Start a graphical environment as root with speech is not advisable. Please run this script as regular user.
de_de: Als root in einer grafischen Benutzeroberfläche zu starten, ist nicht empfehlenswert. Bitte führen Sie dieses Script als regulärer Benutzer aus.
fr_fr: Lancer un environnement graphique en tant que root avec la parole n'est pas recommandé. Veuillez exécuter ce script en tant qu'utilisateur normal.
it_it: Avviare un ambiente grafico come di root con il discorso è sconsigliabile. Sei pregato di eseguire questo script come utente regolare.
nl_nl: Het starten van een grafische omgeving als root met spraak is niet aan te bevelen. Voer dit script daarom uit als gewone gebruiker.
pt_pt: Iniciar um ambiente gráfico como root com voz não é aconselhável. Execute este script como utilizador.
uk_ua: Запуск графічного середовища з підтримкою мовлення використовуючи права root, не є вдалою ідеєю. Будь ласка, запустіть цей скрипт із правами звичайного користувача.

source: Orca has been enabled for user $username.
de_de: Orca wurde für den Benutzer $username aktiviert.
fr_fr: Orca a été activé pour l'utilisateur $username.
it_it: Orca è stata abilitata per l'utente $username.
nl_nl: Orca is nu ingeschakeld voor gebruiker $username.
pt_pt: O Orca foi ativado para o utilizador $username.
uk_ua: Orca ввімкнено для користувача $username.

source: Slint for the visually impaired
de_de: Slint für Menschen mit Sehbeinträchtigungen
fr_fr: Slint pour les malvoyants
it_it: Slint per ipovedenti
nl_nl: Slint voor mensen met een visuele beperking
pt_pt: Slint para os deficientes visuais
uk_ua: Slint для незрячих і слабозорих користувачів
