Repository: DidierSpaier/slint-translations
Catalog: translations20220905/slint-scripts/*.slint_scripts.po
Languages: de_de, fr_fr, it_it, nl_nl, pt_pt, uk_ua

source: "$program_name -s" available synthesizers?
de_de: "$program_name -s" Verfügbare Synthesizer?
fr_fr: "$program_name -s" synthétiseurs disponibles?
it_it: Sintetizzatori disponibili di "$program_name -s"?
nl_nl: "$program_name -s " beschikbare synthesizers?
pt_pt: "$program_name -s" sintetizadores disponíveis?
uk_ua: "$program_name -s" - Список усіх доступних синтезаторів мовлення

source: "$program_name -l" available languages codes?
de_de: "$program_name -l" Verfügbare Sprach-Codes?
fr_fr: "$program_name -l " codes de langues disponibles?
it_it: Codici linguistici disponibili di "$program_name -s"?
nl_nl: "$program_name -l" beschikbare taalcodes?
pt_pt: "$program_name -l" códigos de idiomas disponíveis?
uk_ua: "$program_name -l" - Список доступних кодів мов

source: "$program_name -ls <synthesizer>" languages available for this synthesizer?
de_de: "$program_name -ls <synthesizer>" für diesen Synthesizer verfügbare Sprachen?
fr_fr: "$program_name -ls <synthesizeur>" Langues disponibles pour ce synthétiseur?
it_it: "$program_name -ls <synthesizer>" linguaggi disponibili per questo sintetizzatore?
nl_nl: "$program_name -ls <synthesizer>" beschikbare talen voor deze synthesizer?
pt_pt: "$program_name -ls <synthesizer>" idiomas disponíveis para este sintetizador?
uk_ua: "$program_name -ls <назва синтезатора>" - Список мов, що підтримує вказаний синтезатор мовлення

source: "$program_name -sl <language code>" synthesizers providing voices in this language?
de_de: "$program_name -sl <language code>" Welche Synthesizer bieten Stimmen in dieser Sprache?
fr_fr: "$program_name -sl <code langue>" Les synthétiseurs qui fournissent des voix dans cette langue?
it_it: "$program_name -sl <language code>" sintetizzatori che forniscono voci in questa lingua?
nl_nl: "$program_name -sl <language code>" synthesizers die stemmen in deze taal bevatten?
pt_pt: "$program_name -sl <language code>" sintetizadores que fornecem vozes neste idioma?
uk_ua: "$program_name -sl <код мови>" - Список синтезаторів мовлення, що надають голоси для вказаної мови

source: The language code has most often two characters, like 'en' 'es' or 'fr'
de_de: Die Sprach-Codes bestehen meistens aus zwei Zeichen, zum Beispiel 'de', 'en', oder 'fr'
fr_fr: Le code de langue a le plus souvent deux caractères, comme 'en' 'es' ou 'fr'
it_it: Il codice linguistico ha più spesso due caratteri, come 'en' 'es' o 'fr'
nl_nl: De taalcode heeft meestal twee karakters zoals 'en' 'es' of 'fr'
pt_pt: O código de idioma tem frequentemente dois caracteres, como 'en' 'es' ou 'fr'
uk_ua: Найчастіше код мови містить два символи (наприклад "en" es", або fr").

source: "$program_name $*" is not a valid command.
de_de: "$program_name $*" ist kein valides Kommando.
fr_fr: $program_name $*" n'est pas une commande valide.
it_it: "$program_name $*" non è un comando valido.
nl_nl: "$program_name $* " is geen geldige opdracht.
pt_pt: "$program_name $*" não é um comando válido.
uk_ua: "$program_name $*" не є правильною командою.

source: Installed synthesizers:
de_de: Installierte Synthesizer:
fr_fr: Synthétiseurs installés:
it_it: Sintetizzatori installati:
nl_nl: Geïnstalleerde synthesizers:
pt_pt: Sintetizadores instalados:
uk_ua: Встановлені синтезатори мовлення:

source: Available languages:
de_de: Verfügbare Sprachen:
fr_fr: Langues disponibles:
it_it: Lingue disponibili:
nl_nl: Beschikbare talen:
pt_pt: Idiomas disponíveis:
uk_ua: Доступні мови:

source: $parameter2 is not the name of an available synthesizer
de_de: $parameter2 ist kein Name eines verfügbaren Synthesizers
fr_fr: $parameter2 n'est pas le nom d'un synthétiseur disponible
it_it: $parameter2 non è il nome di un sintetizzatore disponibile
nl_nl: $parameter2 is geen naam van een beschikbare synthesizer
pt_pt: $parameter2 não é o nome de um sintetizador disponível
uk_ua: $parameter2 не є назвою доступного синтезатора мовлення

source: No information available about languages for $parameter2.
de_de: Es sind keine Informationen über Sprachen für $parameter2 verfügbar.
fr_fr: Aucune information disponible sur les langues pour $parameter2.
it_it: Nessun'informazione disponibile sulle lingue per $parameter2.
nl_nl: Geen informatie beschikbaar over talen voor $parameter2.
pt_pt: Não há informação disponível sobre idiomas para $parameter2.
uk_ua: Немає інформації про підтримувані мови для $parameter2.

source: Available languages codes for $parameter2:
de_de: Verfügbare Sprach-Codes für $parameter2:
fr_fr: Codes de langues disponibles pour $parameter2:
it_it: Codici linguistici disponibili per $parameter2:
nl_nl: Beschikbare taalcodes voor $parameter2:
pt_pt: Códigos de idiomas disponíveis para $parameter2:
uk_ua: Доступні коди мов для $parameter2:

source: No installed synthesizer provides the language $parameter2
de_de: Keiner der installierten Synthesizer bietet die Sprache $parameter2
fr_fr: Aucun synthétiseur installé ne fournit la langue $parameter2
it_it: Nessun sintetizzatore installato fornisce la lingua $parameter2
nl_nl: Geen synthesizer geïnstalleerd die de taal $parameter2 bevat
pt_pt: Nenhum sintetizador instalado fornece o idioma $parameter2
uk_ua: Жоден зі встановлених синтезаторів не підтримує мову $parameter2

source: The language $parameter2 is provided by:
de_de: Die Sprache $parameter2 wird unterstützt von:
fr_fr: La langue $parameter2 est fournie par:
it_it: La lingua $parameter2 è fornita da:
nl_nl: De taal $parameter2 wordt geleverd door:
pt_pt: O idioma $parameter2 é fornecido por:
uk_ua: Мову $parameter2 підтримують:

source: espeakup (Console screen reader connecting espeak-ng and speakup)\n
de_de: espeakup (Konsolen-Screenreader welcher espeak-ng und speakup verbindet)\n
fr_fr: espeakup (lecteur d'écran pour console connectant espeak-ng et speakup)\n
it_it: espeakup (Lettore dello schermo della console che si connette a espeak-ng e Speak-up)\n
nl_nl: espeakup (consoleschermlezer verbindt espeak-ng en speakup)\n
pt_pt: espeakup (Leitor de ecrã do terminal a ligar o espeak-ng e o speakup)\n
uk_ua: espeakup (Консольний читач екрана, що поєднує espeak-ng і speakup)\n

source: speechd-up (Console screen reader connecting Speech Dispatcher and speakup)\n
de_de: speechd-up (Konsolen-Screenreader welcher Speech Dispatcher und speakup verbindet)\n
fr_fr: soundchd-up (lecteur d'écran pour console connectant Speech Dispatcher et speakup)\n
it_it: speechd-up (Lettore dello schermo della console che si connette a Speech Dispatcher e Speak-up)\n
nl_nl: speechd-up (Console schermlezer verbindt Speech Dispatcher en speakup)\n
pt_pt: speechd-up (Leitor de ecrã do terminal a ligar o Speech Despaccher e speakup)\n
uk_ua: speechd-up (Консольний читач екрана, що поєднує Speech Dispatcher і speakup)\n

source: fenrir (Modular, flexible and fast console screen reader)\n
de_de: fenrir (Modularer, flexibler und schneller Konsolen-Screenreader)\n
fr_fr: fenrir (Lecteur d'écran pour console modulaire, flexible et rapide)\n
it_it: fenrir (Lettore dello schermo da console modulare, flessibile e veloce)\n
nl_nl: fenrir (Modulaire, flexibele en snelle consoleschermlezer)\n
pt_pt: fenrir (Leitor de ecrã do terminal modular, flexível e rápido)\n
uk_ua: fenrir (Модульний, гнучкий і швидкий консольний читач екрана)\n

source: Usage: $program_name <screen reader> or <hard synthesizer> or none
de_de: Verwendung: $program_name <Screenreader> oder <Hard-Synthesizer> oder none
fr_fr: Utilisation: $program_name <lecteur d'écarn> ou <synthétizeur physique> ou aucun
it_it: Uso: $program_name <screen reader> o <hard synthesizer> o nessuno
nl_nl: Gebruik: $program_name <screen reader> of <hard synthesizer> of geen
pt_pt: Utilização: $program_name <screen reader> ou <hard synthesizer> ou nenhum
uk_ua: Використання: $program_name <читач екрана> чи <апаратний синтезатор> або не вказуйте нічого

source: Choose a console screen reader to talk with among:
de_de: Wählen Sie einen Konsolen-Screenreader der sprechen soll:
fr_fr: Choisissez un lecteur d'écran pour console pour la parole parmi:
it_it: Scegli un lettore schermo della console con cui parlare tra:
nl_nl: Kies een consoleschermlezer om mee te praten uit de volgende lijst:
pt_pt: Escolha um leitor de ecrã do terminal para falar entre:
uk_ua: Оберіть консольний читач екрана:

source: or use one of the supported hard synthesizers:
de_de: oder verwenden Sie einen der unterstützten Hard-Synthesizer:
fr_fr: ou utilisez l'un des synthétiseurs matériels pris en charge:
it_it: o usa uno dei sintetizzatori hard supportati:
nl_nl: of gebruik een van de ondersteunde hardware synthesizers:
pt_pt: ou utilize um dos sintetizadores suportados:
uk_ua: або скористайтеся одним із підтримуваних апаратних синтезаторів:

source: or type "$program_name none" to mute all screen readers.
de_de: oder tippen Sie "$program_name none" um alle Screenreader stummzuschalten.
fr_fr: ou tapez "$program_name none" pour rendre muet tous les lecteurs d'écran.
it_it: o digita "$program_name none" per silenziare tutti i lettori dello schermo.
nl_nl: of type "$program_name none " om alle schermlezers uit te schakelen.
pt_pt: ou introduza "$program_name nenhum" para silenciar todos os leitores de ecrã.
uk_ua: або введіть "$program_name none", щоб вимкнути всі читачі екрана.

source: $first_argument_name is not a valid argument of this command.
de_de: $first_argument_name ist kein valides Argument dieses Kommandos.
fr_fr: $first_argument_name n'est pas un argument valide pour cette commande.
it_it: $first_argument_name non è un argomento valido di questo comando.
nl_nl: $first_argument_name is geen geldig argument voor deze opdracht.
pt_pt: $first_argument_name não é um argumento válido deste comando.
uk_ua: $first_argument_name не є правильним аргументом для цієї команди.

source: espeakup is not installed.
de_de: espeakup ist nicht installiert.
fr_fr: espeakup n'est pas installé.
it_it: espeakup non è installato.
nl_nl: Espeakup is niet geïnstalleerd.
pt_pt: espeakup não está instalado.
uk_ua: espeakup не встановлено.

source: $first_argument_name is already started.
de_de: $first_argument_name ist bereits gestartet.
fr_fr: $first_argument_name est déjà démarré.
it_it: $first_argument_name è già iniziato.
nl_nl: $first_argument_name is al gestart.
pt_pt: $first_argument_name já foi iniciado.
uk_ua: $first_argument_name вже запущено.

source: # File written by speak-with. Do not edit.
de_de: # Datei geschrieben von speak-with. Nicht editieren!
fr_fr: # Fichier écrit par speak-with. Ne pas modifier.
it_it: # File scritto da speak-with. Non modificare.
nl_nl: # Bestand geschreven door "speak-with". Wijzig dit niet.
pt_pt: # Ficheiro escrito pelo speak-with. Não editar.
uk_ua: # Файл створено утилітою speak-with. Не редагуйте його.

source: Should espeakup be also started at next boot? [Y/n]
de_de: Soll espeakup auch beim nächsten Bootvorgang gestartet werden? [Y/n]
fr_fr: Est-ce que espeakup devrait également être démarré au prochain démarrage ? [Y/n]
it_it: Anche espeakup dovrebbe esser avviato al prossimo avvio? [S/n]
nl_nl: Moet Espeakup ook bij de volgende start worden uitgevoerd? [Y/n]
pt_pt: O espeakup também deve ser iniciado no próximo arranque? [Y/n]
uk_ua: Також запустити espeakup при наступному завантаженні? [Y/n]

source: Done.
de_de: Fertig.
fr_fr: Effectué.
it_it: Fatto.
nl_nl: Klaar.
pt_pt: Concluído.
uk_ua: Виконано.

source: speechd-up is not installed.
de_de: speechd-up ist nicht installiert.
fr_fr: speechd-up n'est pas installé.
it_it: speechd-up non è installato.
nl_nl: speechd-up is niet geïnstalleerd.
pt_pt: speechd-up não está instalado.
uk_ua: speechd-up не встановлено.

source: speechd-up is already started.
de_de: speechd-up ist bereits gestartet.
fr_fr: speechd-up est déjà démarré.
it_it: speechd-up è già avviato.
nl_nl: speechd-up is al gestart.
pt_pt: speechd-up já foi iniciado.
uk_ua: speechd-up вже запущено.

source: Should speechd-up be also started at next boot? [Y/n]
de_de: Soll speechd-up auch beim nächsten Bootvorgang gestartet werden? [Y/n]
fr_fr: Est-ce que speechd-up devrait également être démarré au prochain démarrage ? [Y/n]
it_it: Anche speechd-up dovrebbe esser avviato al prossimo avvio? [S/n]
nl_nl: Moet speechd-up ook worden uitgevoerd bij de volgende keer opstarten? [ Y/n]
pt_pt: O speechd-up também deve ser iniciado no próximo arranque? [Y/n]
uk_ua: Також запустити speechd-up при наступному завантаженні? [Y/n]

source: fenrir is not installed.
de_de: fenrir ist nicht installiert.
fr_fr: fenrir n'est pas installé.
it_it: fenrir non è installato.
nl_nl: fenrir is niet geïnstalleerd.
pt_pt: fenrir não está instalado.
uk_ua: fenrir не встановлено.

source: fenrir is already started.
de_de: fenrir ist bereits gestartet.
fr_fr: fenrir est déjà démarré.
it_it: fenrir è già avviato.
nl_nl: fenrir is al gestart.
pt_pt: fenrir já foi iniciado.
uk_ua: fenrir вже запущено.

source: Do you also want a mute console at next boot? [Y/n]
de_de: Benötigen Sie auch eine stumme Konsole beim nächsten Bootvorgang? [Y/n]
fr_fr: Voulez-vous également une console muette au prochain démarrage ? [Y/n]
it_it: Desideri silenziare anche la console al prossimo avio [Y/n]
nl_nl: Wil je ook een spraakloze console bij de volgende keer opstarten? [Y/n]
pt_pt: Também quer um terminal mudo na próximo arranque? [Y/n]
uk_ua: Бажаєте також вимкнути консоль при наступному завантаженні? [Y/n]

source: OK
fr_fr: D'accord

source: Unable to switch to the $ARGUMENT synthesizer. Something should be wrong.
de_de: Konnte nicht zum $ARGUMENT Synthesizer wechseln. Hier stimmt etwas nicht.
fr_fr: Impossible de basculer vers le synthétiseur $ARGUMENT . Quelque chose ne va pas.
it_it: Impossibile passare al sintetizzatore dell'$ARGUMENT. Qualcosa dovrebbe non andare bene.
nl_nl: Kan niet overschakelen naar synthesizer $ARGUMENT. Er gaat iets niet goed.
pt_pt: Não é possível alternar para o sintetizador $ARGUMENT. Algo deve estar errado.
uk_ua: Неможливо перемкнутися на синтезатор мовлення $ARGUMENT. Щось пішло не так.

source: Should $ARGUMENT be also used at next boot? [Y/n]
de_de: Soll $ARGUMENT auch beim nächsten Bootvorgang benutzt werden [Y/n]
fr_fr: $ARGUMENT doit-il également être utilisé au prochain démarrage ? [Y/n]
it_it: Anche $ARGUMENT dovrebbe esser usato al prossimo avvio [Y/n]
nl_nl: Moet $ARGUMENT ook worden gebruikt bij de volgende (her)start? [ Y/n]
pt_pt: $ARGUMENT também deve ser usado no próximo arranque? [Y/n]
uk_ua: Бажаєте також використовувати $ARGUMENT при наступному завантаженні? [Y/n]

source: Current speakup settings have been saved in
de_de: Aktuelle speakup Einstellungen wurden gespeichert unter
fr_fr: Les paramètres actuels de speakup ont été enregistrés dans
it_it: Le impostazioni di Speakup correnti sono state salvate in
nl_nl: Huidige speakup-instellingen zijn opgeslagen in
pt_pt: As definições atuais do speakup foram guardadas em
uk_ua: Поточні налаштування speakup збережені до

source: emacspeak (The Complete Audio Desktop, based on emacs)
de_de: emacspeak (der vollständige Audio-Desktop, basiert auf emacs)
fr_fr: emacspeak (le bureau complet audio, basé sur emacs)
it_it: emacspeak (Il Desktop Audio Completo, basato su emacs)
nl_nl: emacspeak (The Complete Audio Desktop, gebaseerd op emacs)
pt_pt: emacspeak (o ambiente de áudio completo, baseado em emacs)
uk_ua: emacspeak (Повністю Озвучене Робоче Середовище, що базується на emacs)

source: speechd-el (Emacs client to speech synthesizers and Braille displays)
de_de: speechd-el (Emacs-Client für Sprachsynthesizer und Braillezeilen)
fr_fr: speechd-el (client Emacs des synthétiseurs vocaux et aux afficheurs braille)
it_it: speechd-el (Client di Emacs per i sintetizzatori vocali e le visualizzazioni in Braille)
nl_nl: speechd-el (Emacs client naar spraak synthesizers en Braille weergaven)
pt_pt: speechd-el (cliente Emacs para sintetizadores de voz e ecrãs Braille)
uk_ua: speechd-el (клієнт Emacs, що підтримує мовлення й дисплеї Брайля)

source: Usage: $program_name <emacspeak> or <speechd-el>
de_de: Verwendung: $program_name <emacspeak> oder <speechd-el>
fr_fr: Utilisation: $program_name <emacspeak> ou <speechd-el>
it_it: Uso: $program_name <emacspeak> o <speechd-el>
nl_nl: Gebruik: $program_name <emacspeak> of <speechd-el>
pt_pt: Utilização: $program_name <emacspeak> ou <speechd-el>
uk_ua: Використання: $program_name <emacspeak> або <speechd-el>

source: This script allows to disable:
de_de: Dieses Script erlaubt es Ihnen, Folgendes zu deaktivieren:
fr_fr: Ce script permet de désactiver :
it_it: Questo script consente di disabilitare:
nl_nl: Met dit script kun je het volgende uitschakelen:
pt_pt: Este script permite desativar:
uk_ua: Цей скрипт вимикає:

source: $1 is an unknown feature.
de_de: $1 ist eine unbekannte Funktion.
fr_fr: $1 est une fonctionnalité inconnue.
it_it: $1 è una funzionalità sconosciuta.
nl_nl: $1 is een onbekende functie.
pt_pt: $1 é uma funcionalidade desconhecida.
uk_ua: Невідома функція $1.

source: Available features:
de_de: Verfügbare Funktionen:
fr_fr: Fonctionnalités disponibles :
it_it: Funzionalità disponibili:
nl_nl: Beschikbare functies:
pt_pt: Funcionalidades disponíveis:
uk_ua: Доступні функції:

source: $1 is not installed
de_de: $1 ist nicht installiert
fr_fr: $1 n'est pas installé
it_it: $1 non è installato
nl_nl: %s is niet geïnstalleerd
pt_pt: %s não está instalado
uk_ua: $1 не встановлено

source: emacspeak is disabled.
de_de: emacspeak ist deaktiviert.
fr_fr: emacspeak est désactivé.
it_it: emacspeak è disabilitato.
nl_nl: emacspeak is uitgeschakeld.
pt_pt: emacspeak está desativado.
uk_ua: emacspeak вимкнено.

source: $1 is not installed.
de_de: $1 ist nicht installiert.
fr_fr: $1 n'est pas installé.
it_it: $1 non è installato.
nl_nl: %s is niet geïnstalleerd.
pt_pt: %s não está instalado.
uk_ua: $1 не встановлено.

source: speechd-el is disabled.
de_de: speechd-el ist deaktiviert.
fr_fr: speechd-el est désactivé.
it_it: speechd-el è disabilitato.
nl_nl: speechd-el is uitgeschakeld.
pt_pt: speechd-el está desativado.
uk_ua: speechd-el вимкнено.

source: This script allows to enable:
de_de: Dieses Script erlaubt es, Folgendes zu aktivieren:
fr_fr: Ce script permet d'activer :
it_it: Questo script consente di abilitare:
nl_nl: Met dit script kun je het volgende inschakelen:
pt_pt: Este script permite ativar:
uk_ua: Цей скрипт вмикає:

source: emacspeak is enabled and speechd-el is disabled, as they are mutually exclusive.
de_de: emacspeak ist aktiviert und speechd-el ist deaktiviert, da sie sich gegenseitig ausschließen.
fr_fr: emacspeak est activé et speechd-el est désactivé, car ils s'excluent mutuellement.
it_it: emacspeak è abilitato e speechd-el è disabilitato, essendo mutualmente esclusivi.
nl_nl: emacspeak is ingeschakeld en speechd-el is uitgeschakeld omdat ze elkaar uitsluiten.
pt_pt: emacspeak está ativado e o speechd-el está desativado, uma vez que são ambos exclusivos.
uk_ua: emacspeak увімкнено, але speechd-el вимкнено, оскільки вони взаємовиключні.

source: Do you want to use a voxin voice with emacspeak? [Y/n]
de_de: Wollen Sie eine voxin-Stimme mit emacspeak verwenden? [Y/n]
fr_fr: Voulez-vous utiliser une voix voxine avec emacspeak? [Y/n]
it_it: Desideri usare una voce voxin con emacspeak? [Y/n]
nl_nl: Wil je in emacspeak een voxin-stem gebruiken? [ Y/n]
pt_pt: Deseja usar uma voz voxin com o emacspeak? [Y/n]
uk_ua: Бажаєте використовувати голос voxin у emacspeak? [Y/n]

source: speechd-el is enabled and emacspeak is disabled, as they are mutually exclusive.
de_de: speechd-el ist aktiviert und emacspeak ist deaktiviert, da sie sich gegenseitig ausschließen.
fr_fr: speechd-el est activé et emacspeak est désactivé, car ils s'excluent mutuellement.
it_it: speechd-el è abilitato ed emacspeak è disabilitato, essendo mutualmente esclusivi.
nl_nl: emacspeak is ingeschakeld en speechd-el is uitgeschakeld omdat ze elkaar uitsluiten.
pt_pt: speechd-el está ativado e o emacspeak está desativado, uma vez que são ambos exclusivos.
uk_ua: speechd-el увімкнено, але emacspeak вимкнено, оскільки вони взаємовиключні.
