Repository: DidierSpaier/slint-translations
Catalog: translations20220905/slint-scripts/*.slint_scripts.po
Languages: de_de, fr_fr, it_it, nl_nl, pt_pt, uk_ua

source: Navigate in this sub-menu with the up and down arrow keys. Press Enter to read a highlighted document. Press Q to stop reading a document and go back to this sub-menu. Press Escape to return to the main menu.
de_de: Navigieren Sie in diesem Unter-Menü durch drücken der Pfeil-rauf und Pfeil-runter Tasten. Drücken Sie die Eingabetaste um das hervorgehobene Dokument zu lesen. Drücken Sie die Taste Q um das Lesen eines Dokuments zu beenden und in dieses Untermenü zurückzukehren. Drücken Sie die Escape-Taste um in das Hauptmenü zurückzukehren.
fr_fr: Naviguez dans ce sous-menu avec les touches fléchées haut et bas. Appuyez sur Entrée pour lire un document en surbrillance. Appuyez sur Q pour arrêter de lire un document et retourner à ce sous-menu. Appuyez sur Échap pour revenir au menu principal.
it_it: Naviga in questo sottomenu con i tasti freccia su e giù. Premi Invio per leggere un documento evidenziato. Premi Q per interrompere la lettura di un documento e tornare a questo sottomenu. Premi Esc per tornare al menu principale.
nl_nl: Navigeer in dit menu met de cursortoetsen omhoog en omlaag. Druk op Enter om een geaccentueerd document te lezen. Druk op Q om een document te sluiten en terug te gaan naar het menu. Druk op Escape om te stoppen.
pt_pt: Navegue neste sub-menu com as teclas de seta para cima e para baixo. Prima Enter para ler um documento destacado. Prima Q para parar de ler um documento e voltar ao sub-menu. Prima Esc para voltar ao menu principal.
uk_ua: Для навігації по цьому підменю, використовуйте курсорні клавіші вгору та вниз. Натисніть Enter, щоб переглянути вибраний документ. Натисніть Q щоб зупинити читання документа, і повернутися до цього підменю. Натисніть Escape, щоб повернутися до головного меню.

source: Accessibility HowTo
de_de: Barrierefreiheit
fr_fr: Accessibilité comment faire
it_it: Accessibilità HowTo
nl_nl: How-To toegankelijkheid
pt_pt: Tutorial de Acessibilidade
uk_ua: Інформація про доступність у дистрибутиві Slint

source: Brltty HowTo
de_de: Brltty Anleitung
fr_fr: Brltty coment faire
pt_pt: Tutorial Brltty
uk_ua: Особливості використання Brltty

source: Key bindings for Compiz
de_de: Tastenkürzel für Compiz
fr_fr: Raccourcis clavier pour Compiz
it_it: Associazioni di tasti per Compiz
nl_nl: Sneltoetsen van Compiz
pt_pt: Combinações de teclas para o Compiz
uk_ua: Сполучення клавіш Compiz

source: Key bindings for Mate
de_de: Tastenkürzel für Mate
fr_fr: Raccourcis clavier pour Mate
it_it: Associazioni di tasti per Mate
nl_nl: Sneltoetsen van Mate
pt_pt: Combinações de teclas para o Mate
uk_ua: Сполучення клавіш Mate

source: Espeakup usage
de_de: Espeakup Verwendung
fr_fr: Utilisation de Espeakup
it_it: Uso di Espeakup
nl_nl: Espeakup gebruiken
pt_pt: Utilização do espeakup
uk_ua: Використання Espeakup

source: Fenrir usage
de_de: Fenrir Verwendung
fr_fr: Utilisation de Fenrir
it_it: Utilizzo di Fenrir
nl_nl: Fenrir gebruiken
pt_pt: Utilização do Fenrir
uk_ua: Використання Fenrir

source: How-to use the MBROLA voices
de_de: Verwendung der MBROLA Stimmen
fr_fr: Comment utiliser les voix MBROLA
it_it: Come usare le voci di MBROLA
nl_nl: MBROLA stemmen gebruiken
pt_pt: Como utilizar as vozes do MBROLA
uk_ua: Використання голосів MBROLA

source: SpeechD-El usage
de_de: SpeechD-El Verwendung
fr_fr: Utilisation de SpeechD-El
it_it: Uso di SpeechD-El
nl_nl: SpeechD-El gebruiken
pt_pt: Utilização do SpeechD-El
uk_ua: Використання SpeechD-El

source: SpeechD-Up usage
de_de: SpeechD-Up Verwendung
fr_fr: Utilisation de SpeechD-Up
it_it: Uso di SpeechD-Up
nl_nl: SpeechD-El gebruiken
pt_pt: Utilização do SpeechD-Up
uk_ua: Використання SpeechD-Up

source: How-to make Slint speak (or not).
de_de: Wie man Slint zum Reden bringt (oder nicht).
fr_fr: Comment faire parler Slint (ou pas).
it_it: Come far parlare (o no) Slint.
nl_nl: Slint laten spreken (of niet).
pt_pt: Como fazer o Slint falar (ou não).
uk_ua: Як змусити Slint розмовляти (чи навпаки).

source: Speakup key bindings with a numeric keypad
de_de: Speakup Tastenkürzel mit einem numerischem Tastenfeld
fr_fr: Raccourcis clavier pour Speakup avec un pavé numérique
it_it: Associazioni di tasti parlate con un tastierino numerico
nl_nl: Speakup sneltoetsen met een numeriek toetsenblok
pt_pt: Combinação de teclas do Speakup com um teclado numérico
uk_ua: Сполучення клавіш Speakup для клавіатур із додаткових цифровим блоком

source: Speakup key bindings without numeric keypad
de_de: Speakup Tastenkürzel ohne numerischem Tastenfeld
fr_fr: Raccourcis clavier pour Speakup sans pavé numérique
it_it: Associazioni di tasti parlate senza tastierino numerico
nl_nl: Speakup toetsbediening zonder numeriek toetsenblok
pt_pt: Combinação de teclas do Speakup sem um teclado numérico
uk_ua: Сполучення клавіш Speakup для клавіатур без додаткового цифрового блоку

source: Voices and TTS in Slint
de_de: Stimmen und TTS in Slint
fr_fr: Voix et TTS dans Slint
it_it: Voci e TTS su Slint
nl_nl: Stemmen en TTS in Slint
pt_pt: Vozes e TTS no Slint
uk_ua: Голоси й рушії перетворення тексту в мовлення, що входять до складу Slint

source: Speakup guide (kernel documentation)
de_de: Speakup Anleitung (Kernel Dokumentation)
fr_fr: Guide de Speakup (documentation du noyau)
it_it: Guida parlata (documentazione del kernel)
nl_nl: Speakup handleiding (kerneldocumentatie)
pt_pt: Guia do speakup (documentação do kernel)
uk_ua: Посібник із використання Speakup (документація ядра)

source: How to localize shell scripts
de_de: Wie man Shell-Scripts lokalisiert
fr_fr: Comment localiser les scripts shell
it_it: Come localizzare gli script della shell
nl_nl: Lokalisatie van shell scripts
pt_pt: Como localizar scripts de shell
uk_ua: Як локалізовувати скрипти shell

source: General presentation
de_de: Allgemeiner Überblick
fr_fr: Présentation générale
it_it: Presentazione generale
nl_nl: Algemene beschrijving
pt_pt: Apresentação geral
uk_ua: Загальне ознайомлення

source: Processes diagrams
de_de: Diagramme der Prozesse
fr_fr: Diagramme de processus
it_it: Diagrammi dei processi
nl_nl: Procesdiagrammen
pt_pt: Diagrama de processos
uk_ua: Діаграми процесів

source: Internationalization process
de_de: Prozess der Internationalisierung
fr_fr: Processus d'internationalisation
it_it: Processo d'internazionalizzazione
nl_nl: Internationaliseringsproces
pt_pt: Processo de internacionalização
uk_ua: Процес інтернаціоналізації

source: Localization, usage and maintenance processes
de_de: Prozesse der Lokalisierung, Verwendung und Wartung
fr_fr: Processus de localisation, d'utilisation et de maintenance
it_it: Localizzazione, uso e manutenzione dei processi
nl_nl: Gebruiks- en onderhoudsprocessen voor lokalisaties
pt_pt: Localização, utilização e processos de manutenção
uk_ua: Процеси локалізації, використання й супроводу

source: Recommendations for developers and maintainers
de_de: Empfehlungen für Entwickler und Instandhalter
fr_fr: Recommandations pour développeurs et mainteneurs
it_it: Consigli per sviluppatori e manutentori
nl_nl: Aanbevelingen voor ontwikkelaars en beheerders
pt_pt: Recomendações para programadores e responsáveis
uk_ua: Рекомендації для розробників і супровідників

source: Recommendations for translators
de_de: Empfehlungen für Übersetzer
fr_fr: Recommandations pour les traducteurs
it_it: Consigli per traduttori
nl_nl: Aanbevelingen voor vertalers
pt_pt: Recomendações para tradutores
uk_ua: Рекомендації для перекладачів

source: How to display man pages in Persian
de_de: Wie man Manpages in Persisch anzeigt
fr_fr: Comment afficher les pages de manuel en persan
it_it: Come mostrare le pagine principali in persiano
nl_nl: Het weergeven van man pages in het Perzisch
pt_pt: Como mostrar páginas do manual em Persa
uk_ua: Як відобразити сторінки довідки man Перською мовою

source: How to in English (Portable Document)
de_de: Anleitung in englischer Sprache (portables Dokument)
fr_fr: Comment faire en anglais (document portable)
it_it: Come fare in inglese (Documento Portatile)
nl_nl: How-To in het Engels (Portable Document)
pt_pt: Tutorial em Inglês (Documento PDF)
uk_ua: Англійською (документ PDF)

source: How to in Persian (Portable Document)
de_de: Anleitung in persischer Sprache (portables Dokument)
fr_fr: Comment faire en persan (document portable)
it_it: Come fare in persiano (Documento Portatile)
nl_nl: How-To in het Perzisch (Portable Document)
pt_pt: Tutorial em Persa (Documento PDF)
uk_ua: Перською (документ PDF)

source: Slint documentation
de_de: Slint Dokumentation
fr_fr: Documentation Slint
it_it: Documentazione di Slint
nl_nl: Slint documentatie
pt_pt: Documentação do Slint
uk_ua: Документація Slint

source: Presentation of the Slint project
de_de: Vorstellung des Slint Projekts
fr_fr: Présentation du projet Slint
it_it: Presentazione del progetto di Slint
nl_nl: Beschrijving van het Slint project
pt_pt: Apresentação do projeto Slint
uk_ua: Знайомство з проєктом Slint

source: >> Slint for the visually impaired (sub-menu)
de_de: >> Slint für sehbeeinträchtigte Menschen (Untermenü)
fr_fr: >> Slint pour les malvoyants (sous-menu)
it_it: >> Slint per gli ipovedenti (sottomenu)
nl_nl: >> Slint voor mensen met een visuele beperking (submenu)
pt_pt: >> Slint para deficientes visuais (sub-menu)
uk_ua: >> Slint для незрячих і слабозорих користувачів (підменю)

source: Announce of Slint64-14.2.1.2
de_de: Ankündigung von Slint64-14.2.1.2
fr_fr: Annonce de Slint64-14.2.1.2
it_it: Annuncio di Slint64-14.2.1.2
nl_nl: Aankondiging van Slint64-14.2.1.2
pt_pt: Anúncio do Slint64-14.2.1.2
uk_ua: Анонс релізу Slint64-14.2.1.2

source: Introduction - Slint documentation
de_de: Einführung - Slint Dokumentation
fr_fr: Introduction - Documentation de Slint
it_it: Introduzione - Documentazione di Slint
nl_nl: Introductie - Slint documentatie
pt_pt: Introdução - Documentação do Slint
uk_ua: Вступ - документація Slint

source: How to upgrade the kernels provided by Slint
de_de: Wie man die von Slint bereitgestellten Kernel upgradet
fr_fr: Comment mettre à niveau les noyaux fournis par Slint
it_it: Come aggiornare i kernel forniti da Slint
nl_nl: Hoe de bij Slint geleverde kernels te upgraden
pt_pt: Como atualizar os kernels fornecidos pelo Slint
uk_ua: Як оновлювати ядра, що надає Slint

source: >> How-to localize shell scrips (sub-menu)
de_de: >> Wie man Shell-Scripts lokalisiert (Untermenü)
fr_fr: >> Comment localiser les scripts shell (sous-menu)
it_it: >> Come localizzare gli script della shell (sottomenu)
nl_nl: >> Lokalisatie van shell scripts (submenu)
pt_pt: >> Como localizar scripts de shell (submenu)
uk_ua: >> Як локалізовувати скрипти shell (підменю)

source: >> How-to display man pages in Persian (sub-menu)
de_de: >> Wie man Manpages auf Persisch anzeigt (Untermenü)
fr_fr: >> Comment afficher les pages de manuel en persan (sous-menu)
it_it: >> Come mostrare le pagine principali in persiano (sottomenu)
nl_nl: >> In het Perzisch weergeven van man pages (submenu)
pt_pt: >> Como mostrar páginas do manual em Persa (sub-menu)
uk_ua: >> Як відобразити сторінки довідки man Перською мовою (підменю)

source: How to manage network connections
de_de: Wie man Netzwerkverbindungen verwaltet
fr_fr: Comment gérer les connexions réseau
it_it: Come gestire le connessioni di rete
nl_nl: Netwerkverbindingen beheren
pt_pt: Como gerir ligações de rede
uk_ua: Як керувати мережевими з'єднаннями

source: What's new in Slint64-14.2.1.2
de_de: Was gibt es Neues in Slint64-14.2.1.2
fr_fr: Les nouveautés de Slint64-14.2.1.2
it_it: Novità su Slint64-14.2.1.2
nl_nl: Wat is er nieuw in Slint64-14.2.1.2
pt_pt: O que há de novo no Slint64-14.2.1.2
uk_ua: Нове у Slint64-14.2.1.2

source: Presentation of Slint64-14.2.1.2
de_de: Vorstellung von Slint64-14.2.1.2
fr_fr: Présentation de Slint64-14.2.1.2
it_it: Presentazione di Slint64-14.2.1.2
nl_nl: Presentatie van Slint64-14.2.1.2
pt_pt: Apresentação do Slint64-14.2.1.2
uk_ua: Знайомство зі Slint64-14.2.1.2

source: Create and maintain a portable Slint
de_de: Erstellung eines portablen Slint Systems
fr_fr: Créer et maintenir un système Slint portable
it_it: Crea e mantieni uno Slint portatile
nl_nl: Een "portable" Slint maken en onderhouden
pt_pt: Criar e manter um Slint portátil
uk_ua: Створення й супровід переносного Slint

source: Software Management in Slint
de_de: Softwareverwaltung in Slint
fr_fr: Gestion des logiciel dans Slint
it_it: Gestione del Software in Slint
nl_nl: Softwarebeheer in Slint
pt_pt: Gestão de Software no Slint
uk_ua: Керування програмним забезпеченням у Slint

source: Manage the sound in Slint
de_de: Soundverwaltung in Slint
fr_fr: Gérer le son dans Slint
it_it: Gestisci il suono in Slint
nl_nl: Geluid beheren in Slint
pt_pt: Gerir o som no Slint
uk_ua: Керування звуком у Slint

source: Utilities to manage your Slint system
de_de: Hilfsprogramme um Ihr Slint System zu verwalten
fr_fr: Utilitaires pour gérer votre système Slint
it_it: Utilità per gestire il tuo sistema di Slint
nl_nl: Hulpprogramma's voor het beheren van je Slint-systeem
pt_pt: Utilitários para gerir o sistema Slint
uk_ua: Утиліти для керування вашою системою Slint

source: Running a graphical session as root is not allowed.
de_de: Eine grafische Session als root auszuführen ist nicht erlaubt.
fr_fr: L'exécution d'une session graphique en tant que root n'est pas autorisée.
it_it: Eseguire una sessione grafica come di root non è consentito.
nl_nl: Het uitvoeren van een grafische sessie als root is niet toegestaan.
pt_pt: A execução de uma sessão gráfica como root não é permitida.
uk_ua: Запуск графічного сеансу з правами root заборонено.

source: Usage: $0 <desktop session> Available desktop sessions:
de_de: Verwendung: $0 <desktop session> Verfügbare Desktop-Sessions:
fr_fr: Utilisation: $0 <session de bureau> Sessions bureau disponibles:
it_it: Uso: $0 <desktop session> Sessioni desktop disponibili:
nl_nl: Gebruik: $0 <desktop session> Beschikbare grafische sessies:
pt_pt: Utilização: $0 <desktop session> Sessões de ambientes disponíveis:
uk_ua: Використання: $0 <сеанс стільниці> Доступні сеанси стільниці:

source: The session is currently set for $USER to
de_de: Die Session ist derzeit für den Benutzer $USER gesetzt auf
fr_fr: La session est actuellement configurée pour $USER à
it_it: La sessione è correntemente impostata per $USER a
nl_nl: De sessie voor $USER is momenteel ingesteld op
pt_pt: A sessão está atualmente definida para $USER para
uk_ua: Наразі для користувача $USER, вибрано сеанс

source: $1 not found among the available sessions
de_de: $1 wurde nicht unter den verfügbaren Sessions gefunden
fr_fr: $ 1 non trouvé parmi les sessions disponibles
it_it: $1 non trovato tra le sessioni disponibili
nl_nl: $1 werd niet gevonden als beschikbare sessie
pt_pt: $1 não encontrados entre as sessões disponíveis
uk_ua: $1 немає серед доступних сеансів

source: The current session is
de_de: Die aktuelle Session ist
fr_fr: La session en cours est
it_it: La sessione corrente è
nl_nl: De huidige sessie is
pt_pt: A sessão atual é
uk_ua: Поточний сеанс

source: A default session $thissession has been set for ${USER}.
de_de: Eine Standard-Session $thissession wurde für folgenden Benutzer gesetzt: ${USER}.
fr_fr: Une session par défaut $thissession a été définie pour ${USER}.
it_it: Una sessione predefinita $thissession è stata impostata per ${USER}.
nl_nl: Een standaardsessie $thissession is ingesteld voor ${USER}.
pt_pt: Uma sessão padrão $thissession foi definida para ${USER}.
uk_ua: $thissession вибрано основним сеансом для користувача ${USER}.

source: Usage: $program_name username.
de_de: Verwendung: $program_name Benutzername.
fr_fr: Utilisation: $program_name nom d'utilisateur.
it_it: Uso: nome utente di $program_name.
nl_nl: Gebruik: $program_name gebruikersnaam.
pt_pt: Utilização: $program_name nome de utilizador.
uk_ua: Використання: $program_name ім'я користувача.

source: This script should be run as root, for a regular user account that has just been created. To set your default session as regular user, use session-chooser instead. errors go to /tmp/setsession-errors
de_de: Dieses Script sollte als root ausgeführt werden, für einen regulären Benutzeraccount der gerade eben erstellt wurde. Um Ihre Standard-Session als regulärer Benutzer zu setzen, führen Sie stattdessen bitte session-chooser aus. Fehler werden in /tmp/setsession-errors erwähnt
fr_fr: Ce script doit être exécuté en tant que root, pour un compte utilisateur normal que vient d'être créé. Pour définir votre session par défaut comme utilisateur normal, utilise plutôt le sression-chooser. Les erreurs vont dans /tmp/setsession-erreurs
it_it: Questo script dovrebbe esser eseguito come di root, per il profilo di un utente regolare che è appena stato creato. Per impostare la tua sessione predefinita come un utente regolare, usa la selezione della sessione piuttosto. gli errori vanno a /tmp/setsession-errors
nl_nl: Dit script moet als root worden uitgevoerd voor een net aangemaakt gewoon gebruikersaccount. Om je standaardsessie als gewone gebruiker in te stellen kun je in plaats daarvan session-chooser gebruiken. fouten worden opgeslagen in /tmp/setsession-errors
pt_pt: Este script deve ser executado como root, para uma conta de utilizador que acabou de ser criada. Para definir a sua sessão padrão como utilizador, use o session-chooser em vez disso. os erros vão para /tmp/setsession-errors
uk_ua: Цей скрипт потрібно запускати з правами root, для облікового запису звичайного користувача. Щоб вибрати основний сеанс із правами звичайного користувача, скористайтеся session-chooser. За інформацією стосовно помилок, зверніться до /tmp/setsession-errors

source: No system wide default session has been set.
de_de: Es wurde keine systemweite Standard-Session gesetzt.
fr_fr: Aucune session par défaut au niveau système n'a été définie.
it_it: Nessuna sessione predefinita ampia del sistema è stata impostata.
nl_nl: Er is geen standaardsessie voor het systeem ingesteld.
pt_pt: Nenhuma sessão padrão do sistema foi definida.
uk_ua: Основного сеансу системи не вибрано.

source: No home directory for user $user. Does it exist?
de_de: Kein Home-Verzeichnis für Benutzer $user. Existiert es?
fr_fr: Aucun répertoire de base pour l'utilisateur $user. Existe-t-il?
it_it: Nessuna cartella home per l'utente $user. Esiste?
nl_nl: Geen gebruikersmap voor gebruiker $user. Bestaat die wel?
pt_pt: Nenhuma pasta pessoal para o utilizador $user. Ela existe?
uk_ua: Немає домашнього каталогу для користувача $user. Він існує?

source: A default session has already been set for user $user.
de_de: Für den Benutzer $user wurde breeits eine Standard-Session gesetzt.
fr_fr: Une session par défaut a déjà été définie pour l'utilisateur $user.
it_it: Una sessione predefinita è già stata impostata per l'utente $user.
nl_nl: Er is al een standaardsessie ingesteld voor gebruiker $user.
pt_pt: Uma sessão padrão já foi definida para o utilizador $user.
uk_ua: Основний сеанс вже вибрано для користувача $user.

source: A default session $xsession has been set for user $user.
de_de: Eine Standard-Session $xsession wurde für Benutzer $user bereits gesetzt.
fr_fr: Une session par défaut $xsession a été définie pour l'utilisateur $user.
it_it: Una sessione predefinita $xsession è stata impostata per l'utente $user.
nl_nl: Een standaardsessie $xsession is ingesteld voor $user.
pt_pt: Uma sessão padrão $xsession foi definida para o utilizador $user.
uk_ua: $xsession вибрано основним сеансом для користувача $user.

source: Only root is allowed to run this program.
de_de: Nur root ist berechtigt, dieses Programm auszuführen.
fr_fr: Seul root est autorisé à exécuter ce programme.
it_it: Solo il root è consentito per eseguire questo programma.
nl_nl: Alleen root mag dit programma uitvoeren.
pt_pt: Apenas o root pode executar este programa.
uk_ua: Цю програму може запускати лише root.

source: This script includes KDE applications in the menus of all graphical environments for all users, but the applications for personal information management, that however stay available from KDE. This can be reverted with the command hide-kde-apps.
de_de: Dieses Script inkludiert (für alle Benutzer) KDE-Applikationen in die Menüs aller grafischen Umgebungen. Ausgenommen davon sind die Applikationen für das persönliche Informationsmanagement, welches jedoch noch immer aus dem KDE-Menü aufrufbar bleibt. Die Änderungen können mit dem Befehl hide-kde-apps wieder rückgängig gemacht werden.
fr_fr: Ce script inclut les applications KDE dans les menus de tous les environnements graphiques pour tous les utilisateurs, sauf les applications pour la gestion des informations personnelles, qui restent cependant disponibles à partir de KDE. Cela peut être inversé avec la commande hide-kde-apps.
it_it: Questo script include le applicazioni KDE nei menu di tutti gli ambienti grafici per tutti gli utenti, ma le applicazioni per la gestione delle informazioni personali, che comunque restano disponibili da KDE. Questo si può ripristinare con il comando hide-kde-apps.
nl_nl: Dit script bevat KDE-toepassingen in de menu's van alle grafische omgevingen voor alle gebruikers behalve de toepassingen voor persoonlijk informatiebeheer die echter beschikbaar blijven vanuit KDE. Dit kan worden teruggedraaid met de opdracht hide-kde-apps.
pt_pt: Este script inclui aplicações KDE nos menus de todos os ambientes gráficos para todos os utilizadores, mas as aplicações para gestão de informações pessoais, que, no entanto, permanecem disponíveis no KDE. Isto pode ser revertido com o comando: hide-kde-apps.
uk_ua: Цей скрипт вмикає відображення всіх програм KDE у меню всіх стільниць для всіх користувачів окрім програм для керування персональною інформацією, які залишаються доступними лише із KDE. Для зворотньої дії, виконайте команду hide-kde-apps.

source: This script lists languages and synthesizers available for applications relying on Speech Dispatcher, like Orca or speech-up. Each command below answers the question following it. Don't type the quotes surrounding the command.
de_de: Dieses Script listet alle verfügbaren Sprachen und Synthesizer für Programme welche Speech Dispatcher verwenden, etwa Orca oder speech-up. Jedes unten erwähnte Kommando erteilt Auskunft über die jeweilig danach erwähnte Frage. Bitte geben Sie die Befehle ohne den umgebenden Anführungszeichen ein.
fr_fr: Ce script liste les langages et les synthétiseurs disponibles pour les applications s'appuyant sur Speech Dispatcher, comme Orca ou speechd-up. Chaque commande ci-dessous répond à la question qui suit. Ne tapez pas les guillemets entourant la commande.
it_it: Questo script elenca linguaggi e sintetizzatori disponibili per le applicazioni che si affidano a Speech Dispatcher, come Orca o Speech-up. Ogni comando di seguito risponde alla domande che lo segue. Non digitare le virgolette circostanti al comando.
nl_nl: Dit script bevat talen en synthesizers voor toepassingen die gebruik maken van Speech Dispatcher zoals Orca of speech-up. Elke onderstaande opdracht beantwoordt de vraag die er achter staat. Typ de opdracht zonder aanhalingstekens.
pt_pt: Este script lista idiomas e sintetizadores disponíveis para aplicações dependendo do Speech Dispatcher, como o Orca ou aspeech-up. Cada comando abaixo responde à pergunta que a segue. Não escreva as aspas ao redor do comando.
uk_ua: Цей скрипт виводить список усіх доступних синтезаторів мовлення й підтримуваних ними мов для програм які використовують Speech Dispatcher, таких як Orca чи Speech-up. Вводьте без лапок, що оточують команди.

source: "$program_name" usage?
de_de: "$program_name" Verwendung?
fr_fr: Utilisation de "$program_name" ?
it_it: Uso di "$program_name"?
nl_nl: "$program_name" gebruikt programma?
pt_pt: Utilização de "$program_name"?
uk_ua: "$program_name" - Довідка з використання
