Repository: DidierSpaier/slint-translations
Catalog: po/auto/*.auto.po
Languages: it_it

source: There don't seem to be any partitions on this machine of type Linux and size at least ${GCOUNT}G. You need one to install Linux. For more information, choose 'doc' from the menu.
it_it: Non sembra esistere alcuna partizione di tipo Linux su questa macchina e di dimensioni di almeno ${GCOUNT}G. Necessiti di una di esse per installare Linux. Per ulteriori informazioni, scegli 'doc' dal menu.

source: This machine booted in EFI mode but no big enough EFI System Partition found. For more information. choose 'doc' from the menu.
it_it: Questa macchina è avviata in modalità EFI, ma non è stata trovata alcuna Partizione di Sistema EFI abbastanza grande. Per ulteriori informazioni, scegli 'doc' dal menu.

source: If the root partition is in a drive with a GPT, GRUB needs a BIOS boot partition on the same drive, of size at least 3M. We didn't find such a configuration.
it_it: Se la partizione di root si trova in un'unità con un GPT, GRUB necessita di una partizione di avvio del BIOS sulla stessa unità, di almeno 3M. Non abbiamo trovato una simile configurazione.

source: We didn't find a drive of size at least ${GCOUNT}G and no mounted partition, so the automatic partitioning is not possible.
it_it: Non abbiamo trovato un'unità di dimensioni di almeno ${GCOUNT}G e nessuna partizione montata, quindi la partizione automatica non è possibile.

source: The machine booted in EFI mode but we did not find a potential root partition with an EFI system partition on the same drive so the manual partitioning mode is not possible.
it_it: La macchina è avviata in modalità EFI, ma non abbiamo trovato una partizione di root potenziale con una partizione di sistema EFI sulla stessa unità, quindi la modalità di partizione Manuale è impossibile.

source: Press Enter to go back to the menu
it_it: Premi Invio per tornare al menù

source: Welcome back to the menu of the Slint installer. You may now type (without the quotes): 'doc' to know the features and usage of the installer. 'start' to start the installation. The installer can prepare the drive where Slint will be installed, creating the the needed partitions. If you prefer you can do it yourself using command line utilities available in the installer, then type 'start' when done. You can also leave the installer and use a tool like gparted to do that then start the installer again. We recommend that you type 'doc' first in this case, or if you want to encrypt the root Slint partition. When you finish reading this menu will be displayed again.
it_it: Bentornato al menu dell'installatore di Slint. Puoi ora digitare (senza le virgolette): 'doc' per conoscere le funzionalità e l'uso dell'installatore. 'start' per avviare l'installazione. L'installatore può preparare l'unità in cui sarà installato Slint, creando le partizioni necessarie. Se preferisci, puoi farlo tu stesso usando le utility della riga di comando disponibili nell'installatore, poi digitare 'start' quando hai fatto. Puoi anche uscire dall'installatore e usare uno strumento come gparted per farlo, poi riaprire l'installatore. In questo caso, ti consigliamo di digitare prima 'doc', o se desideri farlo, di crittografare la partizione di root di Slint. Al termine, sarà mostrato nuovamente questo menu.

source: In manual partitioning mode you partition and format the drive where you want to install Slint to your liking, using utilities it includes. This gives you more choices of partitions layout and file systems but needs to be acquainted to Linux and the command line (but you may also have used a tool like gparted live before starting the installer, or from another system).
it_it: Nella modalità di partizionamento manuale, esegui la partizione e formatti l'unità in cui desideri installare Slint a tuo piacimento, usando le utility che include. Questo di da' più scelte sulla disposizione delle partizioni e i file di sistema, ma devi avere dimestichezza con Linux e la riga di comando (ma potresti anche aver usato uno strumento come gparted live, prima di avviare l'installatore, o da un altro sistema).

source: In auto mode the installer do it for you, but chooses the partition layout and the file system.
it_it: In modalità automatica, l'installatore lo fa per te, ma sceglie la disposizione della partizione e il file di sistema.

source: In both modes you will be given a chance to indicate existing partitions (not needed by Slint) that you want to access from Slint.
it_it: In entrambe le modalità ti sarà data la possibilità di indicare le partizioni esistenti (non necessarie per Slint), a cui vuoi accedere da Slint.

source: Press Enter to continue
it_it: Premi Invio per continuare

source: These directories should not be mounted on separate partitions: $RESERVED or use arbitrary directory names, for instance to mount other Linux systems.
it_it: Queste cartelle non dovrebbero esser montate su partizioni differenti: $RESERVED o usa i nomi della cartella arbitrari, ad esempio, per montare altri sistemi di Linux.

source: You may dedicate all the space available on the drive (${ARG2}G) to the root Slint partition, or make this partition smaller (at least ${ARG1}G) to reserve some space for a future use, like setting up a partition shared across OS or installing later another OS alongside Slint. To dedicate all the available space to the root Slint partition, set its size to ${ARG2}G.
it_it: Potresti dedicare tutto lo spazio disponibile sull'unità (${ARG2}G) alla partizione di root di Slint, o rendere più piccola questa partizione (almeno ${ARG1}G) per riservare dello spazio per un uso futuro, come configurare una partizione condivisa tra più OS o installare in seguito un altro OS insieme a Slint. Per dedicare tutto lo spazio disponibile alla partizione di root di Slint, impostane le dimensioni a ${ARG2}G.

source: brtfs is the most advanced and flexible linux file system, offering snapshots, subvolumes support, online check and repair, RAID. Using these features needs some learning. ex4 is the most common Linux file system and is very reliable. xfs can be preferred to ext if you have very large storage requirements with large files
it_it: brtfs è il file di sistema di Linux più avanzato e flessibile, offrendo istantanee, supporto ai volumi secondari, controllo e riparazione online, RAID. L'uso di queste funzionalità necessità di un certo apprendimento. ex4 è il file di sistema più comune di Linux ed è molto affidabile. xfs può esser preferito a ex5 se hai requisiti d'archiviazione molto grandi con i file grandi

source: Encrypt a drive prevents theft of the data it contains in case of loss or theft of the drive itself or of the machine where it is installed. If you decide to encrypt it, you will need to type a so called "passphrase" to unlock it every time you boot Slint. Be aware that if you forget the passphrase all data in the drive will be irrecoverably lost! So write it down carefully on a safe place. We will ask you to type the passphrase later using a "us" keyboard map.
it_it: Crittografare un'unità impedisce il furto dei dati che contiene nel caso di perdita o furto dell'unità stessa o della macchina in cui è installato. Se decidi di crittografarla, dovrai digitare una cosiddetta "parola d'ordine" per sbloccarla, ogni volta che avvii Slint. Sappi che se dimentichi la parola d'ordine, tutti i dati nell'unità saranno irrecuperabilmente perduti! Quindi annotala attentamente in un posto sicuro. Ti chiederemo di digitarla in seguito usando una tastiera "us".

source: As you are currently using a "$KEYMAP" keyboard map, we will spell each character of the passphrase you type, which may differ from the one engraved on the keyboard key.
it_it: Poiché correntemente stai usando una tastiera "$KEYMAP", faremo lo spelling di ogni carattere della parola d'ordine che digiti, che potrebbe differire da quello segnato sul tasto della tastiera.

source: The passphrase should have at least 8 characters. Only ASCII printable characters are allowed. This includes non accented lower case and capital letters, digits from 0 to 9, space and following punctuation characters:
it_it: La parola segreta dovrebbe contenere almeno 8 caratteri. Sono consentiti solo i caratteri stampabili ASCII. Ciò include il minuscolo non accentato e le lettere maiuscole, le cifre da 0 a 9, lo spazio e i seguenti segni di punteggiatura:

source: If you choose C (Console) Slint will start in text mode, in a console where you type commands at the prompt. It will first ask your login name then your password. After that you can type commands or start a graphical environment just typing: 'startx' without the quotes. If instead you choose G (Graphical) you will type your login name then your password in a window, then the graphical environment will be displayed.
it_it: Se scegli C (Console), Slint si avvierà in modalità testuale, in una console in cui digiti i comandi al prompt. Prima, chiederà il tuo nome d'accesso, poi la tua password. Dopodiché, puoi digitare i comandi o avviare un ambiente grafico solo digitando: 'startx' senza le virgolette. Se, invece, scegli G (Grafico), digiterai il tuo nome d'accesso e poi la tua password in una finestra, poi sarà mostrato l'ambiente grafico.

source: In the links web browser you navigate with the keyboard: To go to the next or previous fields press the up or down arrow keys To quit press q then confirm pressing Enter To display the key bindings press F1 to display the menu press Esc then navigate with the arrow keys
it_it: Nel browser web dei link, navighi con la tastiera: Per andare ai campi successivi o precedenti, premi i tasti freccia su o giù Per uscire premi q, quindi confermi premendo Invio Per mostrare le scorciatoie da tastiera, premi F1 Per mostrare il menu premi Esc, quindi navighi con i tasti freccia

source: Press Enter to continue.
it_it: Premi Invio per continuare.

source: Please choose mount point for $NAME. Use only lower case letters and do not choose a directory name reserved in Linux or in other OS from which this partition will be accessed.
it_it: Sei pregato di scegliere il punto di montaggio per $NAME. Usa solo le lettere minuscole e non scegliere un nome della cartella riservato su Linux o in un altro OS da cui sarà accessibile questa partizione.

source: Please choose a name for the new partition; like "data". Use only lower case letters and do not choose a reserved directory name in Linux or in other OS from which this partition will be accessed.
it_it: Sei pregato di scegliere un nome per la nuova partizione, come "dati". Usa solo lettere minuscole e non scegliere un nome della cartella riservato su Linux o in altri OS da cui sarà accessibile questa partizione.

source: Type the name of the new partition, or h for help:
it_it: Digita il nome della nuova partizione, o h per l'aiuto:

source: Type the mount point for $NAME, or h for help:
it_it: Digita il punto di montaggio per $NAME, o h per aiuto:

source: $MOUNTPOINT is a reserved directory name.
it_it: $MOUNTPOINT è un nome della cartella riservato.

source: This mount point is already in use.
it_it: Questo punto di montaggio è già in uso.

source: in "auto" mode a partition for /home should be located in another drive.
it_it: In modalità "automatica" una partizione per /home dovrebbe essere individuata in un'altra unità.

source: You will be allowed to select one later, already used or just created.
it_it: Potrai selezionarne un'altra in seguito, che sia già utilizzata o appena creata.

source: If it already contains data you will choose to keep or erase them.
it_it: Se contiene già i dati, sceglierai se mantenerli o cancellarli.

source: Do you want to format this partition? If yes we will erase everything in it so all data it contains will be lost!
it_it: Desideri formattare questa partizione? Se sì, cancelleremo tutto al suo interno, quindi, tutti i dati che contiene saranno persi!

source: Do you want to delete all data on $NAME et re-format it?
it_it: Desideri eliminare tutti i dati su $NAME e riformattarla?

source: Type yes or no:
it_it: Digità yes o no:

source: Allowed file system types for linux partitions are:
it_it: I tipi di file di sistema consentiti per le partizioni di Linux sono:

source: Type the file system type for $NAME or h for help:
it_it: Digita il tipo di file di sistema per $NAME o h per aiuto:

source: No installation media found. Please restart leaving it inserted or plugged in.
it_it: Nessun supporto d'installazione trovato. Sei pregato di riavviare lasciandolo inserito o collegato.

source: But if the installation ISO is in some disk partition, mount this partition like this: mount <partition /dev/something/> /floppy then type: mount <path to the ISO> /ISO then type start again.
it_it: Ma se l'ISO d'installazione è in qualche partizione del disco, monta questa partizione come segue: mount <partition /dev/something/> /floppy quindi digita: mount <path to the ISO> /ISO quindi, digita start un'altra volta.

source: We could not mount the installer for this reason: $MOUNTSRCERROR
it_it: Non siamo riusciti a montare l'installatore per questo motivo: $MOUNTSRCERROR

source: The Slint installer proposes installation options and let you choose what you prefer, through question/answer dialogues, then it installs and configure Slint. After installation you may customize the system through simple commands listed in the included documentation.
it_it: L'installatore di Slint propone le opzioni d'installazione e ti consente di scegliere ciò che preferisci, tramite finestre a domanda/risposta, poi installa e configura Slint. Dopo l'installazione potresti personalizzare il sistema tramite semplici comandi, elencati nella documentazione inclusa.

source: You can chose between a manual or auto partitioning.
it_it: Puoi scegliere tra una partizione manuale o automatica.

source: If you prefer manual (custom) partitioning but did not do the partitioning yet, press q to quit now. You will type 'start' again when ready.
it_it: Se preferisci la partizione manuale (personalizzata), ma non hai ancora effettuato la partizione, premi q per uscire ora. Digiterai nuovamente 'start' quando sarai pronto.

source: Press m for manual, a for auto, h for help or q to quit:
it_it: Premi m per manuale, a per automatico, h per aiuto o q per uscire:

source: Type 'start' again when you will be ready.
it_it: Digita di nuovo 'start' quando sarai pronto.

source: $ANSWER is not a valid answer.
it_it: $ANSWER non è una risposta valida.

source: Slint can be installed on this drive:
it_it: Slint è installabile su quest'unità:

source: To install Slint on this drive we need to wipe all data in it
it_it: Per installare Slint su quest'unità, necessitiamo di eliminare tutti i dati al suo interno

source: Slint can be installed on one of the drives listed below.
it_it: Slint è installabile su una delle unità elencate di seguito.

source: Please type the chosen drive's number, or q to quit:
it_it: Sei pregato di digitare il numero dell'unità, o q per uscire:

source: Slint would be installed on this drive:
it_it: Slint sarebbe installato su quest'unità:

source: To dedicate $NAME, size ${SIZEG}G to Slint we need to delete all data stored on this drive, including existing OS case occurring. Here are its current partitions:
it_it: Per dedicare $NAME, dimensione ${SIZEG}G a Slint, dobbiamo eliminare tutti i dati memorizzati su quest'unità, incluso il caso dell'OS esistente che si sta verificando. Eccone le partizioni correnti:

source: Do you want to delete all data on $NAME then install Slint on it?
it_it: Desideri eliminare tutti i dati su $NAME, quindi installarvi Slint?

source: Do you want to install Slint on it?
it_it: Desideri installarvi Slint?

source: You can dedicate all the available space: ${GAVAILABLE}G to Slint's root partition, or keep part of it for another usage. The size of the Slint root partition should be between ${GCOUNT}G and ${GAVAILABLE}G.
it_it: Puoi dedicare tutto lo spazio disponibile: ${GAVAILABLE}G alla partizione di root di Slint, o mantenerne una parte per un altro uso. Le dimensioni della partizione di root di Slint dovrebbero essere tra ${GCOUNT}G e ${GAVAILABLE}G.

source: Size of the Slint root partition (h for help):
it_it: Dimensioni della partizione di root di Slint (h per l'aiuto):

source: $GROOTSIZE is not a number.
it_it: $GROOTSIZE non è un numero.

source: $GROOTSIZE is not a number between $GCOUNT and $GAVAILABLE.
it_it: $GROOTSIZE non è un numero compreso tra $GCOUNT e $GAVAILABLE.

source: There remains ${GREMAINING}G of free space in $DRIVEPATH. You may allocate all or part of it to an additional partition. If you want an additional partition type its size below (at most ${GREMAINING}G), else just press Enter.
it_it: Rimangono ${GREMAINING}G di spazio libero in $DRIVEPATH. Potresti allocarli tutti o una parte a una partizione aggiuntiva. Se desideri una partizione aggiuntiva, digitane le dimensioni di seguito (al massimo ${GREMAINING}G), altrimenti, premi semplicemente Invio.

source: Size of the added partition (h for help):
it_it: Dimensioni della partizione aggiunta (h per l'aiuto):

source: The size should be at most ${GREMAINING}G.
it_it: Le dimensioni dovrebbero essere al massimo ${GREMAINING}G.

source: You have chosen the "manual" partitioning mode.
it_it: Hai scelto la modalità di partizione "manuale".

source: We need to identify the root Slint partition, to be mounted as "/". We will later format this partition, which will erase its content.
it_it: Necessitiamo di identificare la partizione di root di Slint, da montare come "/". In seguito, formatteremo questa partizione, eliminandone i contenuti.

source: We have found only one Linux partition big enough to install Slint: ${ROOTNAME}, size ${GSIZE}G.
it_it: Abbiamo trovato solo una partizione di Linux abbastanza grande da installare Slint: ${ROOTNAME}, dimensioni ${GSIZE}G.

source: Do you want to install Slint on $ROOTNAME?
it_it: Desideri installare Slint su $ROOTNAME?

source: Please type yes to confirm or no to quit:
it_it: Sei pregato di digitare sì per confermare o no per uscire:

source: You can select the root partition among these:
it_it: Puoi selezionare la partizione di root tra le seguenti:

source: Please type the root partitions's number, or q to quit:
it_it: Sei pregato di digitare il numero delle partizioni di root o q per uscire:

source: $ANSWER is not a listed partition number.
it_it: $ANSWER non è un numero di partizione elencato.

source: You can associate a mount point to each partition listed below. You will first select a partition typing its number, then its mount point. Type d when done, l to display the list again, or q to quit.
it_it: Puoi associare un punto di montaggio per ogni partizione elencata di seguito. Prima, selezionerai una partizione digitandone il numero, poi il suo punto di montaggio. Digita d quando hai fatto, l per mostrare nuovamente l'elenco o q per uscire.

source: Partition number? (or l to display the list, d when done, q to quit):
it_it: Numero di partizione? (o l per mostrare l'elenco, d quando hai fatto, q per uscire):

source: We will now list the partitions found on this machine with one of the file systems exfat, ntfs, vfat, used by Windows. You will now type the numbers of those you want to be automatically mounted at boot time, either read-only or read-write.
it_it: Ora, elencheremo le partizioni trovate su questa macchina con uno dei file di sistema exfat, ntfs, vfat, usati da Windows. Ora, digiterai i numeri di quelle che desideri siano montate automaticamente all'avvio, di sola lettura o di lettura e scrittura.

source: Partition number? (l to display the list, d when done, h for help):
it_it: Numero di partizione? (I per mostrare l'elenco, d quando hai fatto, h per l'aiuto):

source: $ANSWER is not a listed partition number
it_it: $ANSWER non è un numero di partizione elencato

source: The root Slint partition can be encrypted to prevent data steal in case of loss or theft of the machine or the drive where Slint is installed. Then you will type a so-called "passphrase" to unlock the Slint partition, giving access to the boot menu. We will record this passphrase
it_it: La partizione di root di Slint è crittografabile per impedire il furto di dati in caso di perdita o furto della macchina o dell'unità su cui è installato Slint. Poi digiterai una cosiddetta "parola d'ordine" per sbloccare la partizione di Slint, dando accesso al menu d'avvio. Registreremo questa parola d'ordine

source: using a "us" keyboard map
it_it: usando una tastiera "us"

source: Do you want to encrypt $NAME? type yes, no or h for help.
it_it: Desideri crittografare $NAME? Digita yes, no o h per l'aiuto.

source: We are ready to do what you requested: Install Slint on this drive: $NAME $VEND $MOD size ${SIZEG}G
it_it: Siamo pronti a fare ciò che hai richiesto: Installa Slint su quest'unità: $NAME $VEND $MOD dimensione ${SIZEG}G

source: All data previously stored on it will be deleted.
it_it: Tutti i dati precedentemente memorizzati al suo interno saranno eliminati.

source: We are ready to do what you requested: Install Slint on this partition: $NAME, size ${SIZEG}G, file system $FSTYPE All data previously stored on it will be deleted but the contents of other partitions on $PKNAME will be preserved.
it_it: Siamo pronti a fare ciò che hai richiesto: Installa Slint su questa partizione: $NAME, dimensioni ${SIZEG}G, file di sistema $FSTYPE Tutti i dati memorizzati in precedenza saranno eliminati, ma i contenuti delle altre partizioni su $PKNAME saranno conservati.

source: The root partition will be encrypted.
it_it: La partizione di root sarà crittografata.

source: The Slint system partition will have a size of ${ROOTSIZE}G.
it_it: La partizione di sistema di Slint avrà una dimensione di ${ROOTSIZE}G.

source: A "$ADDEDPARTNAME" partition of size ${ADDEDPARTSIZE}G will be set up.
it_it: Una partizione "$ADDEDPARTNAME" di dimensioni ${ADDEDPARTSIZE}G sarà configurata.

source: A space of size ${GAVAILABLE}G will stay free after the last partition.
it_it: Uno spazio di dimensioni ${GAVAILABLE}G rimarrà libero dopo l'ultima partizione.

source: Partitions listed below will be accessible:
it_it: Saranno accessibili le seguenti partizioni:

source: If you confirm these settings they will be applied, else you will go back to the greeting screen of the installer.
it_it: Se confermi queste impostazioni, saranno applicate, altrimenti, tornerai alla schermata dai saluto dell'installatore.

source: To confirm these settings type yes, else type no:
it_it: Per confermare queste impostazioni digita yes, altrimenti digita no:

source: You can redo a configuration.
it_it: Puoi ripetere una configurazione.

source: We prepare $DRIVEPATH to install Slint...
it_it: Prepariamo $DRIVEPATH per installare Slint...

source: We will now record the passphrase to use to unlock the drive $DRIVEPATH
it_it: Ora, registreremo la frase segreta da usare per sbloccare l'unità $DRIVEPATH

source: It should include at least one capital letter, one lower case letter, one digit and one punctuation sign and have at least 8 characters. Write it in a safe place first!
it_it: Dovrebbe includere almeno una maiuscola, una minuscola, una cifra e un segno di punteggiatura e avere almeno 8 caratteri. Prima, scrivili in un posto sicuro!

source: You are currently using a "$KEYMAP" keyboard map, but when you will type the passphrase to unlock the drive a "us" keyboard map will be set up. For this reason we will now display the typed characters using an "us" keyboard map.
it_it: Stai correntemente usando una tastiera "$KEYMAP", ma quando digiterai la parola d'ordine per sbloccare l'unità, sarà configurata una tastiera "us". Per questo motivo, mostreremo ora i caratteri digitati usando una tastiera "us".

source: Passphrase (h for help):
it_it: Parola d'ordine (h per l'aiuto):
