Repository: DidierSpaier/slint-translations
Catalog: po/auto/*.auto.po
Languages: it_it

source: The passphrase may only contain ASCII characters
it_it: La frase segreta potrebbe contenere solo caratteri ASCII

source: The passphrase should have at least 8 characters.
it_it: La frase segreta dovrebbe contenere almeno 8 caratteri.

source: The passphrase should include at least one lower case letter.
it_it: La frase segreta dovrebbe includere almeno una lettera minuscola.

source: The passphrase should include at least one capital letter.
it_it: La frase segreta dovrebbe includere almeno una maiuscola.

source: The passphrase should include at least one digit.
it_it: La frase segreta dovrebbe includere almeno una cifra.

source: The passphrase should include at least one punctuation character.
it_it: La frase segreta dovrebbe includere almeno un segno di punteggiatura.

source: Please type again the passphrase, to check:
it_it: Sei pregato di digitare nuovamente la parola d'ordine, per verificare:

source: Passphrases do not match. please try again.
it_it: Le frasi segrete non corrispondono. Sei pregato di riprovare.

source: Encrypting the root Slint partition...
it_it: Crittografando la partizione di root di Slint...

source: Installing the first software packages...
it_it: Installando i primi pacchetti del software...

source: Generating a decryption keyfile...
it_it: Generando un file della chiave di decrittografia...

source: The user "root" has all rights on the system, including to wipe it. This status should be accessed only with a good password.
it_it: L'utente "root" ha tutti i diritti sul sistema, inclusi per svuotarlo. Questo stato dovrebbe esser accessibile solo con una buona password.

source: Please type the password for $THISUSER:
it_it: Sei pregato di digitare la password per $THISUSER:

source: The password should have at least 6 characters.
it_it: La password dovrebbe contenere almeno 6 carattere.

source: Please type again the password for $THISUSER, to check:
it_it: Sei pregato di digitare nuovamente la password per $THISUSER, per verificare:

source: Passwords do not match. please try again.
it_it: Le password non corrispondono. Sei pregato di riprovare.

source: We will now set up an account for a regular user. Other user accounts can be set up after installation. We need to know under which name this user will log in to access Slint.
it_it: Ora, configureremo un profilo per un utente regolare. I profili degli altri utenti sono configurabili dopo l'installazione. Necessitiamo di sapere con quale nome questo utente accederà a Slint.

source: Login name of the first registered user:
it_it: Nome d'accesso del primo utente registrato:

source: The username should not begin with a '_'
it_it: Il nome utente dovrebbe iniziare per '_'

source: The user name should only contains non accented lower case letters, digits from 0 to 9, '_' or '-'
it_it: Il nome utente dovrebbe contenere solo lettere minuscole non accentate, cifre da 0 a 9, '_' o '-'

source: Blind users can run Slint with a Braille device or a screen reader.
it_it: Gli utenti ipovedenti possono eseguire Slint con un dispositivo Braille o un lettore dello schermo.

source: Will you use a Braille device? Please answer yes or no:
it_it: Userai un dispositivo Braille? Sei pregato di rispondere yes o no:

source: Do you want to start Slint in a console or in graphical mode?
it_it: Desideri avviare Slint in una console o in modalità grafica?

source: Type c for console or g for graphical, or h for help then press Enter:
it_it: Digita c per la console o g per il terminale grafico o h per ricevere aiuto, poi premi Invio:

source: In the next dialog, you will choose the language for your Slint System.
it_it: Nella prossima finestra, selezionerai la lingua per il tuo Sistema di Slint.

source: Press Enter to continue:
it_it: Premi Invio per continuare:

source: Please wait...
it_it: Sei pregato d'attendere...

source: An internet connection would allow to get software packages newer than those shipped with the installer, but we couldn't get a wired connection.
it_it: Non siamo riusciti a rilevare una connessione via cavo. Una connessione a Internet consentirebbe di ottenere pacchetti del software più recenti di quelli forniti con l'installatore.

source: Should we try to get a wifi connection? Please type yes or no:
it_it: Dovremmo provare a ottenere una connessione WiFi? Sei pregato di digitare yes o no:

source: Scanning the wifi networks...
it_it: Scansionando le reti Wi-Fi...

source: No wifi network detected.
it_it: Nessuna rete WiFi rilevata.

source: SSID (network name) or l to get a list:
it_it: SSID (nome di rete) o l per ottenere un elenco:

source: Wrong SSID.
it_it: SSID errato.

source: Press Enter to try again or type q to give up:
it_it: Premi Invio per riprovare o digita q per uscire:

source: Passphrase:
it_it: Parola d'ordine:

source: A WPA passphrase should have between 8 and 63 characters
it_it: Una frase segreta WPA dovrebbe contenere tra 8 e 63 caratteri

source: Wrong passphrase. Press Enter to try again or type q to quit:
it_it: Parola d'ordine errata. Premi Invio per riprovare o digita q per uscire:

source: Wifi connection failed. Wrong passphrase?
it_it: Connessione alla Wi-Fi fallita. Frase segreta errata?

source: Press Enter to try again or type q to quit:
it_it: Premi Invio per riprovare o digita q per uscire:

source: Are credentials requested to use $SSID? Type yes or no:
it_it: Le credenziali richieste sono per usare $SSID? Digita yes o no:

source: Wifi connection failed.
it_it: Connessione alla Wi-Fi fallita.

source: You will now type the credentials in a web browser.
it_it: Ora, digiterai le credenziali su un browser web.

source: When done press Q to quit the browser.
it_it: Quando hai fatto, premi Q per uscire dal browser.

source: Press Enter to start the browser or type h for help on its usage:
it_it: Premi Invio per avviare il browser o digita h per l'aiuto sul suo uso:

source: Please type the password for $SSID, or q to give up using wifi:
it_it: Sei pregato di digitare la password per $SSID, o q per rinunciare all'uso della WiFi:

source: A password is requested.
it_it: È necessaria una password.

source: Wrong password. Try again.
it_it: Password errata. Riprova.

source: Setting of the time zone.
it_it: Impostazione del fuso orario.

source: Is $PROPOSEDTZ the current time zone? type yes or no:
it_it: $PROPOSEDTZ è il fuso orario corrente? Digita yes o no:

source: You can set the time zone now, or accept the default value (UTC) and modify this setting after installation.
it_it: Ora, puoi impostare il fuso orario, o accettare il valore predefinito (UTC) e modificare quest'impostazione dopo l'installazione.

source: To set the time zone now type yes, else type no:
it_it: Per impostare il fuso orario ora digita yes, altrimenti digita no:

source: We will now install all packages. This takes about 10 to 40 minutes.
it_it: Ora, installeremo tutti i pacchetti. Ciò richiede circa da 10 a 40 minuti.

source: Do you want a short description of each package during its installation?
it_it: Desideri una breve descrizione di ogni pacchetto durante l'installazione?

source: Please type yes or no:
it_it: Sei pregato di digitare yes o no:

source: Installing the packages. Please be patient.
it_it: Installando i pacchetti. Sei pregato di esser paziente.

source: Preparing packages installation...
it_it: Preparazione dell'installazione dei pacchetti...

source: Installation of $PKG failed for this reason:
it_it: L'installazione di $PKG è fallita per il seguente motivo:

source: Slint installation can't continue
it_it: L'installazioned di Slint non può continuare

source: Therefore, Slint installation is not possible.
it_it: Dunque, l'installazione di Slint non è possibile.

source: Check the integrity of the installation media.
it_it: Verifica l'integrità del supporto d'installazione.

source: Please type the machine name or "hostname" and press Enter or just press Enter to accept the default name "slint".
it_it: Sei pregato di digitare il nome della macchina od "hostname" e di premere Invio, o semplicemente di premere Invio per accettare il nome predefinito "slint".

source: Machine name[slint]:
it_it: Nome della macchina[slint]:

source: Please select a default desktop among those listed below. mate is the most accessible with a screen reader.
it_it: Sei pregato di selezionare un desktop predefinito tra quelli elencati di seguito. mate è il più accessibile con un lettore dello schermo.

source: i3 is also accessible. If you need speech, preferably type i38 before starting it.
it_it: Anche i3 è accessibile. Se necessiti della sintesi vocale, è preferibile digitare i38 prima di avviare.

source: Your choice:
it_it: La tua scelta:

source: $session is not an available desktops.
it_it: $session non è un desktop disponibile.

source: $session has been chosen.
it_it: $session selezionata.

source: building an initramfs...
it_it: Creando un initramfs...

source: Installing the GRUB bootloader...
it_it: Installando il bootloader di GRUB...

source: Building the GRUB boot menu...
it_it: Creando il menu d'avvio di GRUB...

source: Installation and initial configuration of Slint are complete. If you want a preview of the boot menu displayed after rebooting, type now: chroot /SLINT list_boot_entries To exit press q (not Alt+F4 in this context) then y. To quit the installer and start your new Slint remove the installation media then type 'reboot' or press Ctrl+Alt+Del.
it_it: L'installazione e la configurazione iniziale di Slint sono complete. Se desideri un'anteprima del menu d'avvio mostrata dopo il riavvio, digita ora: chroot /SLINT list_boot_entries Per uscire, premi q (non Alt+F4 in questo contesto), poi y. Per uscire dall'installatore e avviare il tuo nuovo Slint, rimuovi il supporto d'installazione, poi digita 'reboot' o premi Ctrl+Alt+Canc.
