Repository: DidierSpaier/slint-translations
Catalog: po/wiki/a002/*.a002.po
Languages: de_de

source: Customize a Slint system layout
de_de: Das Layout eines Slint Systems anpassen

source: Introduction
de_de: Einführung

source: In this article, we review how the Slint installer organizes the system's basic directories (their layout), and show how to customize this layout after installation. The installation process is detailed in Chapter 2: Installation of the HandBook.
de_de: In diesem Artikel zeigen wir, wie der Slint-Installer die grundlegenden Verzeichnisse des Systems (deren Layout) organisiert und wie man dieses Layout nach der Installation anpassen kann. Der Installationsprozess wird im Kapitel 2: Installation des Handbuchs detailliert beschrieben.

source: The installer places all the directories listed below, which constitute the core of the system, in the same partition:
de_de: Der Installer platziert alle unten aufgelisteten Verzeichnisse, die den Kern des Systems ausmachen, in derselben Partition:

source: If other partitions already formatted are accessible during the installation, the installer proposes that they be mounted at system startup, with a directory name chosen by the user as mount point, except those listed above.
de_de: Wenn andere bereits formatierte Partitionen während der Installation verfügbar sind, schlägt der Installer vor, dass sie beim Systemstart gemountet werden, mit einem Verzeichnisnamen, der vom Benutzer als Mount-Punkt zugewiesen wurde, außer denen, die oben aufgelistet sind.

source: Furthermore, if automatic partitioning has been chosen, the installer proposes to create an additional partition in the remaining space available on the device, with a mount point chosen by the user, also outside those listed above.
de_de: Wenn außerdem die automatische Partitionierung ausgewählt wurde, schlägt der Installer vor, eine zusätzliche Partition auf dem verbleibenden Platz auf dem Gerät zu erstellen, mit einem vom Benutzer gewählten Mount-Punkt, auch außerhalb der oben aufgelisteten Mount-Punkte.

source: In sum, the installer:
de_de: Kurz gesagt, der Installer:

source: places all directories constituting the core of the system in the same partition,
de_de: platziert alle Verzeichnisse, die den Kern des Systems bilden, in derselben Partition,

source: allows to set up other directories in other partitions, previously formatted.
de_de: erlaubt das Einrichten anderer Verzeichnisse in anderen Partitionen, die zuvor formatiert wurden.

source: However, you may want to install files or directories that are part of the core of the system such as /home in another partition, especially if space is limited on the device. For example, if the computer is equipped with a fast device (SSD or NVMe) and also with a slower but larger capacity hard disk, you might want to install the system on the SSD or NVMe and the larger files on the hard disk.
de_de: Allerdings möchten Sie möglicherweise Dateien oder Verzeichnisse installieren, die Teil des Kerns des Systems sind, wie /home in einer anderen Partition, insbesondere, wenn der Speicherplatz auf dem Gerät begrenzt ist. Zum Beispiel, wenn der Computer mit einem schnellen Gerät (SSD oder NVMe) und auch mit einer langsameren, aber größeren Festplatte ausgestattet ist, können Sie das System auf der SSD oder NVMe und die größeren Dateien auf der Festplatte installieren.

source: You may also want to share large files usually stored in /home with another system, such as images, various documents, audio or video files.
de_de: Möglicherweise möchten Sie auch große Dateien, die normalerweise in /home gespeichert werden, mit einem anderen System teilen, wie z.B. Bilder, verschiedene Dokumente, Audio- oder Videodateien.

source: Practical guide
de_de: Praktische Anleitung

source: As an example we show how to move /home to another device, with some variations.
de_de: Als Beispiel zeigen wir, wie /home auf ein anderes Gerät verlagert wird, mit einigen Variationen.

source: Move /home entirely to another device
de_de: /home vollständig auf ein anderes Gerät verlagern

source: We assume that you want to move the /home directory, initially installed on an SSD or NVMe, to a hard disk. This can be done right after installation or later. All the following is to be done as root.
de_de: Wir gehen davon aus, dass Sie das Verzeichnis /home, das ursprünglich auf einer SSD oder NVMe installiert wurde, auf eine Festplatte verschieben wollen. Dies kann direkt nach der Installation oder später erledigt werden.

source: First, you need a formatted partition on the hard disk, named /dev/sdb1 below, to host /home:
de_de: Zuerst benötigen Sie eine formatierte Partition auf der Festplatte, namens /dev/sdb1, auf der /home bereitgestellt wird:

source: Create if not already done on the hard disk the partition table (GPT type) and the partition using one of theses tools: parted, gdisk, cgdisk or gparted, all included in Slint, big enough for its intended use.
de_de: Erstellen Sie die Partitionstabelle (vom Typ GPT) und die Partition mit einem der folgenden Werkzeuge: parted, gdisk, cgdisk oder gparted, alle in Slint, groß genug für den beabsichtigten Gebrauch.

source: Format this partition using one of the btrfs, ext4, or xfs file types (commands `mkfs.btrfs`, `mkfs.ext4` or `mkfs.xfs`)
de_de: Formatieren Sie diese Partition mit einem der Dateitypen btrfs, ext4 oder xfs (Befehle `mkfs.btrfs`, `mkfs.ext4` oder `mkfs.xfs`)

source: To be able to copy the /home directory to this partition you need to mount it, for example on /mnt, with one of the following commands:
de_de: Um das Verzeichnis /home auf diese Partition kopieren zu können, müssen Sie es mounten zum Beispiel auf /mnt, mit einem der folgenden Befehle:

source: mount /dev/sdb1 /mnt -o compress=zstd:3 # if /dev/sdb1 has been formatted with btrfs mount /dev/sdb1 /mnt # if /dev/sdb1 was formatted with xfs or ext4
de_de: mount /dev/sdb1 /mnt -o compress=zstd:3 # falls /dev/sdb1 mit btrfs formatiert wurde mount /dev/sdb1 /mnt # falls /dev/sdb1 mit xfs oder ext4 formatiert wurde

source: Then copy the files, for example like this:
de_de: Kopieren Sie dann die Dateien, zum Beispiel wie folgt:

source: or like this:
de_de: oder auch so:

source: Then, check that the copy has been done correctly:
de_de: Danach überprüfen Sie, ob die Kopie korrekt ausgeführt wurde:

source: Then modify the /etc/fstab file to mount /home on the new partition at the next boot.
de_de: Ändern Sie dann die /etc/fstab Datei, um /home auf der neuen Partition beim nächsten Booten zu mounten.

source: If the root file system is btrfs, /home is mounted as subvolume. In this case comment out the line in the file used to mount /home by inserting a # character at its beginning. For example edit this line (replace <uuid1> with the UUID value specified in /etc/fstab):
de_de: Wenn das Root-Dateisystem btrfs ist, wird /home als Untervolumen eingebunden. In diesem Fall kommentieren Sie die Zeile in der Datei /etc/fstab aus, die verwendet wird, um /home einzubinden, indem Sie am Anfang ein # Zeichen einfügen. Zum Beispiel diese Zeile bearbeiten (ersetzen Sie <uuid1> mit der UUID in /etc/fstab):

source: UUID=<uuid1> /home btrfs subvol=/@home,discard=async,compress=zstd:3,noatime 0 0
de_de: UUID=<uuid1> /home btrfs subvol=/@home,discard=async,compress=zstd:3,noatime 0

source: which becomes:
de_de: die geändert wird in:

source: Then insert in the file a line to mount at boot time /home on the new partition. We will designate <uuid2> the value of its UUID, displayed by this command:
de_de: Dann fügen Sie in die Datei eine Zeile ein, mit der Sie zur Bootzeit /home auf der neuen Partition einhängen. Wir nennen den Wert ihrer UUID <uuid2>, die durch diesen Befehl angezeigt wird:

source: The line to insert in the /etc/fstab file depends on the chosen file system of /dev/sdb1.
de_de: Die Zeile, die in die /etc/fstab Datei eingefügt werden soll, hängt vom gewählten Dateisystem auf /dev/sdb1 ab.

source: For btrfs:
de_de: Für btrfs:

source: UUID=<uuid2> /home btrfs compress=zstd:3,discard=async,noatime 0
de_de: UUID=<uuid2> /home btrfs compress=zstd:3,discard=async,noatime 0 0

source: For ext4 or xfs:
de_de: Für ext4 oder xfs:

source: Then, reboot the machine. In case of problem, to go back:
de_de: Dann starten Sie den Rechner neu. Im Falle eines Problems gehen Sie zurück:

source: Case occurring uncomment the commented line in /etc/fstab (remove the # character at the beginning of the line)
de_de: Gegebenenfalls entfernen Sie das Kommentarzeichen aus der Zeile in der /etc/fstab (entfernen Sie das # Zeichen am Anfang der Zeile)

source: Comment the new one (insert a # character at the beginning of the line)
de_de: Kommentieren Sie die neue Zeile aus (fügen Sie ein # Zeichen am Zeilenanfang ein)

source: Then reboot.
de_de: Dann starten Sie das System neu.

source: Once the new partition has been checked for correct operation, the old one can be deleted. The way to do this depends on the file system configured by the installer. Once the machine is rebooted, make sure that /home is mounted on the new partition, for example with the command
de_de: Sobald die neue Partition auf korrekte Funktion überprüft wurde, kann die alte gelöscht werden. Die Art und Weise dies zu tun, hängt von dem vom Installer konfigurierten Dateisystem ab. Sobald der Rechner neu gestartet wurde, stellen Sie sicher, dass /home auf der neuen Partition gemountet ist, zum Beispiel mit dem Befehl:

source: Then delete the old /home:
de_de: Dann löschen Sie das alte /home:

source: In case of btrfs type these commands (we assume that the system was installed in /dev/sda3):
de_de: Im Falle von btrfs geben Sie diese Befehle ein (wir gehen davon aus, dass das System in /dev/sda3 installiert wurde):

source: umount /mnt mount /dev/sda3 /mnt -o subvolid=0 btrfs subvolume delete -c /mnt/@home btrfs subvolume sync /mnt # this command initiates the recovery of the space occupied by the old /home btrfs filesystem sync # this command ends the recovery of the space occupied by the old /home umount /mnt
de_de: umount /mnt mount /dev/sda3 /mnt -o subvolid=0 btrfs subvolume delete -c /mnt/@home btrfs subvolume sync /mnt # dieser Befehl initiiert die Wiederherstellung des Speichers des alten /home btrfs filesystem sync # dieser Befehl beendet die Wiederherstellung des Speichers des alten /home umount /mnt

source: In case of ext4 or xfs, we need that the new /home be not in use to remove the old one. So:
de_de: Im Falle von ext4 oder xfs müssen wir das neue /home nicht verwenden, um das alte zu entfernen. Also:

source: First, reboot in text mode. Login as root # Not as regular user, else we could not umount /home as it would be busy. umount /home # This makes the previous /home accessible again. rm -r /home/* # We delete the content of the previous /home but keep the directory. mount /home # Now /dev/sdb1 is mounted as /home
de_de: Zuerst im Text-Modus neustarten. Anmelden als root # Nicht als normaler Benutzer, sonst können wir /home nicht umkehren, da es benutzt werden würde. umount /home # Dies macht das vorherige /home wieder zugänglich. rm -r /home/* # Wir löschen den Inhalt des vorherigen /home, aber behalten das Verzeichnis. mount /home # Jetzt wird /dev/sdb1 als /home eingebunden

source: Move only the largest files from /home to the hard disk
de_de: Das Verschieben nur der größten Dateien von /home auf die Festplatte

source: In the example above the /home directory has been completely transferred from the SSD to the hard disk.
de_de: Im obigen Beispiel wurde das Verzeichnis /home vollständig von der SSD auf die Festplatte übertragen.

source: It may be preferable to store only large files on the hard disk and to leave hidden directories and files on the SSD, which are subject to frequent writes, much faster on an SSD.
de_de: Möglicherweise ist es besser, nur große Dateien auf der Festplatte zu speichern und versteckte Verzeichnisse und Dateien, die häufig geschrieben, werden auf der SSD zu belassen, weil die SSD viel schneller ist.

source: To do this, you can name the mount point of the /dev/sdb1 partition `/data` in /etc/fstab, for example, then once this partition is mounted, copy the directories to be transferred from /home to /data, and finally replace these directories in /home with symbolic links to the directories in /data. For instance, once the /data directory is created and mounted on /dev/sdb1:
de_de: Um dies zu tun, können Sie zum Beispiel den Mount-Punkt der /dev/sdb1-Partition `/data` in /etc/fstab benennen. Sobald diese Partition gemountet ist, kopieren Sie die Verzeichnisse, die von /home nach /data übertragen werden sollen, und ersetzen Sie diese Verzeichnisse schließlich in /home mit symbolischen Links zu den Verzeichnissen in /data. Zum Beispiel, sobald das /data Verzeichnis erstellt und auf /dev/sdb1 gemountet wurde:

source: This way of doing is to be adapted if the system is multi-user, for example by creating a subdirectory per user in /data.
de_de: Diese Vorgehensweise muss angepasst werden, wenn das System mehrere Benutzer hat, zum Beispiel durch das Erstellen eines Unterverzeichnisses pro Benutzer in /data.

source: Move /home to the hard disk but store frequently changed files on the SSD
de_de: Verschieben von /home auf die Festplatte, aber häufig geänderte Dateien auf der SSD speichern

source: On the other hand it is possible to selectively store frequently changed files on the SSD, like those contained in ~/.mozilla, ~/.thunderbird or ~/.purple.
de_de: Andererseits ist es möglich, häufig veränderte Dateien auf der SSD selektiv zu speichern, wie etwa die in ~/.mozilla, ~/.thunderbird oder ~/.purple.

source: For example, you can create a directory /data and a subdirectory /data/.thunderbird on the SSD, move ~/.thunderbird to it, and create a symbolic link /data/.thunderbird => ~/.thunderbird.
de_de: Sie können zum Beispiel ein Verzeichnis /data und ein Unterverzeichnis /data/.thunderbird auf der SSD erstellen, ~/. hunderbird darauf verschieben und einen symbolischen Link /data/.thunderbird => ~/.thunderbird erstellen.

source: If btrfs is used for the core system it is recommended to create a subvolume for /data with the following commands, before moving ~/.mozilla or ~/.thunderbird there, like this:
de_de: Wenn btrfs für das Kernsystem verwendet wird, wird empfohlen, vor dem Verschieben von ~/ ein Untervolumen für /data mit den folgenden Befehlen zu erstellen, bevor ~/.mozilla oder ~/.thunderbird erstellt wird:

source: Then insert a line in /etc/fstab to mount /data at system boot (<uuid1> is the UUID value of /dev/sda3):
de_de: Dann fügen Sie eine Zeile in /etc/fstab ein, um /data beim Systemstart einzubinden (<uuid1> ist der UUID-Wert von /dev/sda3):

source: Then reboot and type the following commands:
de_de: Starten Sie dann neu und geben die folgenden Befehle ein:
