Repository: DidierSpaier/slint-translations
Catalog: translations20220905/manual_installer/*.manual_installer.po
Languages: pt_pt

source: Choose a default window manager for X
pt_pt: Escolha um gestor de janelas padrão para o X

source: Set up ELILO (EFI LILO) to boot Linux from your hard drive
pt_pt: Configurar o ELILO (EFI LILO) para fazer o arranque do Linux a partir de seu disco rígido

source: Set up GRUB to boot Linux (and other OSes) from your hard drive
pt_pt: Configurar o GRUB para inicializar o Linux (e outros sistemas operativos) do disco rígido

source: Network support for NFS install, 2006-09-20 volkerdi@slackware.com Network support for FTP/HTTP install, 26-Jan-2008 alien@slackware.com
pt_pt: Suporte de rede para instalação NFS, 2006-09-20 volkerdi@slackware.com Suporte de rede para instalação FTP/HTTP, 26-Jan-2008 alien@slackware.com

source: The next step in your installation may be partitioning your hard drive (if you're installing to a Linux partition) with 'fdisk' or 'cfdisk' (the menu-driven version of fdisk). If you already have a partition prepared for Linux, run 'setup' to start the installer program.
pt_pt: O próximo passo na sua instalação pode ser particionar o seu disco rígido (se está a instalar numa partição Linux) com 'fdisk' ou 'cfdisk' (a versão com menus do fdisk). Se já tem uma partição preparada para Linux, execute 'setup' para iniciar o programa de instalação.

source: ******* Welcome to the network supplemental disk! *******
pt_pt: ******* Bem-vindo ao disco suplementar de rede! *******

source: -- Press [enter] to automatically probe for all network cards, or switch to a different console and use 'modprobe' to load the modules manually. -- To skip probing some modules (in case of hangs), enter them after an S: S eepro100 ne2k-pci -- To probe only certain modules, enter them after a P like this: P 3c503 3c505 3c507 -- To get a list of network modules, enter an L. -- To skip the automatic probe entirely, enter a Q now.
pt_pt: -- Prima [enter] para examinar automaticamente todas as placas de rede ou mude para outra consola e use o 'modprobe' para carregar os módulos manualmente. -- Para ignorar a sondagem de alguns módulos (em caso de demora), informe-os depois de um S: S eepro100 ne2k-pci -- Para examinar apenas alguns módulos, informe-os depois de um P assim: P 3x503 3c505 3c507 -- Para ter uma lista de todos os módulos de rede, escreva um L. -- Para ignorar a sondagem automática totalmente, escreva um Q agora.

source: network>
pt_pt: rede>

source: Available network modules:
pt_pt: Módulos de rede disponíveis:

source: Probing for PCI/EISA network cards:
pt_pt: Sondar por placas de rede PCI/EISA:

source: Probing for card using the $card module...
pt_pt: Sondar por placas que usam o módulo $card...

source: SUCCESS: found card using $card protocol -- modules loaded.
pt_pt: SUCESSO: placa encontrada a usar o protocolo $card -- módulos carregados.

source: Skipping module $card...
pt_pt: A ignorar o módulo $card...

source: Probing for MCA, ISA, and other PCI network cards:
pt_pt: Sondar por MCA, ISA e outras placas de rede PCI:

source: Sorry, but no network card was detected. Some cards (like non-PCI NE2000s) must be supplied with the I/O address to use. If you have an NE2000, you can switch to another console (Alt-F2), log in, and load it with a command like this: modprobe ne io=0x360
pt_pt: Desculpe, mas nenhuma placa de rede foi detetada. Algumas placas (como as NE2000 não-PCI) devem ser fornecidas com o endereço de I/O a ser utilizado. Se tem uma NE2000, pode mudar para outra consola (Alt-F2), iniciar sessão e carregá-la com um comando como este: modprobe ne io=0x360

source: Probing for a custom list of modules:
pt_pt: Sondar por uma lista de módulos personalizada:

source: Skipping automatic module probe.
pt_pt: A ignorar a sondagem de módulos automática.

source: PCMCIA/Cardbus support script, 2003-02-18 volkerdi@slackware.com 2007-05-09 alien@slackware.com
pt_pt: Script de suporte ao PCMCIA/Cardbus, 2003-02-18 volkerdi@slackware.com 2007-05-09 alien@slackware.com

source: The PCMCIA/Cardbus subsystem is now installed. Please make sure that all of the cards you'll need for the installation are in the machine. If you still need to insert any PCMCIA/Cardbus cards, do that now. Once the drive stops (indicating that all needed modules have been loaded), then press [enter] to continue.
pt_pt: O subsistema PCMCIA/Cardbus está instalado agora. Certifique-se de que todas as placas que vai precisar para a instalação estejam na máquina. Se ainda precisa inserir alguma placa PCMCIA/Cardbus, faça isso agora. Logo que a unidade parar (indicando que todos os módulos necessários foram carregados), prima [enter] para continuar.

source: Select source media
pt_pt: Selecionar o suporte de origem

source: We will now probe your sound cards. Please wait until you hear an alarm sound, then press Enter.
pt_pt: Vamos agora testar as placas de som. Aguarde até ouvir um alarme e prima Enter.

source: No working sound card found. Maybe the sound is muted?
pt_pt: Nenhuma placa de som a funcionar encontrada. Talvez o som esteja mudo?

source: This installer has speech and Braille device support in order to be accessible to visually impaired users. To have speech turned on during installation type S, then press [Enter]. Else, just press Enter.
pt_pt: Este instalador tem suporte para dispositivo de voz e Braille afim de ser acessível a utilizadores com incapacidade visual. Para ter a voz ativada durante a instalação, escreva S e prima [Enter]. caso contrário, basta premir Enter.

source: To display keyboard shortcuts for reviewing the screen with speech press R, then press [Enter], Else, just press [Enter]:
pt_pt: Para mostrar teclas de atalho afim de rever o ecrã com a voz prima R e depois, prima [Enter], Caso contrário, basta premir [Enter]:

source: Note: espeakup, used for speech, lacks a voice in Ukrainian.
pt_pt: Nota: espeakup, usado para falar, não tem voz em Ucraniano.

source: LANGUAGE TO USE DURING INSTALLATION
pt_pt: IDIOMA A USAR DURANTE A INSTALAÇÃO

source: Please select the language to use for installation.$NOTE
pt_pt: Selecione o idioma a ser usado na instalação.$NOTE

source: English (USA)
pt_pt: Inglês (EUA)

source: Dutch
pt_pt: Holandês

source: French
pt_pt: Francês

source: German
pt_pt: Alemão

source: Greek
pt_pt: Grego

source: Italian
pt_pt: Italiano

source: Norwegian
pt_pt: Norueguês

source: Polish
pt_pt: Polaco

source: Portuguese (Brazil)
pt_pt: Português (Brasil)

source: Portuguese (Portugal)
pt_pt: Português (Portugal)

source: Russian
pt_pt: Russo

source: Spanish (Latin America)
pt_pt: Espanhol (América Latina)

source: Swedish
pt_pt: Sueco

source: Turkish
pt_pt: Turco

source: Ukrainian
pt_pt: Ucraniano

source: <OPTION TO LOAD SUPPORT FOR ANOTHER KEYBOARD> If you are not using a "$kbd" keyboard map, you may load another one now. To select a different keyboard map, please enter 1 now. To continue using the "$kbd" keyboard map, just hit [Enter].
pt_pt: <OPÇÃO PARA CARREGAR SUPORTE A OUTRO TECLADO> Se não estiver a utilizar um mapa de teclado "$kbd", pode carregar outro agora. Para selecionar um mapa de teclado diferente, digite 1 agora. Para continuar a utilizar o mapa de teclado "$kbd", apenas prima [Enter].

source: Enter 1 to select a keyboard map:
pt_pt: Escreva 1 para selecionar um mapa de teclado:

source: To partition your device(s), you can use 'cfdisk' or 'fdisk' and also, only for a GPT layout, 'cgdisk' or 'gdisk'. 'parted' is also available. TIP: to enhance accessibility of cgdisk, use its -a option. If you partition a new device, we recommend that you set up a gpt (GUID partition label) for it, for more flexibility. You can also let the installer auto-partition a device, if and only if: 1. Its size is of least ${GCOUNT}G. 2. You agree that this device will be dedicated to Slint. 3. You agree that all data currently stored on it will be erased. 4. None of the partitions it could include is mounted. WARNING: if it has already been used, make a back-up first! After having used the auto-partitioning feature, you will be allowed to make changes, like adding another partition to the drive. For an auto-partitioning type now 'auto'. To start the main installation (after partitioning), type 'setup'.
pt_pt: Para particionar o dispositivo(s), pode usar o 'cfdisk' ou 'fdisk' e também, apenas para um esquema GPT, 'cgdisk' ou 'gdisk'. 'parted' também está disponível. DICA: para melhorar a acessibilidade do cgdisk, use sua opção -a. Se particionar um novo dispositivo, recomendamos que configure um gpt (GUID etiqueta de partição) para o mesmo, para mais flexibilidade. Também pode permitir que o instalador particione automaticamente um dispositivo, se e apenas se: 1. O seu tamanho é de pelo menos ${GCOUNT}G. 2. Aceita que este dispositivo será dedicado ao Slint. 3. Aceita que todos os dados atualmente armazenados serão apagados. 4. Nenhuma das partições que pode incluir é montada. ATENÇÃO: se já foi usado, faça um backup primeiro! Depois de ter usado o recurso de particionamento automático, poderá fazer alterações, como adicionar outra partição à unidade. Para um tipo de particionamento automático escreva agora 'auto'. Para iniciar a instalação principal (após o particionamento), escreva 'setup'.

source: Welcome to the Slint Linux installation media! (version ${Version}) ###### IMPORTANT! READ THE INFORMATION BELOW CAREFULLY. ###### On the device where Slint will be installed you will need: - at least one partition of type 'Linux', of size at least ${GCOUNTMIN}G, for the system itself (not counting the user files). - if the device has a GPT layout, a small (4M) partition of type ef02 (BIOS Boot partition) to install GRUB on this drive in Legacy mode. - an EFI System partition, of type ef01, to install GRUB in EFI mode, of size at least 100M, unless you want to use an existing one. It is recommended that you have a swap partition (type 'Linux swap') prior installation, but you can also set up a swap file afterwards. On the next screen we will present the tools you can use to partition the device. You may now login as 'root'. Slint login:
pt_pt: Bem-vindo(a) ao dispositivo de instalação do Slint Linux! (versão ${Version}) ###### IMPORTANTE! LEIA AS INFORMAÇÕES ABAIXO CUIDADOSAMENTE. ###### No dispositivo em que o Slint será instalado, precisará de: - pelo menos uma partição do tipo 'Linux', com tamanho mínimo de ${GCOUNTMIN}G, para o próprio sistema (sem contar os ficheiros do utilizador). - se o dispositivo tiver um esquema GPT, uma pequena partição (4M) do tipo ef02 (Partição BIOS Boot) para instalar o GRUB nesta unidade no modo Legacy. - uma partição do sistema EFI, do tipo ef01, para instalar o GRUB no modo EFI, de tamanho pelo menos 100M, a menos que queira usar um existente. É recomendado que tenha uma partição swap (escreva 'Linux swap') antes da instalação, mas também pode configurar um ficheiro de swap posteriormente. Na próximo ecrã, vamos apresentar as ferramentas que pode usar para particionar o dispositivo. Pode agora iniciar sessão como 'root'. Início de sessão do Slint:

source: Slint Linux Setup
pt_pt: Configuração Slint Linux

source: \n Scanning your system for partition information...\n \n
pt_pt: \n A verificar o sistema em busca de informação sobre partições... \n \n

source: NO LINUX PARTITIONS DETECTED
pt_pt: NENHUMA PARTIÇÃO LINUX DETETADA

source: There don't seem to be any partitions on this machine of type Linux. You'll need to make at least one of these to install Linux. To do this, you'll need to leave 'setup', and make the partitions using 'cfdisk' (MBR partitions) or 'cgdisk' (GPT partitions). For more information, read the 'setup' help file from the next menu.
pt_pt: Não parece haver quaisquer partições do tipo Linux nesta máquina. Precisará de criar pelo menos uma destas para instalar o Linux. Para o fazer, precisa de sair do 'setup' e criar as partições usando o 'cfdisk' (partições MBR) ou o 'cgdisk' (partições GPT). Para mais informação, leia o ficheiro de ajuda do 'setup' no menu seguinte.

source: NO EFI SYSTEM PARTITION DETECTED
pt_pt: NENHUMA PARTIÇÃO DE SISTEMA EFI DETETADA

source: This machine appears to be using EFI/UEFI, but no EFI System Partition was found. You'll need to make an EFI System Partition in order to boot from the hard drive. To do this, leave 'setup', and use 'cgdisk' to make a 100MB partition of type EF00. For more information, read the 'setup' help file from the next menu.
pt_pt: Esta máquina parece estar a utilizar EFI/UEFI, mas não foi encontrada nenhuma Partição do Sistema EFI. É necessário criar uma Partição do Sistema EFI para arrancar a partir do disco rígido. Para o fazer, saia do 'setup' e use o 'cgdisk' para criar uma partição de 100MB do tipo EF00. Para mais informação, leia o ficheiro de ajuda do 'setup' no menu seguinte.

source: Slint Linux Setup (version ${Version})
pt_pt: Configuração do Slint Linux (versão ${Version})

source: Welcome to Slint Linux Setup. Select an option below using the UP/DOWN keys and SPACE or ENTER. Alternate keys may also be used: '+', '-', and TAB.
pt_pt: Bem-vindo(a) à configuração do Slint Linux. Selecione uma opção abaixo utilizando as teclas CIMA/BAIXO e ESPAÇO ou ENTER. As teclas alternativas também podem ser utilizadas: '+', '-' e TAB.

source: Read the Slint Setup HELP file
pt_pt: Leia o ficheiro de AJUDA da configuração do Slint

source: Remap your keyboard (other than $DefaultKeyMap)
pt_pt: Remapear o seu teclado (se não for o $DefaultKeyMap)

source: Set up your swap partition(s)
pt_pt: Definir a partição(ões) swap

source: Set up your target partitions
pt_pt: Definir as partições de destino

source: Install selected software
pt_pt: Instalar os softwares selecionados

source: Reconfigure your Linux system
pt_pt: Reconfigurar o seu sistema Linux

source: Exit Slint Linux Setup
pt_pt: Sair da configuração do Slint Linux

source: TARGET PARTITIONS ALREADY CONFIGURED
pt_pt: PARTIÇÕES DE DESTINO JÁ CONFIGURADAS

source: You have already configured the target partitions, where the system will be installed. Press ENTER to return to the main menu.
pt_pt: Já configurou as partições de destino, onde o sistema será instalado. Prima ENTER para voltar ao menu principal.

source: SOURCE OF PACKAGES ALREADY CHOSEN
pt_pt: FONTE DE PACOTES JÁ ESCOLHIDA

source: You have already chosen the source of packages. Press ENTER to return to the main menu.
pt_pt: Já escolheu a fonte dos pacotes. Prima ENTER para voltar ao menu principal.

source: SOURCE PACKAGES INAPPROPRIATE
pt_pt: PACOTES DA FONTE INAPROPRIADOS

source: Either the source packages are inappropriate for the target system: Slint version $SLINTVERSION (${SFX}-bit) or the file $INSTALL_PATH/slint/DONOTREMOVEME.TXT is missing. Please try again to set the source of packages
pt_pt: Ou os pacotes da fonte são inapropriados para o sistema de destino: Versão Slint $SLINTVERSION (${SFX}-bit) ou o ficheiro $INSTALL_PATH/slint/DONOTREMOVEME.TXT está em falta. Tente novamente para definir a fonte dos pacotes

source: CANNOT INSTALL SOFTWARE YET
pt_pt: AINDA NÃO PODE INSTALAR SOFTWARE

source: Before you can install software, complete the following tasks: 1. Select your source media. 2. Set up your target Linux partition(s). You may also optionally remap your keyboard and set up your swap partition(s). Press ENTER to return to the main menu.
pt_pt: Antes de poder instalar software, realize as seguintes tarefas: 1. Escolha o suporte de origem. 2. Configure a partição(ões) Linux de destino. Também pode, opcionalmente, remapear o teclado e configurar a partição(ões) swap. Prima ENTER para voltar ao menu principal.

source: READY TO INSTALL THE PACKAGES?
pt_pt: PRONTO PARA INSTALAR OS PACOTES?

source: Please confirm that you want to install the packages.
pt_pt: Confirme que deseja instalar os pacotes.

source: INSTALL KDE PACKAGES?
pt_pt: INSTALAR OS PACOTES KDE?

source: Do you want to install the KDE packages?
pt_pt: Deseja instalar os pacotes KDE?

source: A one-line description will be displayed as each package is installed.
pt_pt: Será apresentada a descrição de uma linha à medida que cada pacote é instalado.

source: SYSTEM NOT YET INSTALLED
pt_pt: SISTEMA NÃO INSTALADO

source: You need to install the packages before configuring the system. Please press ENTER to return to the main menu.
pt_pt: Precisa de instalar os pacotes antes de configurar o sistema. Prima ENTER para voltar ao menu principal.

source: REPLACE /etc/fstab?
pt_pt: SUBSTITUIR /etc/fstab?

source: You already have an /etc/fstab on your install partition. If you were just adding software, you should probably keep your old /etc/fstab. If you've changed your partitioning scheme, you should use the new /etc/fstab. Do you want to replace your old /etc/fstab with the new one?
pt_pt: Já tem um /etc/fstab na partição de instalação. Se estiver apenas a adicionar software, provavelmente deve manter o /etc/fstab antigo. Se alterou o esquema de partições, deve usar o novo /etc/fstab. Deseja substituir o /etc/fstab antigo pelo novo?

source: Installing translations...
pt_pt: A instalar traduções...

source: Slint Linux Setup is complete
pt_pt: A instalação do Slint Linux está concluída

source: Please remove the installation disc.
pt_pt: Remova o disco de instalação.

source: Would you like to reboot your system? If you choose No, you will be dropped to a shell.
pt_pt: Gostaria de reiniciar o sistema? Se escolher No (Não), será deixado numa shell (linha de comandos).

source: You may now reboot your system once you are ready. You can issue the 'reboot' command; or if your system has a keyboard attached, you can use the key combination: control+alt+delete
pt_pt: Pode agora reiniciar o sistema quando estiver pronto. Pode emitir o comando 'reboot'; ou se o sistema tiver um teclado anexado, pode utilizar a combinação de teclas: control+alt+delete

source: ** Starting reboot **
pt_pt: ** A reiniciar **

source: MOUSE CONFIGURATION
pt_pt: CONFIGURAÇÃO DO RATO

source: This part of the configuration process will create a /dev/mouse link pointing to your default mouse device. You can change the /dev/mouse link later if the mouse doesn't work, or if you switch to a different type of pointing device. We will also use the information about the mouse to set the correct protocol for gpm, the Linux mouse server. Please select a mouse type from the list below:
pt_pt: Esta parte do processo de configuração criará uma ligação /dev/mouse apontando para o seu dispositivo de rato padrão. Poderá mudar a ligação /dev/mouse posteriormente se o rato não funcionar, ou se mudar para um tipo diferente de dispositivo apontador. Também usaremos a informação sobre o rato para configurar o protocolo correto para o gpm, o servidor de rato do Linux. Escolha o tipo de rato da lista abaixo:

source: PS/2 port mouse (most desktops and laptops)
pt_pt: Entrada de rato PS/2 (maioria dos desktops e laptops)

source: USB connected mouse
pt_pt: Rato ligado por USB

source: 2 button Microsoft compatible serial mouse
pt_pt: Rato serial de 2 botões compatível com Microsoft

source: 3 button Microsoft compatible serial mouse
pt_pt: Rato serial de 3 botões compatível com Microsoft

source: Logitech serial MouseMan and similar devices
pt_pt: Logitech serial MouseMan e dispositivos similares

source: MouseSystems serial (most 3 button serial mice)
pt_pt: Rato serial MouseSystems (maioria dos ratos serial de 3 botões)

source: Plug and Play (serial mice that do not work with ms)
pt_pt: Plug and Play (rato serial que não funciona com ms)

source: Genius Netmouse on PS/2 port
pt_pt: Genius Netmouse na entrada PS/2

source: Some serial Logitech devices
pt_pt: Alguns dispositivos serial Logitech

source: Make serial Logitech behave like msc
pt_pt: Fazer rato Logitech de série comportar-se como msc

source: ATI XL busmouse (mouse card)
pt_pt: ATI XL busmouse (cartão do rato)

source: Microsoft busmouse (mouse card)
pt_pt: Microsoft busmouse (placa do rato)

source: Logitech busmouse (mouse card)
pt_pt: Logitech busmouse (placa do rato)

source: A pointing pen (NCR3125) on some laptops
pt_pt: Uma caneta de apontar (NCR3125) em alguns portáteis

source: Twiddler keyboard, by HandyKey Corp
pt_pt: Teclado Twiddler, da HandyKey Corp

source: Genitizer tablet (relative mode)
pt_pt: Tablet Genitizer (modo relativo)

source: Use a joystick as a mouse
pt_pt: Usar um joystick como rato

source: Wacom serial graphics tablet
pt_pt: Tablet de gráficos de série Wacom

source: SELECT SERIAL PORT
pt_pt: ESCOLHER PORTA DE SÉRIE

source: Your mouse requires a serial port. Which one would you like to use?
pt_pt: O rato precisa de uma porta de série. Qual deseja utilizar?

source: (COM1: under DOS)
pt_pt: (COM1: no DOS)

source: (COM2: under DOS)
pt_pt: (COM2: no DOS)

source: (COM3: under DOS)
pt_pt: (COM3: no DOS)

source: (COM4: under DOS)
pt_pt: (COM4: no DOS)

source: Stopping gpm...
pt_pt: A parar gpm...

source: Restarting gpm...
pt_pt: A reiniciar gpm...

source: Starting gpm:
pt_pt: A iniciar gpm:

source: GPM CONFIGURATION
pt_pt: CONFIGURAÇÃO DO GPM

source: The gpm program allows you to cut and paste text on the virtual consoles using a mouse. If you choose to run it at boot time, this line will be added to your /etc/rc.d/rc.gpm: $GPM -m /dev/mouse -t $MTYPE Shall we load the gpm program at boot time?
pt_pt: O programa gpm permite-te recortar e colar texto na consola virtual usando um rato. Se escolher executá-lo na hora do arranque, esta linha será incluída no seu /etc/rc.d/rc.gpm: $GPM -m /dev/mouse -t $MTYPE Devemos carregar o programa gpm na hora do arranque?

source: Select the default startup mode
pt_pt: Selecione o modo de inicialização padrão

source: Please choose the default startup mode: Console or Graphical. In Console mode, you log in and type your first command in a console. In this mode you can type "startx" to start the default desktop or windows manager, that you can also change typing "xwmconfig". In Graphical mode, you choose the desktop or windows manager, that will be started as soon as you are identified.
pt_pt: Escolha o modo de inicialização padrão: Consola ou Gráfico. No modo de consola, inicie sessão e escreva o seu primeiro comando numa consola. Neste modo, pode escrever "startx" para iniciar o ambiente de trabalho padrão ou o gestor de janelas, que também pode alterar escrevendo "xwmconfig". No modo Gráfico, escolhe o ambiente de trabalho ou o gestor de janelas, que será iniciado assim que for identificado.

source: Start Linux in Console mode
pt_pt: Inicie o Linux no modo Consola

source: Start Linux in Graphical mode
pt_pt: Inicie o Linux no modo Gráfico
