Repository: DidierSpaier/slint-translations
Catalog: translations20220905/manual_installer/*.manual_installer.po
Languages: pt_pt

source: An ISO image of Slint's install DVD was found. Do you want me to mount the ISO image and use this as the package source?
pt_pt: Foi encontrada uma imagem ISO do DVD de instalação do Slint. Quer montar a imagem ISO e usá-la como a fonte de pacotes?

source: USE ISO IMAGE
pt_pt: USAR IMAGEM ISO

source: SCANNING FOR CD or DVD DRIVE
pt_pt: A PESQUISAR POR UNIDADES DE CD ou DVD

source: Make sure the Slint disc is in your CD/DVD drive, and then press ENTER to begin the scanning process. Or, if you'd rather specify the device name manually (experts only), choose that option below.
pt_pt: Certifique-se que o disco do Slint está na sua unidade de CD/DVD, e depois prima ENTER para iniciar o processo de pesquisa. Ou, se preferir especificar o nome do dispositivo manualmente (modo avançado), escolha a opção abaixo.

source: Scan for the CD or DVD drive (recommended)
pt_pt: Procurar pela unidade de CD ou DVD (recomendado)

source: Manually specify CD or DVD by device name
pt_pt: Especificar manualmente o nome do dispositivo de CD ou DVD

source: MANUAL CD/DVD DEVICE SELECTION
pt_pt: SELEÇÃO MANUAL DO DISPOSITIVO DE CD/DVD

source: Please select your CD/DVD device from the list below. If you don't see your device listed, choose 'custom'. This will let you type in any device name. (and if necessary, will create the device)
pt_pt: Selecione o seu dispositivo de CD/DVD a partir da lista abaixo. Caso o dispositivo não esteja listado, escolha a opção 'personalizado'. Isto permitirá que escreva qualquer nome do dispositivo. (e se necessário, irá criar o dispositivo)

source: Type in the CD or DVD device to use
pt_pt: Digite o dispositivo de CD ou DVD a ser utilizado

source: First CD/DVD drive
pt_pt: Primeira unidade de CD/DVD

source: Second CD/DVD drive
pt_pt: Segunda unidade de CD/DVD

source: Third CD/DVD drive
pt_pt: Terceira unidade de CD/DVD

source: Fourth CD/DVD drive
pt_pt: Quarta unidade de CD/DVD

source: CD/DVD slave on first IDE bus
pt_pt: CD/DVD slave no primeiro barramento IDE

source: CD/DVD master on first IDE bus (unlikely)
pt_pt: CD/DVD master no primeiro barramento IDE (improvável)

source: CD/DVD master on second IDE bus
pt_pt: CD/DVD master no segundo barramento IDE

source: CD/DVD slave on second IDE bus
pt_pt: CD/DVD slave no segundo barramento IDE

source: CD/DVD master on third IDE bus
pt_pt: CD/DVD master no terceiro barramento IDE

source: CD/DVD slave on third IDE bus
pt_pt: CD/DVD slave no terceiro barramento IDE

source: CD/DVD master on fourth IDE bus
pt_pt: CD/DVD master no quarto barramento IDE

source: CD/DVD slave on fourth IDE bus
pt_pt: CD/DVD slave no quarto barramento IDE

source: First parallel port ATAPI CD
pt_pt: ATAPI CD da primeira porta paralela

source: Second parallel port ATAPI CD
pt_pt: ATAPI CD da segunda porta paralela

source: Third parallel port ATAPI CD
pt_pt: ATAPI CD da terceira porta paralela

source: Fourth parallel port ATAPI CD
pt_pt: ATAPI CD da quarta porta paralela

source: Non-IDE Aztech CD/DVD
pt_pt: CD/DVD Aztech não-IDE

source: Sony CDU-535 CD/DVD
pt_pt: CD/DVD Sony CDU-535

source: Non-IDE GoldStar CD/DVD
pt_pt: CD/DVD GoldStar não-IDE

source: Sony CDU-31a CD/DVD
pt_pt: CD/DVD Sony CDU-31a

source: Optics Storage CD/DVD
pt_pt: CD/DVD Armazenamento óptico

source: Sanyo non-IDE CD/DVD
pt_pt: CD/DVD Sanyo não-IDE

source: Non-IDE Mitsumi drive 1
pt_pt: Mitsumi unidade 1 não-IDE

source: Non-IDE Mitsumi drive 2
pt_pt: Mitsumi unidade 2 não-IDE

source: Old non-IDE SoundBlaster CD/DVD
pt_pt: CD/DVD SoundBlaster não-IDE antigo

source: Philips LMS CM-205 CD/DVD
pt_pt: CD/DVD Philips LMS CM-205

source: Philips LMS CM-206 CD/DVD
pt_pt: CD/DVD Philips LMS CM-206

source: Old non-IDE Mitsumi CD/DVD
pt_pt: CD/DVD Mitsumi não-IDE antigo

source: ENTER CD/DVD DEVICE MANUALLY
pt_pt: INSIRA MANUALMENTE O DISPOSITIVO DE CD/DVD

source: Please enter the name of the CD/DVD device (such as /dev/hdc) that you wish to use to mount the Slint CD/DVD:
pt_pt: Insira o nome do dispositivo de CD/DVD (tal como /dev/hdc) que deseja utilizar para montar o CD/DVD do Slint:

source: MKNOD CD/DVD DEVICE
pt_pt: DISPOSITIVO DE CD/DVD MKNOD

source: There doesn't seem to be a device by the name of $DRIVE_FOUND in the /dev directory, so we will have to create it using the major and minor numbers for the device. If you're using a bootdisk with a custom CD/DVD driver on it, you should be able to find these numbers in the documentation. Also, see the 'devices.txt' file that comes with the Linux kernel source. If you don't know the numbers, you'll have to hit Esc to abort. Enter the major and minor numbers for the new device, separated by one space:
pt_pt: Parece não existir um dispositivo com o nome de $DRIVE_FOUND no diretório /dev, então teremos que criá-lo usando o número principal e o número secundário para o dispositivo. Se estiver a usar um disco de arranque com um controlador de CD/DVD personalizado, deverá ser capaz de encontrar estes números na documentação. Além disso, veja o ficheiro 'devices.txt' que vem com o código fonte do kernel do Linux. Caso não saiba os números, terá que premir Esc para abortar. Forneça o número principal e o secundário para o novo dispositivo, separados por um espaço:

source: MAKING DEVICE IN /dev
pt_pt: A CRIAR O DISPOSITIVO EM /dev

source: MKNOD FAILED
pt_pt: FALHA DO MKNOD

source: Sorry, but the mknod command failed to make the device. You'll need to go back and try selecting your source media again. Press ENTER to abort the source media selection process.
pt_pt: Desculpe, mas o comando mknod falhou ao criar o dispositivo. Terá que retroceder e tente selecionar o seu disco fonte novamente. Prima ENTER para abortar o processo de seleção do disco fonte.

source: SCANNING
pt_pt: A ANALISAR

source: Scanning for a CD/DVD drive containing a Slint disc...
pt_pt: A analisar por uma unidade de CD/DVD com um disco do Slint...

source: Scanning for an IDE CD/DVD drive containing a Slint disc...
pt_pt: A procurar uma unidade de CD/DVD IDE com um disco do Slint...

source: Scanning for a parallel port ATAPI CD/DVD drive containing a Slint disc...
pt_pt: A procurar uma unidade de CD/DVD ATAPI da porta paralela com um disco do Slint...

source: No IDE/SCSI drive, so we will try scanning for CD drives on old proprietary interfaces, such as SoundBlaster pre-IDE CD drives, Sony CDU-31a, Sony 535, old Mitsumi pre-IDE, old Optics, etc. For this scan to work at all, you'll need to be using a bootdisk that supports your CD drive. Please press ENTER to begin this last-chance scan for old, obsolete hardware.
pt_pt: Nenhuma unidade IDE/SCSI, então vamos tentar procurar unidades de CD em interfaces proprietárias antigas, como unidades de CD SoundBlaster pre-IDE, Sony CDU-31a, Sony 535, Mitsumi pre-IDE antigo, Optics antigo, etc. Para essa procura funcionar, deve de usar um disco de inicialização que suporte a sua unidade de CD. Prima ENTER para iniciar essa última tentativa de procura por hardware antigo e obsoleto.

source: CD/DVD DRIVE NOT FOUND
pt_pt: UNIDADE DE CD/DVD NÃO ENCONTRADA

source: A CD/DVD drive could not be found on any of the devices that were scanned. Possible reasons include using a bootdisk or kernel that doesn't support your drive, failing to pass parameters needed by some drives to the kernel, not having the Slint disc in your CD/DVD drive, or using a drive connected to a Plug and Play soundcard (in this case, connecting the drive directly to the IDE interface often helps). Please make sure you are using the correct bootdisk for your hardware, consult the BOOTING file for possible information on forcing the detection of your drive, and then reattempt installation. If all else fails, see FAQ.TXT for information about copying parts of this CD to your DOS partition and installing it from there. You will now be returned to the main menu. If you want to try looking for the CD again, you may skip directly to the SOURCE menu selection.
pt_pt: Não foi encontrada uma unidade de CD/DVD em nenhum dos dispositivos analisados. As razões possíveis incluem o uso de um disco de arranque ou kernel que não suporta a sua unidade, falha na passagem de parâmetros necessários por algumas unidades para o kernel, não ter o disco do Slint no sua unidade de CD/DVD ou o uso de um unidade ligada a uma placa de som Plug and Play (neste caso, ligar a unidade diretamente na interface IDE pode ajudar). Verifique se está a usar o disco de arranque correto para o seu equipamento, consulte o ficheiro BOOTING para possíveis informações para forçar a deteção da sua unidade, para então tentar a instalação novamente. Caso tudo falhe, veja no FAQ.TXT informações sobre copiar partes deste CD para a partição DOS e instalar a partir da mesma. Será agora redirecionado para o menu principal. Se quiser tentar procurar pelo CD novamente pode saltar diretamente para a opção de menu SOURCE.

source: CD/DVD DRIVE FOUND
pt_pt: ENCONTRADA UNIDADE DE CD/DVD

source: A Slint disc was found in device $DRIVE_FOUND.
pt_pt: Foi encontrado um disco do Slint no dispositivo $DRIVE_FOUND.

source: MOUNT ERROR
pt_pt: ERRO DE MONTAGEM

source: There was an error attempting to mount the CD/DVD on $DRIVE_FOUND. Maybe the device name is incorrect, the disc is not in the drive, or the kernel you are using does not support the device. (possibly an incorrect bootdisk) What would you like to do now?
pt_pt: Ocorreu um erro ao tentar montar o CD/DVD em $DRIVE_FOUND. Talvez o nome do dispositivo esteja incorreto, o disco não esteja na unidade ou o kernel que está a usar não suporte o dispositivo. (possivelmente um disco de arranque incorreto) O que deseja fazer agora?

source: Abort CD installation
pt_pt: Abortar instalação do CD

source: Attempt to mount the CD/DVD device again
pt_pt: Tentar montar novamente o dispositivo de CD/DVD

source: Ignore the error and continue
pt_pt: Ignorar o erro e continuar

source: ATTEMPTING TO MOUNT CD/DVD on $DRIVE_FOUND
pt_pt: A TENTAR MONTAR O CD/DVD em $DRIVE_FOUND

source: Attempting to mount your CD/DVD again with the following command: $ArG
pt_pt: A tentar montar novamente o seu CD/DVD com o seguinte comando: $ArG

source: Good! We're all set on the local end, but now we need to know where to find the software packages to install. First, we need the IP address of the machine where the Slint sources are stored.
pt_pt: Ótimo! Nós estamos prontos quanto ao local final, mas agora precisamos de saber onde encontrar os pacotes de software a instalar. Primeiro, precisamos do endereço de IP da máquina onde as fontes do Slint estão guardadas.

source: Since you're already running on the network, you should be able to use the hostname instead of an IP address if you wish.
pt_pt: Como já está a executar na rede, deveria conseguir utilizar o nome de hospedeiro, em vez do endereço de IP, se o desejar.

source: What is the IP address of your NFS server?
pt_pt: Qual é o endereço de IP do seu servidor NFS?

source: ENTER IP ADDRESS OF NFS SERVER
pt_pt: INSIRA O ENDEREÇO DE IP DO SERVIDOR NFS

source: There must be a directory on the server with the Slint packages and files arranged in a tree like the FTP site. The installation script needs to know the name of the directory on your server that contains the packages. For example, if the packages' directory is /stuff/slint, then you would respond: /stuff/slint What is the Slint source directory?
pt_pt: Deverá haver um diretório no servidor com os pacotes e ficheiros Slint dispostos numa árvore como o site FTP. O script de instalação precisa de saber o nome do diretório no seu servidor que contém os pacotes. Por exemplo, se o diretório dos pacotes é /coisas/slint, então responderia: /coisas/slint Qual é o diretório fonte do Slint?

source: SELECT SOURCE DIRECTORY
pt_pt: SELECIONAR DIRETÓRIO FONTE

source: In the next screen you should watch for NFS mount errors. If you see errors and you don't see your NFS server listed, then try setting up NFS again.
pt_pt: No próximo ecrã deve monitorizar os erros de montagem NFS. Caso ocorram erros e seu servidor NFS não seja exibido, tente configurar o NFS novamente.

source: NFS MOUNT INFORMATION
pt_pt: INFORMAÇÃO DA MONTAGEM NFS

source: Mounting $REMOTE_PATH:
pt_pt: Montando $REMOTE_PATH:

source: Didn't work.
pt_pt: Não funcionou.

source: Maybe you should check that the directory name is correct?
pt_pt: Talvez devia verificar se o nome do diretório está correto?

source: Current NFS mounts:
pt_pt: Montagens NFS atuais:

source: Do you need to try setting up NFS again?
pt_pt: Precisa de tentar configurar o NFS novamente?

source: NFS MOUNT RESULT
pt_pt: RESULTADO DA MONTAGEM NFS

source: Good! We're all set on the local end, but now we need to know where to find the software packages to install. First, we need the share address of the Samba server where the Slint sources are stored. Example share address: //192.168.0.1/public
pt_pt: Ótimo! Estamos prontos quanto ao local, mas agora precisamos de saber onde encontrar os pacotes de software a serem instalados. Primeiro, precisamos do endereço de partilha do servidor Samba onde as fontes do Slint estão armazenadas. Exemplo de endereço de partilha: //192.168.0.1/public

source: Since you're already running on the network, you should be able to use the hostname instead of an IP address if you wish.
pt_pt: Como já está executando na rede, deve ser capaz de usar o "hostname" ao invés do endereço IP, se desejar.

source: What is the share address of your Samba server?
pt_pt: Qual é o endereço de partilha do seu servidor Samba?

source: ENTER SHARE ADDRESS OF SAMBA SERVER
pt_pt: INFORMAR ENDEREÇO DE PARTILHA DO SERVIDOR SAMBA

source: You should see no mount errors:
pt_pt: Nenhum erro de montagem deve ocorrer:

source: Mounting $REMOTE_SHARE ...
pt_pt: A montar $REMOTE_SHARE ...

source: Mount failed.
pt_pt: Falha ao montar.

source: Mounted Samba share(s):
pt_pt: Partilha(s) Samba montadas:

source: A Slint package tree was found! Ready to continue.
pt_pt: Uma árvore de pacotes do Slint foi encontrada! Pronto para continuar.

source: No Slint package tree found at the indicated path!
pt_pt: Nenhuma árvore de pacotes do Slint encontrada no caminho indicado!

source: Do you want to try setting up Samba again?
pt_pt: Quer tentar configurar o Samba novamente?

source: MOUNT RESULT
pt_pt: RESULTADO DA MONTAGEM

source: SCANNING FOR USB STICK
pt_pt: A PROCURAR POR UNIDADE USB

source: Make sure the USB stick containing the Slint package directory is inserted into a USB port, and then press ENTER to begin the scanning process.
pt_pt: Certifique-se que a unidade USB contendo o diretório de pacotes do Slint está inserida numa porta USB, e de seguida prima ENTER para iniciar o processo de análise.

source: NO REMOVABLE USB DEVICES FOUND
pt_pt: NENHUM DISPOSITIVO USB REMOVÍVEL ENCONTRADO

source: Sorry, but no removable USB devices could be found. Exiting back to the top menu.
pt_pt: Nenhum dispositivo USB removível foi encontrado. A regressar ao menu principal.

source: NO SLINT DIRECTORY FOUND
pt_pt: NENHUM DIRETÓRIO DO SLINT ENCONTRADO

source: Sorry, but a Slint directory could not be found on any USB devices. Exiting back to the top menu.
pt_pt: O diretório do Slint não foi encontrado em nenhum dispositivo USB. A regressar ao o menu principal.

source: USB PACKAGE SOURCE FOUND
pt_pt: FONTE USB DE PACOTES ENCONTRADA

source: A Slint package directory was found on device $DRIVE_FOUND.
pt_pt: Um diretório de pacotes do Slint foi encontrado no dispositivo $DRIVE_FOUND.

source: Can't umount /var/log/mount. Reboot machine and run setup again.
pt_pt: Não foi possível desmontar /var/log/mount. Reinicie a máquina e execute o setup novamente.

source: Mount table corrupt. Reboot machine and run setup again.
pt_pt: Tabela de montagem corrompida. Reinicie a máquina e execute setup novamente.

source: OK, we will install from a directory within the current filesystem. If you have mounted this directory yourself, you should not use /mnt or /var/log/mount as mount points, since Setup might need to use these directories. You may install from any part of the current directory structure, no matter what the media is (including NFS). You will need to type in the name of the directory containing the subdirectories for each source disk. Which directory would you like to install from?
pt_pt: OK, vamos instalar a partir de um diretório no sistema de ficheiros atual. Se montou o diretório, não deve usar /mnt ou /var/log/mount como pontos de montagem, já que a Instalação pode precisar de usar estes diretórios. Pode instalar a partir de qualquer parte da estrutura de diretórios atual, não importando qual media é (incluindo NFS). Vai precisar de escrever o nome do diretório que contém os subdiretórios para cada disco de origem. A partir de qual diretório deseja instalar?

source: INSTALL FROM THE CURRENT FILESYSTEM
pt_pt: INSTALAR A PARTIR DO SISTEMA DE FICHEIROS ATUAL

source: Sorry - the directory you specified is not valid. Please check the directory and try again. (Directory given: $SOURCEDIR)
pt_pt: Desculpe - o diretório especificado não é válido. Verifique o diretório e tente novamente. (Diretório especificado: $SOURCEDIR)

source: INVALID DIRECTORY ENTERED
pt_pt: DIRETÓRIO INVÁLIDO INTODUZIDO

source: Mount table corrupt. Reboot machine and run setup again
pt_pt: Tabela de montagem corrompida. Reinicie a máquina e execute a instalação novamente

source: In order to install directly from the hard disk you must have a partition (such as /dev/sda1, /dev/sdb5, etc) with the Slint distribution's slint/ directory like you'd find it on the FTP site. Please enter the partition (such as /dev/sda1) where the Slint sources can be found, or [enter] to see a partition list
pt_pt: A fim de instalar diretamente do disco rígido deve ter uma partição (como /dev/sda1, /dev/sdb5, etc) com o diretório slint/ da distribuição do Slint como encontraria no site FTP. Informe a partição (tal como /dev/sda1) onde as fontes do Slint podem ser encontradas, ou prima [enter] para ver uma lista de partições

source: INSTALLING FROM HARD DISK
pt_pt: A INSTALAR A PARTIR DE UM DISCO RÍGIDO

source: PARTITION LIST
pt_pt: LISTA DE PARTIÇÕES

source: Now we need to know the full path on this partition to the slint/ directory where the packages to be installed are kept. For example, if the packages' directory is /stuff/slint, then you would respond: /stuff/slint What directory are the Slint sources in?
pt_pt: Agora precisamos de saber a localização completa nesta partição até o diretório slint/ onde os pacotes a serem instalados são mantidos. Por exemplo, se o diretório dos pacotes é /coisas/slint, então responderia: /coisas/slint Em que diretório estão as fontes do Slint?

source: There was a problem mounting your partition. Would you like to:
pt_pt: Houve um problema a montar a sua partição. Gostaria de:

source: Start over
pt_pt: Começar novamente

source: Sorry, but the directory $SLACK_SOURCE_LOCATION does not exist on partition $SLACK_DEVICE. Would you like to try again?
pt_pt: Desculpe, mas o diretório $SLACK_SOURCE_LOCATION não existe na partição $SLACK_DEVICE. Gostaria de tentar novamente?

source: SOURCE DIRECTORY NOT FOUND
pt_pt: DIRETÓRIO DE ORIGEM NÃO ENCONTRADO

source: Setting permissions on NTFS partition $DOS_PART
pt_pt: Definindo permissões na partição NTFS $DOS_PART

source: SET SECURITY FOR NTFS PARTITION $DOS_PART
pt_pt: DEFINIR SEGURANÇA DA PARTIÇÃO NTFS $DOS_PART

source: Because users could go snooping through (or destroy, depending on the settings) your Windows partition, you should choose how much access would you like your non-root users to have to partition $DOS_PART. The access level can range from no access at all, to read-only for everyone, to read-write access for every user on the machine. A reasonable default (read-write for root only) is chosen, but you may set this any way that you like.
pt_pt: Porque os utilizadores podiam espiar (ou destruir, dependendo das definições) a sua partição Windows, deve escolher a quantidade de acesso que gostaria que seus utilizadores não-administradores tivessem na partição $DOS_PART. O nível de acesso varia, podendo ser nenhum acesso, apenas-leitura para todos ou até leitura-escrita para todos os utilizadores na máquina. Um padrão razoável (leitura-escrita apenas para o administrador) é escolhido, mas pode configurar como preferir.

source: Root has read/write access, users have no access (ntfs-3g)
pt_pt: O administrador tem acesso de leitura/escrita, utilizadores não tem acesso (ntfs-3g)

source: Everyone has read only access (built-in kernel ntfs driver)
pt_pt: Todos têm acesso apenas a leitura (driver ntfs embutido no kernel)

source: Everyone has read access, but only root can write (ntfs-3g)
pt_pt: Todos tem acesso de leitura, mas só o administrador pode escrever (ntfs-3g)

source: All users can read/write to any file (ntfs-3g)
pt_pt: Todos os utilizadores podem ler/escrever em qualquer ficheiro (ntfs-3g)

source: Setting permissions on FAT partition $DOS_PART
pt_pt: Definindo permissões na partição FAT $DOS_PART

source: SET SECURITY FOR FAT PARTITION $DOS_PART
pt_pt: DEFINIR SEGURANÇA DA PARTIÇÃO FAT $DOS_PART

source: Root has read/write access, users have no access
pt_pt: Administrador tem acesso de leitura/escrita, utilizadores não tem acesso

source: Everyone has read only access
pt_pt: Todos tem acesso apenas a leitura

source: Everyone has read access, but only root can write
pt_pt: Todos tem acesso de leitura, mas apenas o administrador pode escrever

source: All users can read/write to any file
pt_pt: Todos os utilizadores podem ler/escrever em qualquer ficheiro

source: Setting up non-Linux partitions.
pt_pt: A configurar partições não-Linux.

source: FAT or NTFS PARTITIONS DETECTED
pt_pt: PARTIÇÕES FAT ou NTFS DETETADAS

source: Partitions of type FAT or NTFS (commonly used by DOS and Windows) have been found on your system. Would you like to add these partitions to your /etc/fstab so that these partitions are visible from Linux?
pt_pt: Partições do tipo FAT ou NTFS (geralmente usadas pelo DOS e pelo Windows) foram encontradas no seu sistema. Gostaria de adicionar estas partições ao seu /etc/fstab para que estas partições sejam visíveis no Linux?

source: Selecting non-Linux partitions.
pt_pt: A selecionar partições não-Linux.

source: SELECT PARTITION TO ADD TO /etc/fstab
pt_pt: SELECIONAR PARTIÇÃO PARA ADICIONAR AO /etc/fstab

source: Select
pt_pt: Selecionar

source: Continue
pt_pt: Continuar

source: In order to make these partitions visible from Linux, we need to add them to your /etc/fstab. Please pick a partition to add to /etc/fstab, or select '---' to continue with the installation process.
pt_pt: Afim de tornarmos essas partições visíveis no Linux, precisamos adicioná-las ao /etc/fstab. Escolha uma partição para adicionar ao /etc/fstab, ou selecione '---' para continuar com o processo de instalação.

source: IN USE
pt_pt: EM USO

source: on
pt_pt: em

source: done, continue with setup
pt_pt: concluído, continuar com a instalação

source: Selecting a location to mount $DOS_PART.
pt_pt: Selecionando um local para montar $DOS_PART.

source: PICK MOUNT POINT FOR $DOS_PART
pt_pt: ESCOLHER PONTO DE MONTAGEM PARA $DOS_PART
