Repository: DidierSpaier/slint-translations
Catalog: translations20220905/manual_installer/*.manual_installer.po
Languages: pt_pt

source: Now this partition must be mounted somewhere in your directory tree. Please enter the directory under which you would like to put it. For instance, you might want to enter /fat-c or /fat-d or something similar. NOTE: This partition will not actually be mounted until you reboot. Where would you like to mount $DOS_PART?
pt_pt: Agora esta partição precisa de ser montada em algum lugar na sua árvore de diretórios. Introduza o diretório no qual gostaria de a colocar. Por exemplo, poderia introduzir /fat-c ou /fat-d, ou algo similar. NOTA: Esta partição não será realmente montada até que reinicie. Onde gostaria de montar $DOS_PART?

source: Adding this information to your /etc/fstab:
pt_pt: Adicionando esta informação ao seu /etc/fstab:

source: Finished setting up non-Linux partitions.
pt_pt: Terminamos de configurar as partições não-Linux.

source: DONE ADDING FAT or NTFS PARTITIONS
pt_pt: ADICÃO DE PARTIÇÕES FAT ou NTFS CONCLUÍDA

source: FORMAT EFI PARTITION ${PREFERRED_EFI_PARTITION}?
pt_pt: FORMATAR PARTIÇÃO EFI ${PREFERRED_EFI_PARTITION}?

source: An EFI System Partition was found on ${PREFERRED_EFI_PARTITION}, but it has not yet been formatted. Would you like to format this partition?
pt_pt: Uma Partição de Sistema EFI foi encontrada em ${PREFERRED_EFI_PARTITION}, mas ainda não foi formatada. Gostaria de formatar esta partição?

source: FORMATTING EFI PARTITION ${PREFERRED_EFI_PARTITION}
pt_pt: A FORMATAR PARTIÇÃO EFI ${PREFERRED_EFI_PARTITION}

source: Formatting EFI System Partition ${PREFERRED_EFI_PARTITION} as FAT32.
pt_pt: A formatar Partição de Sistema EFI ${PREFERRED_EFI_PARTITION} como FAT32.

source: Finished setting up EFI System Partition.
pt_pt: Configuração da Partição de Sistema EFI concluída.

source: EFI SYSTEM PARTITION RECOGNIZED
pt_pt: PARTIÇÃO DE SISTEMA EFI RECONHECIDA

source: CONFIGURE THE SYSTEM
pt_pt: CONFIGURAR O SISTEMA

source: Now we can configure your Linux system. If this is a new installation, you MUST configure it now or it will not boot correctly. However, if you are just adding software to an existing system, you can back out to the main menu and skip this step. However (important exception) if you've installed a new kernel image, it's important to reconfigure your system so that you can install LILO (the Linux loader) or create a bootdisk using the new kernel. You want to CONFIGURE your system, right?
pt_pt: Agora pode configurar o seu sistema Linux. Se for uma instalação nova, DEVE configurá-la agora ou então o mesmo não irá iniciar corretamente. Contudo, se está apenas a adicionar softwares a um sistema existente, pode voltar para o menu principal e ignorar este passo. Porém (exceção importante) se instalou uma imagem nova do kernel, é importante que reconfigure o seu sistema para que possa instalar o LILO (o carregador do Linux) ou criar um disco de arranque para o novo kernel. Deseja CONFIGURAR o seu sistema, certo?

source: DONE INSTALLING PACKAGES
pt_pt: INSTALAÇÃO DE PACOTES CONCLUÍDA

source: Preparing to configure your new Linux system...
pt_pt: Preparando para configurar seu novo sistema Linux...

source: ERROR: TARGET PARTITION FULL
pt_pt: ERRO: PARTIÇÃO DE DESTINO CHEIA

source: Setup has detected that one or more of your target partitions has become full. I'm sorry, but you will have to try installing again onto a partition or partitions with more free space. You could also try selecting fewer packages to install. Since there is no longer any space for setup to make its temporary files, this is an unrecoverable error. Press control-alt-delete to reboot and try again. Before doing that, you might want to switch to another console (Alt-F2) and use df (disk free utility) to see if you can get an idea of how to avoid this the next time around.
pt_pt: A configuração detetou que uma ou mais das suas partições de destino ficou cheia. Desculpe, mas terá que instalar novamente numa ou mais partições com mais espaço livre. Pode também tentar escolher menos pacotes para instalar. Como não existe mais espaço para a instalação fazer seus ficheiros temporários, este é um erro irrecuperável. Prima control-alt-delete para reiniciar e tentar novamente. Antes de fazer isso, pode querer mudar para outra consola (Alt-F2) e usar o df (utilitário de espaço livre em disco) para ver se consegue ter uma ideia de como evitar isso da próxima vez.

source: REINSERT KERNEL DISC
pt_pt: REINSERIR DISCO DO KERNEL

source: Please reinsert the Slint disc containing the collection of Linux kernels. Usually this is disc number one (the disc that you boot from). Once you've inserted the disc, hit ENTER to continue.
pt_pt: Reinsira o disco do Slint contendo a coleção de kernels do Linux. Geralmente este é o disco número um (o disco do qual fez o arranque). Assim que tiver inserido o disco, prima ENTER para continuar.

source: ERROR ATTEMPTING TO INSTALL KERNEL
pt_pt: ERRO AO TENTAR INSTALAR O KERNEL

source: Sorry, but the directory $PLINK/kernels was not found. You may need to install the requested kernel $SLACK_KERNEL manually and then install LILO before your system will be able to boot correctly.
pt_pt: Desculpe, mas o diretório $PLINK/kernels não foi encontrado. Talvez precise de instalar o kernel requisitado $SLACK_KERNEL manualmente e então instalar o LILO antes de seu sistema ser capaz de iniciar corretamente.

source: KEYBOARD MAP SELECTION
pt_pt: SELEÇÃO DO MAPA DE TECLADO

source: You may select one of the following keyboard maps. If you do not select a keyboard map, $DefaultKeyMap is the current value. Use the UP/DOWN arrow keys and PageUp/PageDown to scroll through the whole list of choices.
pt_pt: Pode selecionar um dos seguintes mapas de teclado. Se não selecionar um mapa de teclado, $DefaultKeyMap é o valor atual. Use as teclas CIMA/BAIXO e PageUp/PageDown para navegar através da lista de opções.

source: OK, the new map is now installed. You may now test it by typing anything you want. To quit testing the keyboard, enter 1 on a line by itself to accept the map and go on, or 2 on a line by itself to reject the current keyboard map and select a new one.
pt_pt: OK, o novo mapa está instalado. Pode testá-lo agora escrevendo qualquer coisa. Para sair do teste do teclado, escreva 1 numa linha vazia para aceitar o mapa e avançar, ou 2 numa linha vazia para rejeitar o mapa de teclado atual e selecionar um novo.

source: Select Slint installation source.
pt_pt: Selecionar a origem de instalação do Slint.

source: SOURCE MEDIA SELECTION
pt_pt: SELEÇÃO DO SUPORTE DE ORIGEM

source: Please select the media from which to install Slint Linux:
pt_pt: Selecione o suporte do qual o Slint Linux será instalado:

source: Install from a Slint USB stick
pt_pt: Instalar a partir de uma unidade USB do Slint

source: Install from a Slint CD or DVD
pt_pt: Instalar a partir de um CD ou DVD do Slint

source: Install from a pre-mounted directory
pt_pt: Instalar a partir de um diretório pré-montado

source: Install from a hard drive partition
pt_pt: Instalar a partir de uma partição no disco rígido

source: Install from NFS (Network File System)
pt_pt: Instalar a partir de NFS (Network File System)

source: Install from Samba share
pt_pt: Instalar a partir de um partilha Samba

source: You will now get a chance to probe your network interfaces.
pt_pt: Agora terá uma oportunidade de examinar as suas interfaces de rede.

source: PROBING NETWORK DEVICES
pt_pt: A EXAMINAR DISPOSITIVOS DE REDE

source: Are you OK with the network interface which was detected? If not, select 'No' to get back to the network probe program. You can try to load another driver explicitly, by using 'P <driver_name>'. If you are satisfied, select 'Yes' to continue with network configuration.
pt_pt: Está satisfeito com a interface de rede que foi detetada? Se não está, selecione No 'Não' para voltar para o programa de sondagem de rede. Pode tentar carregar outro controlador explicitamente, usando 'P <nome_do_controlador>'. Se está satisfeito, selecione Yes 'Sim' para continuar com a configuração de rede.

source: INITIALIZING NETWORK
pt_pt: A INICIAR A REDE

source: Waiting a few seconds for DHCP polling to settle ...
pt_pt: Aguardando alguns segundos para que a pesquisa do DHCP se estabeleça ...

source: You're running off the hard drive filesystem. Is this machine currently running on the network you plan to install from? If so, we won't try to reconfigure your ethernet card. Are you up-and-running on the network?
pt_pt: Está a executar o sistema de ficheiros do disco rígido. Está esta máquina a ser executada atualmente na mesma rede de onde planeia instalar? Se for o caso, não tentaremos reconfigurar a placa ethernet. Está ligado e a funcionar na rede?

source: NETWORK CONFIGURATION
pt_pt: CONFIGURAÇÃO DE REDE

source: I can configure your network interface $ENET_DEVICE fully automatically using DHCP. If you want this, please select 'yes'. If you select 'no' instead, then you will be able to assign the IP address, netmask and gateway manually.
pt_pt: Eu posso configurar a sua interface de rede $ENET_DEVICE completamente usando DHCP. Se quer isso, selecione Yes 'sim'. Se ao invés disso selecionar no 'não', então será capaz de atribuir o endereço IP, a máscara de rede e o gateway manualmente.

source: DHCP CONFIGURATION
pt_pt: CONFIGURAÇÃO DHCP

source: You will need to enter the IP address you wish to assign to this machine. Example: 111.112.113.114 What is your IP address?
pt_pt: Precisa de fornecer o endereço IP que deseja atribuir a esta máquina. Exemplo: 111.112.113.114 Qual é o seu endereço IP?

source: ASSIGN IP ADDRESS
pt_pt: ATRIBUIR ENDEREÇO IP

source: Now we need to know your netmask. Typically this will be 255.255.255.0 but this can be different depending on your local setup. What is your netmask?
pt_pt: Agora precisamos de saber a sua máscara de rede. Normalmente ela será 255.255.255.0 mas pode ser diferente dependendo de sua configuração local. Qual é a sua máscara de rede?

source: ASSIGN NETMASK
pt_pt: ATRIBUIR MÁSCARA DE REDE

source: Do you have a gateway?
pt_pt: Tem um gateway?

source: ASSIGN GATEWAY ADDRESS
pt_pt: ATRIBUIR ENDEREÇO DE GATEWAY

source: What is the IP address for your gateway?
pt_pt: Qual é o endereço IP para o seu gateway?

source: This is the proposed network configuration for $ENET_DEVICE - If this is OK, then select 'Yes'. If this is not OK and you want to configure again, select 'No'. * IP Address: $LOCAL_IPADDR * Netmask: $LOCAL_NETMASK
pt_pt: Esta é a configuração de rede proposta para $ENET_DEVICE - Se estiver OK, selecione Yes 'Sim'. Se não estiver OK e quiser configurar novamente, selecione No 'Não'. * Endereço IP: $LOCAL_IPADDR * Máscara de rede: $LOCAL_NETMASK

source: Configuring your network interface $ENET_DEVICE ...
pt_pt: A configurar a sua interface de rede $ENET_DEVICE ...

source: FETCHING CONFIGURATION
pt_pt: A PESQUISAR CONFIGURAÇÃO

source: Attempting to fetch a remote configuration file using $PROTO ...
pt_pt: A tentar pesquisar um ficheiro de configuração remoto usando $PROTO ...

source: FORMATTING
pt_pt: A FORMATAR

source: Formatting $ArG1 with filesystem btrfs.
pt_pt: A formatar $ArG1 com o sistema de ficheiros btrfs.

source: Formatting $ArG1 Size in 1K blocks: $SIZE Filesystem type: btrfs
pt_pt: A formatar $ArG1 Tamanho em blocos de 1K: $SIZE Tipo do sistema de ficheiros: btrfs

source: Formatting $ArG1 with filesystem ext2.
pt_pt: A formatar $ArG1 com o sistema de ficheiros ext2.

source: Formatting $ArG1 Size in 1K blocks: $SIZE Filesystem type: ext2
pt_pt: A formatar $ArG1 Tamanho em blocos de 1K: $SIZE Tipo do sistema de ficheiros: ext2

source: Formatting $ArG1 with filesystem ext3.
pt_pt: A formatar $ArG1 com o sistema de ficheiros ext3.

source: Formatting $ArG1 Size in 1K blocks: $SIZE Filesystem type: ext3
pt_pt: A formatar $ArG1 Tamanho em blocos de 1K: $SIZE Tipo do sistema de ficheiros: ext3

source: Formatting $ArG1 with filesystem ext4.
pt_pt: A formatar $ArG1 com o sistema de ficheiros ext4.

source: Formatting $ArG1 Size in 1K blocks: $SIZE Filesystem type: ext4
pt_pt: A formatar $ArG1 Tamanho em blocos de 1K: $SIZE Tipo do sistema de ficheiros: ext4

source: Formatting $ArG1 with filesystem jfs.
pt_pt: A formatar $ArG1 com o sistema de ficheiros jfs.

source: Formatting $ArG1 Size in 1K blocks: $SIZE Filesystem type: jfs
pt_pt: A formatar $ArG1 Tamanho em blocos de 1K: $SIZE Tipo do sistema de ficheiros: jfs

source: Formatting $ArG1 with filesystem reiserfs.
pt_pt: A formatar $ArG1 com o sistema de ficheiros reiserfs.

source: Formatting $ArG1 Size in 1K blocks: $SIZE Filesystem type: reiserfs
pt_pt: A formatar $ArG1 Tamanho em blocos de 1K: $SIZE Tipo do sistema de ficheiros: reiserfs

source: Formatting $ArG1 with filesystem xfs.
pt_pt: A formatar $ArG1 com o sistema de ficheiros xfs.

source: Formatting $ArG1 Size in 1K blocks: $SIZE Filesystem type: xfs
pt_pt: A formatar $ArG1 Tamanho em blocos de 1K: $SIZE Tipo do sistema de ficheiros: xfs

source: done adding partitions, continue with setup
pt_pt: particionamento concluído, continuar a instalação

source: Do you want to format Linux partition ${ArG1}?
pt_pt: Quer formatar a partição Linux ${ArG1}?

source: FORMAT PARTITION $ArG1
pt_pt: FORMATAR PARTIÇÃO $ArG1

source: If this partition has not been formatted, you should format it. NOTE: This will erase all data on it. Would you like to format this partition?
pt_pt: Se esta partição não foi formatada, deve formatá-la. NOTA: Isto vai apagar todos os dados existentes. Deseja formatar esta partição?

source: Quick format with no bad block checking
pt_pt: Formatação rápida sem verificação de bad blocks

source: Slow format that checks for bad blocks
pt_pt: Formatação lenta que verifica se existem bad blocks

source: No, do not format this partition
pt_pt: Não, não formate esta partição

source: Ext2 is the traditional Linux file system and is fast and stable.
pt_pt: Ext2 é o sistema de ficheiros tradicional do Linux, além de ser rápido e estável.

source: Ext3 is the journaling version of the Ext2 filesystem.
pt_pt: Ext3 é a versão com journaling do sistema de ficheiros Ext2.

source: Ext4 is the successor to the ext3 filesystem.
pt_pt: Ext4 é o sucessor do sistema de ficheiros ext3.

source: ReiserFS is a journaling filesystem that stores all files and filenames in a balanced tree structure.
pt_pt: ReiserFS é um sistema de ficheiros com journaling que armazena todos os ficheiros e nomes de ficheiro numa estrutura de árvore balanceada.

source: Btrfs is a B-tree copy-on-write filesystem.
pt_pt: Btrfs é um sistema de ficheiros B-tree copy-on-write.

source: JFS is IBM's Journaled Filesystem, currently used in IBM enterprise servers.
pt_pt: JFS é o sistema de ficheiros com journaling da IBM, usado atualmente em servidores corporativos da IBM.

source: XFS is SGI's journaling filesystem that originated on IRIX.
pt_pt: XFS é sistema de ficheiros com journaling do SGI's que originou no IRIX.

source: SELECT FILESYSTEM FOR $ArG1
pt_pt: SELECIONAR O SISTEMA DE FICHEIROS PARA $ArG1

source: Partition $ArG1 will be formatted.
pt_pt: A partição $ArG1 será formatada.

source: Please select the type of filesystem to use for the specified device. Here are descriptions of the available filesystems:
pt_pt: Selecione o tipo de sistema de ficheiros a ser utilizado no dispositivo especificado. Aqui, estão descrições dos sistemas de ficheiros disponíveis:

source: Standard Linux Ext2 Filesystem
pt_pt: Sistema de ficheiros Padrão do Linux Ext2

source: Ext3 Journaling Filesystem
pt_pt: Sistema de ficheiros com Journaling Ext3

source: Ext4 Journaling Filesystem
pt_pt: Sistema de ficheiros com Journaling Ext4

source: IBM's Journaled Filesystem
pt_pt: Sistema de ficheiros com Journaling da IBM

source: ReiserFS Journaling Filesystem
pt_pt: Sistema de ficheiros com Journaling ReiserFS

source: Btrfs Copy-on-Write B-tree Filesystem
pt_pt: Sistema de ficheiros Btrfs Copy-on-Write B-tree

source: Flash-Friendly File System
pt_pt: Sistema de ficheiros Flash-Friendly

source: SGI's Journaling Filesystem
pt_pt: Sistema de ficheiros com Journaling do SGI's

source: Setting up root Linux partition.
pt_pt: A configurar a partição root do Linux.

source: Select Linux installation partition:
pt_pt: Selecione a partição de instalação do Linux:

source: Please select a partition from the following list to use for your root (/) Linux partition.
pt_pt: Selecione uma partição da lista a seguir para ser usada como a partição root (/) do Linux.

source: Setting up other Linux partitions.
pt_pt: A configurar outras partições do Linux.

source: Select other Linux partitions for /etc/fstab
pt_pt: Selecione outras partições Linux para o /etc/fstab

source: You seem to have more than one partition tagged as type Linux. You may use these to distribute your Linux system across more than one partition. Currently, you have $ROOT_DEVICE mounted as your / partition. You might want to mount directories such as /home or /usr/local on separate partitions. You should not try to mount /etc, /sbin, or /bin on their own partitions since they contain utilities needed to bring the system up and mount partitions. Also, do not reuse a partition that you've already entered before. Please select one of the Linux partitions listed below, or if you're done, hit <Continue>.
pt_pt: Parece que tem mais de uma partição marcada como tipo Linux. Pode usá-las para distribuir o seu sistema Linux entre duas ou mais partições. No momento tem $ROOT_DEVICE montado como sua partição /. Talvez queira montar diretórios como o /home ou o /usr/local em partições separadas. Não deve tentar montar o /etc, o /sbin ou o /bin em partições próprias, já que eles contêm utilitários necessários para colocar o sistema de pé e montar partições. Além disso, não reutilize uma partição que já tenha sido introduzida. Selecione uma das partições Linux mostradas abaixo, ou se estiver concluído, prima <Continue>.

source: Partition $NEXT_PARTITION will not be reformatted.
pt_pt: A partição $NEXT_PARTITION não será reformatada.

source: Partition $NEXT_PARTITION will be formatted with $NEXT_SYS_TYPE.
pt_pt: A partição $NEXT_PARTITION será formatada com $NEXT_SYS_TYPE.

source: SELECT MOUNT POINT FOR $NEXT_PARTITION
pt_pt: SELECIONAR PONTO DE MONTAGEM PARA $NEXT_PARTITION

source: OK, now you need to specify where you want the new partition mounted. For example, if you want to put it under /usr/local, then respond: /usr/local Where would you like to mount $NEXT_PARTITION?
pt_pt: OK, agora precisa de especificar onde quer que a nova partição seja montada. Por exemplo, se quiser colocá-la em /usr/local, então responda: /usr/local Onde gostaria de montar $NEXT_PARTITION?

source: Finished setting up Linux partitions.
pt_pt: Configuração de partições Linux concluída.

source: DONE ADDING LINUX PARTITIONS TO /etc/fstab
pt_pt: ADIÇÃO DE PARTIÇÕES LINUX AO /etc/fstab CONCLUÍDA

source: WARNING: NO ROOT PASSWORD DETECTED
pt_pt: AVISO: NENHUMA PALAVRA-PASSE DE ROOT DETETADA

source: There is currently no password set on the system administrator account (root). It is recommended that you set one now so that it is active the first time the machine is rebooted. This is especially important if you're using a network enabled kernel and the machine is on an Internet connected LAN. Would you like to set a root password?
pt_pt: No momento não existe palavra-passe definida na conta de administrador de sistema (root). É recomendado que defina uma agora, para que esteja ativada na primeira vez que a máquina for reiniciada. Isso é particularmente importante se estiver a usar um kernel ativado por rede e a máquina estiver numa LAN ligada à Internet. Gostaria de definir uma palavra-passe de root?

source: NO SWAP SPACE DETECTED
pt_pt: NENHUM ESPAÇO DE SWAP DETETADO

source: You have not created a swap partition with Linux fdisk. Do you want to continue installing without one?
pt_pt: Não criou uma partição swap com o fdisk do Linux. Quer continuar a instalar sem uma?

source: ABORTING INSTALLATION
pt_pt: ABORTANDO INSTALAÇÃO

source: Create a swap partition with Linux fdisk, and then try this again.
pt_pt: Criar uma partição swap com o fdisk do Linux e depois tentar novamente.

source: Setting up swap partitions.
pt_pt: A configurar partições swap.

source: SWAP SPACE DETECTED
pt_pt: ESPAÇO DE SWAP DETETADO

source: Slint Setup has detected one or more swap partitions on your system. These partitions have been preselected to be set up as swap space. If there are any swap partitions that you do not wish to use with this installation, please unselect them with the up and down arrows and spacebar. If you wish to use all of them (this is recommended), simply hit the ENTER key.
pt_pt: A configuração do Slint encontrou uma ou mais partições swap no sistema. Estas partições foram pré-selecionadas para serem configuradas como espaço de swap. Se existem partições swap que não quer usar nesta instalação, desmarque-as com as setas para cima e para baixo e a barra de espaço. Se deseja utilizar todas (isto é recomendado), apenas prima a tecla ENTER.

source: Linux swap partition, ${PARTSIZE}
pt_pt: Partição de swap do Linux, ${PARTSIZE}

source: CHECK SWAP PARTITIONS FOR BAD BLOCKS?
pt_pt: PROCURAR POR BAD BLOCKS NAS PARTIÇÕES SWAP?

source: Slint Setup will now prepare your system's swap space. When formatting swap partitions with mkswap you may also check them for bad blocks. This is not the default since nearly all modern hard drives check themselves for bad blocks anyway. Would you like to check for bad blocks while running mkswap?
pt_pt: A configuração do Slint vai agora preparar o espaço de swap do sistema. Ao formatar partições swap com o mkswap pode também verificar se existem bad blocks. Isto não é o padrão, já que praticamente todos os discos rígidos modernos fazem essa verificação de bad blocks automaticamente. Gostaria de procurar por bad blocks enquanto o mkswap é executado?

source: Activating swap partition ${swappartition}:
pt_pt: Ativando partição de swap ${swappartition}:

source: Your swapspace has been configured. This information will be added to your /etc/fstab:
pt_pt: O seu espaço de swap foi configurado. Esta informação será adicionada ao seu /etc/fstab:

source: SWAP SPACE CONFIGURED
pt_pt: ESPAÇO DE SWAP CONFIGURADO

source: Run mkfontdir and mkfontscale in font directories.
pt_pt: Executar o mkfontdir e o mkfontscale em diretórios de fonte.

source: Run fc-cache to locate new fonts for Xft
pt_pt: Executar o fc-cache para localizar novas fontes para o Xft

source: Run update-desktop-database.
pt_pt: Executar o update-desktop-database.

source: Run update-mime-database.
pt_pt: Executar o update-mime-database.

source: Run gtk-update-icon-cache for hicolor theme.
pt_pt: Executar o gtk-update-icon-cache para o tema hicolor.

source: Rebuild SSL certificate database.
pt_pt: Recarregar base de dados de certificados SSL.

source: Install a Linux kernel from a bootdisk
pt_pt: Instalar um kernel Linux de um disco de arranque

source: Create a USB Linux boot stick
pt_pt: Criar uma unidade USB de arranque do Linux

source: Set a default browser link.
pt_pt: Configurar uma ligação do navegador padrão.

source: Set up LILO to boot Linux (and other OSes) from your hard drive
pt_pt: Configurar o LILO para fazer o arranque do Linux (e de outros SOs) do seu disco rígido

source: Configure the console mouse support (GPM).
pt_pt: Configurar o suporte à consola do rato (GPM).

source: Configure basic network settings
pt_pt: Definir configurações básicas de rede

source: Select/deselect system daemons (services)
pt_pt: Selecionar/deselecionar daemons de sistema (serviços)

source: Select a font for the console
pt_pt: Selecionar uma fonte para a consola

source: Select your timezone
pt_pt: Selecionar o fuso horário
