Repository: DidierSpaier/slint-translations
Catalog: translations20220905/pkgtools/*.pkgtools.po
Languages: pt_pt

source: MOUNT ERROR
pt_pt: ERRO DE MONTAGEM

source: SELECT SOURCE DIRECTORY
pt_pt: SELECIONAR DIRETÓRIO FONTE

source: Usage: explodepkg package_name [package_name2, ...] Explodes a Slackware compatible software package (or any tar+{gzip,bzip2,lzma,xz archive) in the current directory. Equivalent to (for each package listed): ( umask 000 ; cat package_name | COMPRESSOR -dc | tar xvf package_name ) Note: This should only be used for debugging or examining packages, not for installing them. It doesn't execute installation scripts or update the package indexes in /var/log/packages and /var/log/scripts.
pt_pt: Uso: explodepkg nome_do_pacote [nome_do_pacote2, ...] Extrai um pacote de software compatível com o Slackware (ou qualquer arquivo tar+{gzip,bzip2,lzma,xz) no diretório atual. Equivalente a (para cada pacote exibido): ( umask 000 ; cat nome_do_pacote | COMPRESSOR -dc | tar xvf nome_do_pacote ) Nota: Isso só deve ser usado para depurar ou examinar pacotes, não para instalá-los. Ele não executa scripts de instalação ou atualiza os índices de pacotes em /var/log/packages e /var/log/scripts.

source: Exploding package $PKG in current directory:
pt_pt: Explodindo pacote $PKG no diretório atual:

source: An installation script was detected in ./install/doinst.sh, but was not executed.
pt_pt: Um script de instalação foi detetado em ./install/doinst.sh, mas não foi executado.

source: WARNING: pkgtools are unstable with tar > 1.13. You should provide a "tar-1.13" in your $PATH
pt_pt: AVISO: o pkgtools é instável com tar > 1.13. Deve fornecer um "tar-1.13" no seu $PATH

source: Usage: installpkg [options] <package_filename> Installpkg is used to install a .t{gz,bz,lz,xz} package like this: installpkg slackware-package-1.0.0-i486-1.tgz (or .tbz, .tlz, .txz) options: --warn (warn if files will be overwritten, but do not install) --root /mnt (install someplace else, like /mnt) --infobox (use dialog to draw an info box) --terse (display a one-line short description for install) --menu (confirm package installation with a menu) --md5sum (record the package's md5sum in the metadata file)
pt_pt: Uso: installpkg [opções] <ficheiro_do_pacote> O installpkg é usado para instalar um pacote .t{gz,bz,lz,xz} desta forma: installpkg pacote-slackware-1.0.0-i486-1.tgz (ou .tbz, .tlz, .txz) opções: --warn (avisa se ficheiros serão sobrescritos, mas não instala) --root /mnt (instala num outro lugar, por exemplo no /mnt) --infobox (usa o dialog para desenhar uma caixa de informação) --terse (mostra uma pequena descrição de uma linha para a instalação) --menu (confirma a instalação do pacote com um menu) --md5sum (grava o md5sum do pacote no ficheiro de metadados)

source: Cannot install $package: file not found
pt_pt: Não foi possível instalar $package: ficheiro não encontrado

source: Cannot install $package: file does not end in .tgz, .tbz, .tlz, or .txz
pt_pt: Não foi possível instalar $package: ficheiro não termina em .tgz, .tbz, .tlz ou .txz

source: Cannot install $package: external compression utility $packagecompression missing
pt_pt: Não foi possível instalar $package: utilitário de compressão externo $packagecompression não encontrado

source: Verifying package $package_name.
pt_pt: A verificar o pacote $package_name.

source: Unable to install $package: tar archive is corrupt (tar returned error code $TARERROR)
pt_pt: Impossível instalar $package: o arquivo tar está corrompido (tar retornou código de erro $TARERROR)

source: Size: Compressed: ${COMPRESSED}, uncompressed: ${UNCOMPRESSED}.
pt_pt: Tamanho: Comprimido: ${COMPRESSED}, descomprimido: ${UNCOMPRESSED}.

source: Installing package $package_name:
pt_pt: A instalar o pacote $package_name:

source: PACKAGE DESCRIPTION:
pt_pt: DESCRIÇÃO DO PACOTE:

source: Installing package $shortname $PMSG
pt_pt: A instalar o pacote $shortname $PMSG

source: Package Name: $shortname $PMSG
pt_pt: Nome do pacote: $shortname $PMSG

source: Install package $shortname
pt_pt: Instalar o pacote $shortname

source: Do not install package $shortname
pt_pt: Não instalar pacote $shortname

source: Abort software installation completely
pt_pt: Abortar completamente a instalação do programa

source: WARNING: Package has not been created with 'makepkg'
pt_pt: AVISO: O pacote não foi criado com o 'makepkg'

source: Executing install script for $package_name.
pt_pt: A executar script de instalação para $package_name.

source: Package $package_name installed.
pt_pt: Pacote $package_name instalado.

source: WARNING: pkgtools are unstable with tar > 1.13. You should provide a "tar-1.13" in your $PATH.
pt_pt: AVISO: o pkgtools é instável com tar > 1.13. Deve providenciar um "tar-1.13" no seu $PATH.

source: Usage: makepkg package_name.tgz (or: package_name.tbz, package_name.tlz, package_name.txz) Makes a Slackware compatible package containing the contents of the current and all subdirectories. If symbolic links exist, they will be removed and an installation script will be made to recreate them later. This script will be called "install/doinst.sh". You may add any of your own ash-compatible shell scripts to this file and rebuild the package if you wish. options: -l, --linkadd y|n (moves symlinks into doinst.sh: recommended) -p, --prepend (prepend rather than append symlinks to an existing doinst.sh. Useful to link libraries needed by programs in the doinst.sh script) -c, --chown y|n (resets all permissions to root:root 755 - not generally recommended) If these options are not set, makepkg will prompt as appropriate.
pt_pt: Uso: makepkg nome_do_pacote.tgz (ou: nome_do_pacote.tbz, nome_do_pacote.tlz, nome_do_pacote.txz) Cria um pacote compatível de Slackware do conteúdo do diretório atual e de todos os seus subdiretórios. Se uma ligação simbólica existir, será removida e um script de instalação será criado para recriá-lo depois. Este script será chamado "install/doinst.sh". Pode adicionar os seus próprios scripts compatíveis com *ash a este ficheiro e recompilar o pacote se desejar. opções: -l, --linkadd y|n (move symlinks para o doinst.sh: recomendado) -p, --prepend (precede em vez de adicionar symlinks a um doinst.sh existente. Útil para ligar bibliotecas necessárias por programas no script doinst.sh) -c, --chown y|n (redefine todas as permissões para root:root 755 - geralmente não recomendado) Se estas opções não forem definidas, o makepkg irá perguntar quando apropriado.

source: ERROR: gzip compression utility not found in $PATH.
pt_pt: ERRO: utilitário de compressão gzip não encontrado em $PATH.

source: ERROR: bzip2 compression utility not found in $PATH.
pt_pt: ERRO: utilitário de compressão bzip2 não encontrado em $PATH.

source: ERROR: lzma compression utility not found in $PATH.
pt_pt: ERRO: utilitário de compressão lzma não encontrado em $PATH.

source: ERROR: xz compression utility not found in $PATH.
pt_pt: ERRO: utilitário de compressão xz não encontrado em $PATH.

source: Slackware package maker, version 3.141593.
pt_pt: Compilador de pacotes do Slackware, versão 3.141593.

source: Searching for symbolic links:
pt_pt: A procurar por ligações simbólicas:

source: Unless your existing installation script already contains the code to create these links, you should append these lines to your existing install script. Now's your chance. :^) Would you like to add this stuff to the existing install script and remove the symbolic links
pt_pt: A menos que o seu script de instalação existente já contenha o código para criar essas ligações, deve incluir estas linhas no seu script de instalação existente. Agora é a sua oportunidade. :^) Gostaria de adicionar isto ao script de instalação existente e remover as ligações simbólicas

source: It is recommended that you make these lines your new installation script. Would you like to make this stuff the install script for this package and remove the symbolic links
pt_pt: É recomendado que faça destas linhas o seu novo script de instalação. Gostaria de fazer disto o novo script de instalação para este pacote e remover as ligações simbólicas

source: Removing symbolic links:
pt_pt: A remover ligações simbólicas:

source: Updating your ./install/doinst.sh (prepending symlinks)...
pt_pt: A atualizar o ./install/doinst.sh (precedendo as ligações simbólicas)...

source: Updating your ./install/doinst.sh...
pt_pt: A atualizar o ./install/doinst.sh...

source: Creating your new ./install/doinst.sh...
pt_pt: A criar o novo ./install/doinst.sh...

source: No symbolic links were found, so we won't make an installation script. You can make your own later in ./install/doinst.sh and rebuild the package if you like.
pt_pt: Nenhuma ligação simbólica foi encontrada, por isso não criaremos um script de instalação. Pode criar depois o seu em ./install/doinst.sh e recompilar o pacote se quiser.

source: This next step is optional - you can set the directories in your package to some sane permissions. If any of the directories in your package have special permissions, then DO NOT reset them here! Would you like to reset all directory permissions to 755 (drwxr-xr-x) and directory ownerships to root.root
pt_pt: Este próximo passo é opcional - pode definir os diretórios no seu pacote para permissões seguras. Se qualquer um dos diretórios no seu pacote tiver permissões especiais, então NÃO as reponha aqui! Gostaria de repor as permissões de todos os diretórios para 755 (drwxr-xr-x) e as propriedades dos diretórios para root.root

source: WARNING: $PWD is chmod $OLDROOTPERMS temporarily changing to chmod 755
pt_pt: WARNING: $PWD é chmod $OLDROOTPERMS temporariamente a alterar para chmod 755

source: Creating Slackware package: ${TARGET_NAME}/${TAR_NAME}.${EXTENSION}
pt_pt: A criar pacote do Slackware: ${TARGET_NAME}/${TAR_NAME}.${EXTENSION}

source: ERROR: gzip returned error code $ERRCODE -- makepkg failed.
pt_pt: ERRO: gzip retornou código de erro $ERRCODE -- makepkg falhou.

source: ERROR: bzip2 returned error code $ERRCODE -- makepkg failed.
pt_pt: ERRO: bzip2 retornou código de erro $ERRCODE -- makepkg falhou.

source: ERROR: lzma returned error code $ERRCODE -- makepkg failed.
pt_pt: ERRO: lzma retornou código de erro $ERRCODE -- makepkg falhou.

source: ERROR: xz returned error code $ERRCODE -- makepkg failed.
pt_pt: ERRO: xz retornou código de erro $ERRCODE -- makepkg falhou.

source: WARNING: zero length file
pt_pt: AVISO: ficheiro de tamanho zero

source: WARNING: gzip test failed on
pt_pt: AVISO: falha do teste gzip

source: WARNING: /usr/share/man (with possibly not gzipped man pages) detected
pt_pt: AVISO: /usr/share/man (com possíveis páginas de manual não gzipped) detetado

source: WARNING: /usr/share/info (with possibly not gzipped info pages) detected
pt_pt: AVISO: /usr/share/info (com possíveis páginas de manual de informação não gzipped) detetado

source: WARNING: site_perl directory detected (this is fine for a local package build)
pt_pt: AVISO: diretório site_perl detetado (aceitável para uma compilação de pacote local)

source: Restoring permissions of $PWD to chmod $OLDROOTPERMS
pt_pt: A restaurar permissões do $PWD para chmod $OLDROOTPERMS

source: Slackware package ${TARGET_NAME}/${TAR_NAME}.${EXTENSION} created.
pt_pt: Pacote do Slackware: ${TARGET_NAME}/${TAR_NAME}.${EXTENSION} criado.

source: You can't run pkgtool from the rootdisk until you've mounted your Linux partitions beneath /mnt. Here are some examples: If your root partition is /dev/sda1 you would type: mount /dev/sda1 /mnt Now you can find a list of all your partitions in /mnt/etc/fstab. Then, supposing your /usr partition is /dev/sda2, you must do this: mount /dev/sda2 /mnt/usr Please mount your Linux partitions and then run pkgtool again.
pt_pt: Não pode executar o pkgtool a partir do disco root até que tenha montado as partições Linux no /mnt. Aqui estão alguns exemplos: Se a partição root é /dev/sda1 deve escrever: mount /dev/sda1 /mnt Agora pode encontrar uma lista de todas as partições em /mnt/etc/fstab. Depois, supondo que a partição /usr seja /dev/sda2, tem que fazer isto: mount /dev/sda2 /mnt/usr Monte as partições Linux e execute o pkgtool novamente.

source: PACKAGE REMOVAL IN PROGRESS
pt_pt: REMOÇÃO DE PACOTE EM CURSO

source: Removing package $pkg_name. Since each file must be checked against the contents of every other installed package to avoid wiping out areas of overlap, this process can take quite some time. If you would like to watch the progress, flip over to another virtual console and type: tail -f $TMP/PKGTOOL.REMOVED
pt_pt: A remover o pacote $pkg_name. Como cada ficheiro deve ser comparado com o conteúdo de cada outro pacote instalado para evitar limpar áreas que se sobrepõe, este processo pode levar algum tempo. Caso queira assistir ao progresso, mude para outra consola virtual e escreva: tail -f $TMP/PKGTOOL.REMOVED

source: View information about package
pt_pt: Mostrar informação sobre o pacote

source: Select\/Unselect removing package
pt_pt: Selecione\/Desselecione a remoção do pacote

source: Slint Package Tool (pkgtool version ${Version})
pt_pt: Ferramenta de pacotes do Slint (versão pkgtool ${Version})

source: Welcome to the Slint package tool Which option would you like?
pt_pt: Bem-vindo(a) à ferramenta de pacotes do Slint Que opção deseja?

source: Install packages from the current directory
pt_pt: Instalar pacotes do diretório atual

source: Install packages from some other directory
pt_pt: Instalar pacotes de outro diretório

source: Remove packages that are currently installed
pt_pt: Remover pacotes que estão instalados atualmente

source: View the list of files contained in a package
pt_pt: Ver a lista de ficheiros contida num pacote

source: Choose Slint installation scripts to run again
pt_pt: Escolher scripts de instalação do Slint a executar novamente

source: Exit Pkgtool
pt_pt: Sair do Pkgtool

source: SELECT SYSTEM SETUP SCRIPTS
pt_pt: SELECIONAR SCRIPTS DE CONFIGURAÇÃO DO SISTEMA

source: Please use the spacebar to select the setup scripts to run. Hit enter when you are done selecting to run the scripts.
pt_pt: Utilize a barra de espaço para selecionar os scripts de instalação a serem executados. Prima enter quando terminar de selecionar para executar os scripts.

source: Please select the package you wish to view.
pt_pt: Selecione o pacote que deseja visualizar.

source: CONTENTS OF PACKAGE: $PkG
pt_pt: CONTEÚDO DO PACOTE: $PkG

source: SELECT PACKAGES TO REMOVE
pt_pt: SELECIONAR PACOTES A REMOVER

source: Please select the packages you wish to Remove. Use the spacebar to select packages to delete, and the UP/DOWN arrow keys to scroll up and down through the entire list.
pt_pt: Selecione os pacotes que deseja remover. Utilize a barra de espaço para selecionar os pacotes a eliminar, e as teclas CIMA/BAIXO para navegar para cima e para baixo através de toda a lista.

source: NO PACKAGES REMOVED
pt_pt: NENHUM PACOTE REMOVIDO

source: Hit OK to return to the main menu.
pt_pt: Prima OK para regressar ao menu principal.

source: PACKAGE REMOVAL COMPLETE
pt_pt: REMOÇÃO DE PACOTE CONCLUÍDA

source: The packages have been removed. A complete log of the files that were removed has been created in $TMP/PKGTOOL.REMOVED.
pt_pt: Os pacotes foram removidos. Um registo completo dos ficheiros que foram removidos foi criado em $TMP/PKGTOOL.REMOVED.

source: Please enter the name of the directory that you wish to install packages from:
pt_pt: Introduza o nome do diretório de onde deseja instalar pacotes:

source: DIRECTORY NOT FOUND
pt_pt: DIRETÓRIO NÃO ENCONTRADO

source: The directory you want to install from ($SOURCE_DIR) does not seem to exist. Please check the directory and then try again.
pt_pt: O diretório de onde quer instalar ($SOURCE_DIR) parece não existir. Verifique o diretório e tente novamente.

source: Your source device cannot be accessed properly. Please be sure that it is mounted on $SOURCE_DIR, and that the Slint disks are found in subdirectories of $SOURCE_DIR like specified.
pt_pt: O seu dispositivo de origem não pode ser acedido corretamente. Certifique-se de que o mesmo está montado em $SOURCE_DIR, e de que os discos do Slint estão nos sub-diretórios de $SOURCE_DIR como especificado.

source: INSERT DISK
pt_pt: INSERIR DISCO

source: Please insert disk $NumDisk and press ENTER to continue.
pt_pt: Insira o disco $NumDisk e prima ENTER para continuar.

source: Continue with the installation
pt_pt: Continuar com a instalação

source: Skip the current disk series
pt_pt: Ignorar a série de discos atual

source: Abort the installation process
pt_pt: Abortar o processo de instalação

source: ABORTING
pt_pt: A ABORTAR

source: Aborting software installation.
pt_pt: A abortar instalação do programa.

source: MOUNT PROBLEM
pt_pt: PROBLEMA DE MONTAGEM

source: Media was not successfully mounted! Do you want to retry, or quit?
pt_pt: O suporte não foi montado com sucesso! Deseja tentar novamente, ou sair?

source: Try to mount the disk again
pt_pt: Tentar montar o disco novamente

source: No, abort.
pt_pt: Não, abortar.

source: --> $ROOT/$FILE was found in another package. Skipping.
pt_pt: --> $ROOT/$FILE foi encontrado num outro pacote. A ignorar.

source: WARNING: Nonexistent $ROOT/$FILE was found in another package. Skipping.
pt_pt: AVISO: $ROOT/$FILE inexistente foi encontrada num outro pacote. A ignorar.

source: --> $ROOT/$LINK (symlink) was found in another package. Skipping.
pt_pt: --> $ROOT/$LINK (ligação simbólica) foi encontrada num outro pacote. A ignorar.

source: WARNING: Nonexistent $ROOT/$LINK (symlink) was found in another package. Skipping.
pt_pt: AVISO: Inexistente $ROOT/$LINK (ligação simbólica) foi encontrada num outro pacote. A ignorar.

source: WARNING: $ROOT/$FILE changed after package installation.
pt_pt: AVISO: $ROOT/$FILE alterado após a instalação do pacote.

source: --> Deleting $ROOT/$FILE
pt_pt: --> A eliminar $ROOT/$FILE

source: --> $ROOT/$FILE would be deleted
pt_pt: --> $ROOT/$FILE seria eliminado

source: --> $ROOT/$FILE no longer exists. Skipping.
pt_pt: --> $ROOT/$FILE já não existe. A ignorar.

source: --> Deleting symlink $ROOT/$LINK
pt_pt: --> A eliminar ligação simbólica $ROOT/$LINK

source: --> $ROOT/$LINK (symlink) would be deleted
pt_pt: --> $ROOT/$LINK (ligação simbólica) seria eliminada

source: --> $ROOT/$LINK (symlink) no longer exists. Skipping.
pt_pt: --> $ROOT/$LINK (ligação simbólica) já não existe. A ignorar.

source: --> Deleting empty directory $ROOT/$DIR
pt_pt: --> A eliminar diretório vazio $ROOT/$DIR

source: WARNING: Unique directory $ROOT/$DIR contains new files
pt_pt: AVISO: Diretório único $ROOT/$DIR contém novos ficheiros

source: --> $ROOT/$DIR (dir) would be deleted if empty
pt_pt: --> $ROOT/$DIR (diretório) seria eliminado se estivesse vazio

source: --> Deleting $ROOT/$FILE (fmt man page)
pt_pt: --> A eliminar $ROOT/$FILE (fmt man page)

source: --> $ROOT/$FILE (fmt man page) would be deleted
pt_pt: --> $ROOT/$FILE (fmt man page) seria eliminado

source: Removing package $ADM_DIR/packages/$PKGNAME...
pt_pt: A remover pacote $ADM_DIR/packages/$PKGNAME...

source: Removing files:
pt_pt: A remover ficheiros:

source: No such package: $ADM_DIR/packages/$PKGNAME. Can't remove.
pt_pt: Pacote não existente: $ADM_DIR/packages/$PKGNAME. Não é possível remover.

source: Usage:
pt_pt: Utilização:

source: Only warning... not actually removing any files.
pt_pt: Apenas avisando... na verdade nenhum ficheiro a ser removido.

source: Package contents is copied to $PRES_DIR.
pt_pt: Conteúdo do pacote copiado para $PRES_DIR.

source: Here's what would be removed (and left behind) if you removed the package(s):
pt_pt: Aqui está o que seria removido (e deixado para trás) se removesse o(s) pacote(s):

source: Select the default startup mode
pt_pt: Selecione o modo de inicialização padrão

source: Please choose the default startup mode: Console or Graphical. In Console mode, you log in and type your first command in a console. In this mode you can type "startx" to start the default desktop or windows manager, that you can also change typing "xwmconfig". In Graphical mode, you choose the desktop or windows manager, that will be started as soon as you are identified.
pt_pt: Escolha o modo de inicialização padrão: Consola ou Gráfico. No modo de consola, inicie sessão e escreva o seu primeiro comando numa consola. Neste modo, pode escrever "startx" para iniciar o ambiente de trabalho padrão ou o gestor de janelas, que também pode alterar escrevendo "xwmconfig". No modo Gráfico, escolhe o ambiente de trabalho ou o gestor de janelas, que será iniciado assim que for identificado.

source: Start Linux in Console mode
pt_pt: Inicie o Linux no modo Consola

source: Start Linux in Graphical mode
pt_pt: Inicie o Linux no modo Gráfico

source: Usage: upgradepkg newpackage [newpackage2 ... ] upgradepkg oldpackage%newpackage [oldpackage2%newpackage2 ... ] Upgradepkg upgrades a Slint package (.tgz, .tbz, .tlz, .txz) from an older version to a newer one. It does this by INSTALLING the new package onto the system, and then REMOVING any files from the old package that aren't in the new package. If the old and new packages have the same name, a single argument is all that is required. If the packages have different names, supply the name of the old package followed by a percent symbol (%), then the name of the new package. Do not add any extra whitespace between pairs of old/new package names. Before upgrading a package, save any configuration files (such as in /etc) that you wish to keep. Sometimes these will be preserved, but it depends on the package. If you want to force new versions of the config files to be installed, remove the old ones manually prior to running upgradepkg. To upgrade in a directory other than / (such as /mnt): ROOT=/mnt upgradepkg package.tgz (or .tbz, .tlz, .txz)
pt_pt: Uso: upgradepkg pacotenovo [pacotenovo2 ... ] upgradepkg oldpackage%newpackage [oldpackage2%newpackage2 ... ] O upgradepkg atualiza um pacote Slint (.tgz, .tbz, .tlz, .txz) de uma versão mais antiga para uma mais nova. Ele faz isso ao INSTALAR o pacote novo no sistema e REMOVENDO, em seguida, todos os ficheiros do pacote antigo que não estejam no pacote novo. Se o pacote antigo e o novo têm o mesmo nome, só é necessário um argumento. Se os pacotes têm nomes diferentes, forneça o nome do pacote antigo seguido de um símbolo de percentagem (%), e em seguida o nome do pacote novo. Não insira espaços em branco adicionais entre os pares de nomes de pacote antigo/novo. Antes de atualizar um pacote, grave todos os ficheiros de configuração (como em /etc) que queira manter. Algumas vezes eles serão preservados, mas isso depende do pacote. Se quer forçar que versões novas dos ficheiros de configuração sejam instaladas, remova os antigos manualmente antes de executar o upgradepkg. Para atualizar num diretório diferente do / (como no /mnt): ROOT=/mnt upgradepkg pacote.tgz (ou .tbz, .tlz, .txz)

source: Installing new package $INCOMINGDIR/$NNAME
pt_pt: A instalar novo pacote $INCOMINGDIR/$NNAME

source: $NEW would be skipped (already installed).
pt_pt: $NEW seria ignorado (já está instalado).

source: Skipping package $NEW (already installed)
pt_pt: A ignorar o pacote $NEW (já está instalado)

source: Upgrading $OLD package using $INCOMINGDIR/$NNAME
pt_pt: A atualizar o pacote $OLD usando $INCOMINGDIR/$NNAME

source: ERROR: Package $INCOMINGDIR/$NNAME did not install correctly. You may need to reinstall your old package to avoid problems. Make sure the new package is not corrupted.
pt_pt: ERRO: O pacote $INCOMINGDIR/$NNAME não foi instalado corretamente. Pode ser necessário reinstalar o pacote antigo para evitar problemas. Certifique-se de que o novo pacote não está corrompido.

source: Package $OLD upgraded with new package $INCOMINGDIR/$NNAME.
pt_pt: Pacote $OLD atualizado com o novo pacote $INCOMINGDIR/$NNAME.
